{"video_id": "15cdyl2PU-E", "url": "https://www.youtube.com/watch?v=15cdyl2PU-E", "title": "15cdyl2PU-E", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 10.8, "text": "Hello guys and welcome back to my channel. Today I'm going to check a new DJI-friendly F7 flight"}, {"start": 10.8, "end": 17.54, "text": "controller and a very capable 20x20mm stack by T-Motor. In this video I'm going to go over their"}, {"start": 17.54, "end": 22.16, "text": "features and specs and show you how to set them up using both digital and analog systems."}, {"start": 22.98, "end": 29.76, "text": "First let's start with the 20x20mm stack. In terms of packaging, inside the box you can find the"}, {"start": 29.76, "end": 38.96, "text": "flight controller. The 4-in-1 ESC which comes with a pre-soldered 35V 470μF capacitor. A bag with M3"}, {"start": 38.96, "end": 46.34, "text": "screws, nuts and silicone grammets. A high quality XT60 battery connector with pre-soldered 14G silicone"}, {"start": 46.34, "end": 53.02, "text": "coated wires. A harness for connecting the 4-in-1 ESC and the flight controller and a GST connector"}, {"start": 53.02, "end": 59.06, "text": "that will enable you to easily connect a DJI air unit. In terms of specs, the flight controller"}, {"start": 59.06, "end": 67.44, "text": "features an F7 processor, 5 full U-out ports, in addition to a 5V BEC, a 10V BEC which is useful"}, {"start": 67.44, "end": 74.14, "text": "for powering a DJI air unit and a dedicated connector for hooking it up. As for the 4-in-1 ESC,"}, {"start": 74.42, "end": 81.48, "text": "its current rating is 45A, it features well-separated motor and battery pads, a built-in current sensor,"}, {"start": 81.48, "end": 88.36, "text": "it's running BLL32 firmware and just like the flight controller, it can be powered with up to 6S batteries."}, {"start": 89.16, "end": 95.86, "text": "In addition, the weight of the flight controller is 5.3 grams. The weight of the 4-in-1 ESC including the"}, {"start": 95.86, "end": 104.42, "text": "capacitor is 10.9 grams. They are both using 20x20mm M3 mounting holes. The outer dimensions of the flight"}, {"start": 104.42, "end": 113.48, "text": "controller are 27.7 x 29.9 x 6.4 millimeters. The 4-in-1 ESC is a little bit bigger and its outer"}, {"start": 113.48, "end": 121.76, "text": "dimensions are 33.4 x 39.3 x 6.4 millimeters and the total weight of the stack including the GST"}, {"start": 121.76, "end": 128.16, "text": "harness is 17.1 grams. Now let's quickly go over a couple of guidelines when installing the stack."}, {"start": 128.16, "end": 134.7, "text": "Next to the micro USB port, you can find dedicated pads for connecting a ready receiver and you can"}, {"start": 134.7, "end": 140.76, "text": "choose whether to power the ready receiver using 3.3 or 5 volts by bridging the center pad with the"}, {"start": 140.76, "end": 145.34, "text": "right one or with the left one. Pay attention that if you are going to leave it unbridged,"}, {"start": 145.78, "end": 151.64, "text": "the ready receiver is not going to be powered up. The easiest way to connect the DJI air unit to the"}, {"start": 151.64, "end": 157.5, "text": "flight controller is using the provided GST connector. The air unit is going to be powered using the 10V"}, {"start": 157.5, "end": 164.06, "text": "BAC. In order to display the OSD data, you need to enable the MSP switch on UART3 and pay attention"}, {"start": 164.06, "end": 169.24, "text": "that in case you are going to use an external ready receiver, you need to disconnect the yellow wire as"}, {"start": 169.24, "end": 174.8, "text": "it is wired to UART1. On the back of the flight controller, you can find the relevant pads for"}, {"start": 174.8, "end": 181.96, "text": "connecting an analog VTX and in case you would like to control the 10V BAC using an auxiliary switch,"}, {"start": 182.38, "end": 187.44, "text": "you can solder these two pads over here and then assign an auxiliary switch to the user"}, {"start": 187.44, "end": 193.04, "text": "one mod on bit of light. Pay attention that this feature only applies to the 10V pads,"}, {"start": 193.38, "end": 198.68, "text": "which means that in case you would like to use it, you can't use VTXs that only support a DC input"}, {"start": 198.68, "end": 205.14, "text": "voltage of 5V. Here you can see what it looks like when the stack is assembled. So it features a slim"}, {"start": 205.14, "end": 210.74, "text": "home factor and it is quite remarkable that such a small stack can power a 5-inch 6S build."}, {"start": 211.34, "end": 216.22, "text": "Now let's move on to the newly introduced single-sided Pacer F7 flight controller,"}, {"start": 216.68, "end": 221.9, "text": "which actually came as a part of this plug-and-play build, which as far as I know is still not available."}, {"start": 222.60000000000002, "end": 228.72, "text": "In terms of specs, this flight controller features an F7 processor, a USB Type-C connector,"}, {"start": 228.72, "end": 237.16, "text": "6 full UO ports, a dedicated connector for a DJI air unit. In addition to a 10-pin-suggester connector"}, {"start": 237.16, "end": 242.34, "text": "for connecting the flight controller with the 4-in-1 ESC, you can find the matching pads on the"}, {"start": 242.34, "end": 248.02, "text": "bottom of the flight controller. Most of the pads can be accessed from both top and bottom sides of"}, {"start": 248.02, "end": 254.46, "text": "the flight controller. On its bottom, there are no electronic parts and pay attention that it only features"}, {"start": 254.46, "end": 261.26, "text": "a 5V BAC and all the 10V pads are just pass-through pads, which rely on the fact that you are going"}, {"start": 261.26, "end": 270.26, "text": "to use a 4-in-1 ESC, which features a built-in 10V BAC. In addition, the flight controller is using 30.5 by"}, {"start": 270.26, "end": 280.74, "text": "30.5 mm M3 mounting holes. It weighs 8 grams and its outer dimensions are 40.1 by 39.2 by 7.8 mm."}, {"start": 280.74, "end": 286.84000000000003, "text": "In case you are going to use a DJI air unit and connect it to the dedicated connector, pay attention"}, {"start": 286.84000000000003, "end": 291.82, "text": "that in case you are going to use a 6-pin GST connector, it is connected all the way to the right,"}, {"start": 292.18, "end": 298.88, "text": "as the left pin is an extra ground pin which is not in use. In order to display the OSD data on your DJI"}, {"start": 298.88, "end": 305.92, "text": "goggles, you need to enable the MSP switch on your 3D. And remember that as I just mentioned, the 10V pad"}, {"start": 305.92, "end": 312.46000000000004, "text": "is just a pass-through, so in case you are not going to use a supported 4-in-1 ESC, the DJI air unit is not"}, {"start": 312.46000000000004, "end": 318.44, "text": "going to be powered up, so what you can do is to bridge the VBAT and 10V pads, but keep in mind"}, {"start": 318.44, "end": 324.3, "text": "that the DJI air unit can be powered directly with up to 4S batteries. As for the rest of the setup,"}, {"start": 324.74, "end": 328.94, "text": "you can wire the ready receiver to the pads which are located on the back of the flight controller,"}, {"start": 328.94, "end": 335.18, "text": "and then power it either using 3.3 or 5V. Pay attention that in case you are going to use an"}, {"start": 335.18, "end": 342.02, "text": "S-Bus receiver, you will need to use the RX5 pin of the DJI air unit connector. Finally, in case you"}, {"start": 342.02, "end": 347.9, "text": "are going to use an analog setup, the VTX and FEB camera are going to be wired to the pads which are"}, {"start": 347.9, "end": 353.64, "text": "located on the front of the flight controller. You can power them either using 10V, 5V and VBAT,"}, {"start": 353.64, "end": 359.97999999999996, "text": "and in addition you can also find a dedicated pad for camera control for configuring an analog FPV camera."}, {"start": 360.9, "end": 366.4, "text": "So overall, the T-Motor Pacer F7 flight controller looks like a pretty good option for a DJI air unit"}, {"start": 366.4, "end": 373.06, "text": "setup, but keep in mind that you need to match it with a compatible 4-in-1 ESC since it lakes a 10V BC."}, {"start": 374.21999999999997, "end": 379.09999999999997, "text": "As for the mini stack, as far as I can tell it looks like a pretty good option for a light 5-inch"}, {"start": 379.1, "end": 384.56, "text": "build. Its main downside, which is subjective, is that it's a little bit on the pricey side"}, {"start": 384.56, "end": 389.70000000000005, "text": "since it costs around $100 and soon I'm going to feature it in a build-in-flight video,"}, {"start": 389.94, "end": 394.70000000000005, "text": "so we'll see how it goes. Anyway, that's going to be it for this quick video. As always,"}, {"start": 394.82000000000005, "end": 398.38, "text": "if you have any questions, feel free to ask them in the comments section down below."}, {"start": 398.8, "end": 403.64000000000004, "text": "Don't forget to leave a thumbs up if you like this video and consider subscribing to my channel"}, {"start": 403.64000000000004, "end": 408.72, "text": "and hitting the notifications bell if you're not already subscribed. See you on my next videos,"}, {"start": 408.72, "end": 409.52000000000004, "text": "and goodbye."}]}