{"video_id": "DeSDjjicGWY", "url": "https://www.youtube.com/watch?v=DeSDjjicGWY", "title": "DeSDjjicGWY", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 17.44, "text": "So, I finally did it. After stating in a video from 2017 that I would finish a DIY drone by 2022,"}, {"start": 18.16, "end": 26.0, "text": "I am happy to say that I was finally able to put together this drone. Which can in fact fly but"}, {"start": 26.0, "end": 32.24, "text": "I am still a beginner when it comes to controlling it. Now you probably already noticed that this is"}, {"start": 32.24, "end": 39.519999999999996, "text": "not your standard drone like for example DJI mostly makes them which fly rather slow and controlled"}, {"start": 39.519999999999996, "end": 48.0, "text": "so that you can make beautiful recordings. No, this is an FPV or first person view drone meaning"}, {"start": 48.0, "end": 53.68, "text": "you can not only see what the drone sees while flying but it also moves way faster through the"}, {"start": 53.68, "end": 60.08, "text": "air and thus lets you capture some unique video footage with the help of a GoPro on top."}, {"start": 61.12, "end": 67.68, "text": "And the reason why I built this was that months ago I got a beginners FPV drone kit that came with a tiny"}, {"start": 67.68, "end": 75.52, "text": "drone which works wonderfully but can easily get blown away by the wind. So, I wanted something a"}, {"start": 75.52, "end": 81.92, "text": "bit bigger and heavier and I feel like I went overboard here but you will see that later."}, {"start": 81.92, "end": 88.8, "text": "Before that though let me show you my journey of building this thing which was not super easy to"}, {"start": 88.8, "end": 94.56, "text": "do because the drone market just overflows with different hardware, communication protocols and"}, {"start": 94.56, "end": 102.0, "text": "software. But luckily after this video you should have a good idea of what is going on and you should"}, {"start": 102.0, "end": 106.56, "text": "be able to build something similar. So, let's get started!"}, {"start": 115.04, "end": 121.28, "text": "This video is sponsored by Keysight who have a huge virtual event coming up called Keysight World Innovate."}, {"start": 122.16, "end": 128.08, "text": "It is 4 days long and during that time industry leaders and experts will share their vision of future"}, {"start": 128.08, "end": 136.72000000000003, "text": "technology which involves 5G and 6G, electric and autonomous vehicle advances, quantum technology"}, {"start": 136.72000000000003, "end": 142.64000000000001, "text": "and much much more. If that sounds interesting to you then check out the link in the video description."}, {"start": 144.48000000000002, "end": 150.8, "text": "Let's start off by exploring what parts we need for drone and let's use my completed one as an example."}, {"start": 150.8, "end": 157.36, "text": "The first obvious part is of course a frame onto which all other components get mounted on."}, {"start": 158.4, "end": 165.20000000000002, "text": "Next are the motors with propellers that create the upward thrust while spinning and of course we also"}, {"start": 165.20000000000002, "end": 172.48000000000002, "text": "need a battery to power it all. Then some kind of receiver that like the name implies receives a signal"}, {"start": 172.48000000000002, "end": 179.76000000000002, "text": "from a remote so that the drone knows what direction to follow. And since we are dealing with an FPV drone,"}, {"start": 179.76, "end": 187.92, "text": "we also need a camera and a VTX system with fitting antenna of which I honestly also never heard of before."}, {"start": 188.88, "end": 194.79999999999998, "text": "It stands for Video Transmitter and it basically takes the camera video signal and sends it out as"}, {"start": 194.79999999999998, "end": 201.51999999999998, "text": "a 5.8GHz signal that the FPV goggles which we also need can then receive and play back."}, {"start": 202.56, "end": 206.64, "text": "And the last things they are missing are the VC board and ESC board."}, {"start": 206.64, "end": 212.48, "text": "Now FC stands for Flight Controller and it is basically the heart of the system."}, {"start": 213.44, "end": 219.76, "text": "It for example comes with an accelerometer IC which the drone uses to find out how it is positioned in"}, {"start": 219.76, "end": 226.64, "text": "the air and through the help of an integrated PID control loop it can then tell each motor how fast"}, {"start": 226.64, "end": 233.35999999999999, "text": "to spin so that it can stand upright in the air without crashing. Of course it also manages to receive"}, {"start": 233.36, "end": 238.72000000000003, "text": "controller signal, camera signal, outputs the VTX signal and much much more."}, {"start": 239.60000000000002, "end": 246.88000000000002, "text": "The only big thing it cannot do directly is driving the BLDC motors for which we got the ESC board"}, {"start": 246.88000000000002, "end": 253.68, "text": "aka electronic speed controller board that drives the motors at a specific speed depending on how the"}, {"start": 253.68, "end": 260.56, "text": "flight controller demands it. And those were all in all the basic components required for an FPV drone"}, {"start": 260.56, "end": 268.0, "text": "and I started my component hunt by firstly looking for a frame. The reason is that depending on whether"}, {"start": 268.0, "end": 273.36, "text": "you choose a small or big frame all the other components have to be smaller or bigger too."}, {"start": 274.24, "end": 280.48, "text": "And honestly speaking I didn't feel like buying a pre-made frame because when 3D printing a frame"}, {"start": 280.48, "end": 287.68, "text": "you can always easily replace parts and by using PETG filament you also get reasonably strong parts"}, {"start": 287.68, "end": 294.48, "text": "which eventually though can also break. So I searched for suitable models on printables"}, {"start": 295.04, "end": 302.48, "text": "and eventually found this 6 inch one whose design I really liked. I asked his creator whether I can"}, {"start": 302.48, "end": 309.52, "text": "showcase it in the video and he agreed and even helped me a lot during the build so big thanks to him."}, {"start": 310.56, "end": 314.24, "text": "And with the model selected I started 3D printing all parts"}, {"start": 314.24, "end": 321.68, "text": "and while that was going on I was looking for motors on Amazon which the model trader actually advised me"}, {"start": 321.68, "end": 328.96000000000004, "text": "not to use. The reason is that they often come with low quality bearings so he instead recommended this"}, {"start": 328.96000000000004, "end": 337.12, "text": "motor in combination with a 4S battery. With the given kV rating using a 4S battery should give me an"}, {"start": 337.12, "end": 347.44, "text": "average RPM of 37,814 which is above the RPM thrust graph I created in a previous video and thus it should"}, {"start": 347.44, "end": 355.04, "text": "easily lift 500g meaning 4 of them should be able to do 2kg which I thought was more than enough."}, {"start": 356.08, "end": 362.4, "text": "And by the way I would highly recommend checking out the video I just mentioned because it shows you"}, {"start": 362.4, "end": 368.23999999999995, "text": "very well how battery, ESC, motor and propeller interplay with one another."}, {"start": 369.2, "end": 376.71999999999997, "text": "But anyway the datasheet of the motor also stated that even with only 50% thrust it is capable of"}, {"start": 376.71999999999997, "end": 386.79999999999995, "text": "lifting 563g so I was pretty sure that those should work. Next for the propellers I was advised to get 6 inch"}, {"start": 386.8, "end": 396.48, "text": "ones but once I saw how close they get to the drone maybe turning it into drone goulash I instead went with generic 5 inch ones."}, {"start": 397.44, "end": 406.32, "text": "For the battery like I said before I went with a 4S one with a capacity of 2.2Ah and most importantly a"}, {"start": 406.32, "end": 414.0, "text": "high C rating which basically says that it can output a high current and thus a high power which is more than"}, {"start": 414.0, "end": 421.6, "text": "enough to enjoy the maximum power of all 4 motors. Moving on, next was the receiver and remote part"}, {"start": 422.16, "end": 429.04, "text": "and for that I wanted to reuse the remote from my beginners drone kit. Luckily it apparently comes"}, {"start": 429.04, "end": 437.52, "text": "with the ELRS communication protocol that can be used for modern drones. As a comparison back in the old"}, {"start": 437.52, "end": 444.88, "text": "days all your drone remote inputs would alter one data channel at the receiver which is basically a standard"}, {"start": 444.88, "end": 452.4, "text": "servo signal. But since dealing with so many data channels is just confusing, modern remotes and"}, {"start": 452.4, "end": 458.79999999999995, "text": "receivers just talk to the flight controller through a receive and transmit line and thus we reduced for"}, {"start": 458.79999999999995, "end": 466.32, "text": "example 9 data wires to just 2. The bad news is though that there are a ton of different protocols from different"}, {"start": 466.32, "end": 475.59999999999997, "text": "manufacturers but like I said ELRS is apparently not only supported by my remote but also new and great"}, {"start": 475.59999999999997, "end": 481.76, "text": "and I could easily get a fitting 2.4GHz ELSR receiver for pretty cheap from the internet."}, {"start": 482.8, "end": 490.4, "text": "So next I also wanted to reuse my old goggles which was also not a problem because all 5.8GHz"}, {"start": 490.4, "end": 496.4, "text": "transmitter systems should work with them so I simply got one that was currently available."}, {"start": 497.44, "end": 502.64, "text": "And the camera was also a suggestion from the model trader which I didn't regret."}, {"start": 503.67999999999995, "end": 511.67999999999995, "text": "Ok last but not least a flight controller and ESC and here I was told that pretty much anything would work"}, {"start": 511.67999999999995, "end": 517.68, "text": "as long as the ESC could handle the motor current, the flight controller comes with a standard size"}, {"start": 517.68, "end": 524.7199999999999, "text": "device and it uses Betaflight which is the software on the flight controller that basically handles everything"}, {"start": 525.1999999999999, "end": 533.76, "text": "and that probably most drone owners use. So I decided on this Zeus 60A one because it looked well made"}, {"start": 533.76, "end": 540.88, "text": "and came with a decent manual. And thus I finally got all the parts for the drone and if you want to"}, {"start": 540.88, "end": 546.16, "text": "build something similar you can of course find a complete parts list with example seller in the"}, {"start": 546.16, "end": 553.04, "text": "video description. There you can of course also find the additional parts like screws, standoffs,"}, {"start": 553.04, "end": 560.56, "text": "zip ties and everything else. And with that being said I started the actual drone build by firstly securing"}, {"start": 560.56, "end": 566.8, "text": "all the motors to the motor arms and then attaching those to the bottom piece of the frame with more screws."}, {"start": 566.8, "end": 573.28, "text": "At this point I was happy to find out that the motor wires were long enough to reach the ESC."}, {"start": 574.0799999999999, "end": 581.5999999999999, "text": "So I tied them to the arms with the help of zip ties before soldering the XT60 battery connector to the ESC"}, {"start": 582.16, "end": 590.7199999999999, "text": "along with all the motor wires. Next I soldered the camera wires, receiver wires and VTX wires to the solder pads"}, {"start": 590.72, "end": 598.4, "text": "of the flight controller like its manual told me to do so. And after connecting the ESC and FC with the"}, {"start": 598.4, "end": 604.0, "text": "help of the given wire it was already time for the first power test with my lab bench power supply"}, {"start": 604.5600000000001, "end": 610.1600000000001, "text": "which as you can hear and also see was a big success for me since nothing blew up."}, {"start": 611.12, "end": 617.76, "text": "And best of all the camera system already worked without configuring anything which was pretty neat."}, {"start": 617.76, "end": 624.8, "text": "What I still had to do though was binding the receiver with my controller and that was more or less a"}, {"start": 624.8, "end": 629.92, "text": "nightmare because no matter what I tried my remote didn't want it to do that."}, {"start": 630.88, "end": 639.36, "text": "Eventually I found out that my remote is the FR Sky version which does not support ELRS and thus I had to"}, {"start": 639.36, "end": 647.2, "text": "get a new one which does support that but it was certainly not new. The story continues though because"}, {"start": 647.2, "end": 653.2, "text": "the binding with the bind button still didn't function. I actually had to not only flash a"}, {"start": 653.2, "end": 660.88, "text": "new firmware onto the remote but also a new firmware onto the receiver which was not hard to do but finding"}, {"start": 660.88, "end": 668.1600000000001, "text": "that out just took me way too long. And thus the remote and receiver finally bound correctly and it was"}, {"start": 668.1600000000001, "end": 674.5600000000001, "text": "time for me to assemble the rest of the frame to find out how I had to modify it so that it can hold my"}, {"start": 674.56, "end": 683.1199999999999, "text": "camera, GoPro mount and VTX antenna. The model creator also helped me a bit with that and since he uploaded"}, {"start": 683.1199999999999, "end": 689.1999999999999, "text": "the step files of his model I had no problem adjusting a couple of holes and cutouts as well"}, {"start": 689.1999999999999, "end": 695.76, "text": "and printing some parts again. And that means it was finally time to permanently mount the FC"}, {"start": 695.76, "end": 702.72, "text": "and ESC to the frame, secure the camera with small screws on the front as well as the antenna mount in"}, {"start": 702.72, "end": 709.12, "text": "the back, add standoffs all around the frame, use zip ties to keep all the wiring under control,"}, {"start": 709.76, "end": 715.92, "text": "attach the GoPro mount to the upper frame and finally attach that to the rest with the help of more screws."}, {"start": 716.88, "end": 719.6, "text": "And just like that the drone was mostly done."}, {"start": 719.6, "end": 726.64, "text": "And next I had to connect it to a computer and use the Betaflight configurator software to get all the"}, {"start": 726.64, "end": 733.6800000000001, "text": "settings right. To do that I first delayed the quads onto a flat surface to calibrate the accelerometer"}, {"start": 734.32, "end": 741.52, "text": "and afterwards I configured the receiver system, made sure that the board alignment was correct so that"}, {"start": 741.52, "end": 748.8000000000001, "text": "in this software the drone moves exactly like it does in real life. I had to alter two controller channels"}, {"start": 748.8, "end": 755.28, "text": "so that the quad moves with the controller inputs like you would expect it. I had to add modes to"}, {"start": 755.28, "end": 762.9599999999999, "text": "for example arm the quad and enter angle modes which is easier to fly and ultimately I checked the motor"}, {"start": 762.9599999999999, "end": 768.8, "text": "settings and spun up the motors to find out that they in fact all spun in the correct direction."}, {"start": 769.76, "end": 775.68, "text": "And if you want more information about all of the Betaflight settings then I would highly recommend"}, {"start": 775.68, "end": 780.64, "text": "checking out the Joshua Boutwell channel who made a video series about this."}, {"start": 781.52, "end": 788.4, "text": "But anyway with the configuration complete I added the propellers to the motors while making sure which"}, {"start": 788.4, "end": 795.3599999999999, "text": "ones are the clockwise and counter clockwise ones. And after then charging up the battery and securing it"}, {"start": 795.3599999999999, "end": 802.3199999999999, "text": "to the frame with velcro strips it was finally time for the first proper test in my hands to see whether"}, {"start": 802.32, "end": 808.5600000000001, "text": "the drone would follow the directions I pointed to with the controller which it did just fine."}, {"start": 809.5200000000001, "end": 816.88, "text": "So I did a proper flying test next which wasn't as bad as I thought it would be but I should get used"}, {"start": 816.88, "end": 824.08, "text": "to disarm the drone to get it to land. And the last test I then did in the garden was with the GoPro on top"}, {"start": 824.08, "end": 836.5600000000001, "text": "which during the first run worked surprisingly well but during the second attempt the system oscillated"}, {"start": 836.5600000000001, "end": 843.5200000000001, "text": "a bit and got out of control. I think this is a good time to mention that I am using the standard PID"}, {"start": 843.5200000000001, "end": 851.6, "text": "values for my drone here which do work but are not perfect. So next I wanted to do a bigger test on"}, {"start": 851.6, "end": 857.9200000000001, "text": "an empty field which clearly showed me that I will have to practice quite a lot to get any decent"}, {"start": 857.9200000000001, "end": 864.64, "text": "results with my drone and worst of all as I was getting more comfortable with it it just stopped"}, {"start": 864.64, "end": 873.84, "text": "its motors at the highest point yet and crashed to the ground. Needless to say I had to replace a couple"}, {"start": 873.84, "end": 882.0, "text": "of 3D printed parts and I am not sure why the system abruptly stopped working. Maybe because I was only"}, {"start": 882.0, "end": 890.1600000000001, "text": "using half of the original copper wire or maybe because I forgot adding the ESC capacitor. Whatever"}, {"start": 890.1600000000001, "end": 897.12, "text": "it was this problem did not occur again after fixing those things and I was actually getting a bit more"}, {"start": 897.12, "end": 906.0, "text": "comfortable the second time on the fields. I got so confident that I finally tried out flying with"}, {"start": 906.0, "end": 914.64, "text": "the goggles on which made things easier and on top was an incredible experience. And with that being said"}, {"start": 914.64, "end": 920.8, "text": "you should now have a basic idea of how to make your own drone and always keep in mind that you can"}, {"start": 920.8, "end": 927.04, "text": "easily downgrade component parameters to not only save money but also make your drone lighter and"}, {"start": 927.04, "end": 934.16, "text": "less powerful because truth be told my one is a bit too big and powerful for my taste."}, {"start": 935.04, "end": 941.8399999999999, "text": "But anyway if you enjoyed this video and maybe my other ones then consider supporting me through Patreon."}, {"start": 942.7199999999999, "end": 953.8399999999999, "text": "As always don't forget to like, share, subscribe and hit the notification bell. Stay creative and I will see you next time!"}]}