{"video_id": "DkbfBIMSdgo", "url": "https://www.youtube.com/watch?v=DkbfBIMSdgo", "title": "DkbfBIMSdgo", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.24, "end": 2.7600000000000002, "text": "Hi, welcome to Elonix."}, {"start": 2.7600000000000002, "end": 8.24, "text": "In this episode, we'll see how to make a clap switch or sound triggered LED while simultaneously"}, {"start": 8.24, "end": 16.76, "text": "learning how it works."}, {"start": 16.76, "end": 30.6, "text": "This circuit detected claps upto a distance of about 15 feet."}, {"start": 30.6, "end": 37.56, "text": "And if you are near, the LED turns on even with finger snaps."}, {"start": 37.56, "end": 41.96, "text": "You can also change the sensitivity so that it turns on the LED only when you clap near"}, {"start": 41.96, "end": 49.08, "text": "the circuit."}, {"start": 49.08, "end": 55.24, "text": "We'll be using a condenser or elaterate microphone as the sensing element and its capacitance"}, {"start": 55.24, "end": 58.519999999999996, "text": "changes in response to ambient sound."}, {"start": 58.519999999999996, "end": 63.68, "text": "So we'll start with the condenser microphone and a resistor in series so that the change"}, {"start": 63.68, "end": 69.84, "text": "in capacitance of the microphone is translated to change in voltage at this point."}, {"start": 69.84, "end": 75.78, "text": "One terminal of the 3.3kohm resistor is connected to negative rail and the other terminal is"}, {"start": 75.78, "end": 81.36, "text": "connected to negative of condenser microphone which is the pin connected to outer casing."}, {"start": 81.36, "end": 85.72, "text": "And the positive terminal of the microphone is connected to the positive rail."}, {"start": 85.72, "end": 90.72, "text": "The voltage at this point is normally near positive voltage but it drops whenever there"}, {"start": 90.72, "end": 92.96000000000001, "text": "is a sudden loud sound around the microphone."}, {"start": 92.96, "end": 99.52, "text": "We'll try to amplify this response by using BC547 and NPN transistor."}, {"start": 99.52, "end": 105.36, "text": "So connect this point to the base of BC547 which is at pin 2 and the emitter which is at pin"}, {"start": 105.36, "end": 109.11999999999999, "text": "3 should be connected to negative rail."}, {"start": 109.11999999999999, "end": 113.25999999999999, "text": "Connect a resistor between positive rail and the collector of transistor."}, {"start": 113.25999999999999, "end": 117.38, "text": "This resistor acts as a dummy load which keeps the collector base junction in reverse"}, {"start": 117.38, "end": 122.74, "text": "bias and that's required for making the transistor amplify the input signal."}, {"start": 122.74, "end": 128.42, "text": "And because this resistance determines the voltage at the output, its value determines the sensitivity"}, {"start": 128.42, "end": 130.82, "text": "and is dependent on the supply voltage."}, {"start": 130.82, "end": 135.74, "text": "So if you are using a 5 or 6 volts of power supply, use a 270 ohm resistor."}, {"start": 135.74, "end": 141.54, "text": "470 ohm for 9 volts and 1 kilo ohm for 12 volts of power supply."}, {"start": 141.54, "end": 145.29999999999998, "text": "Increasing this resistance value reduces the sensitivity."}, {"start": 145.3, "end": 150.46, "text": "Now this is not required but if you place an LED between the output and negative rail, the"}, {"start": 150.46, "end": 154.86, "text": "LED glows when you tap or blow air on the microphone."}, {"start": 154.86, "end": 158.3, "text": "But the output is not high enough to detect claps."}, {"start": 158.3, "end": 163.72000000000003, "text": "So we will use another NPN transistor and connect the output of the first transistor to the base"}, {"start": 163.72, "end": 166.72, "text": "of the second transistor BC547."}, {"start": 166.72, "end": 170.8, "text": "Like you did for the first transistor, connect the emitter of the second transistor to negative"}, {"start": 170.8, "end": 175.28, "text": "rail and the collector to load."}, {"start": 175.28, "end": 179.22, "text": "At this moment we will be using an LED as a load to test the circuit."}, {"start": 179.22, "end": 183.72, "text": "So I have connected the collector of second transistor to negative terminal of the LED and"}, {"start": 183.72, "end": 188.48, "text": "the positive of LED connects to positive rail via a 270 ohm resistor."}, {"start": 188.48, "end": 193.44, "text": "This resistor should be 470 ohms for 9 or 12 volts of power supply."}, {"start": 193.44, "end": 194.76, "text": "Now turn on the power supply."}, {"start": 194.76, "end": 199.78, "text": "Normally the LED should stay off and it should turn on when you clap or do finger snaps near"}, {"start": 199.78, "end": 202.23999999999998, "text": "the condenser microphone."}, {"start": 202.23999999999998, "end": 205.42, "text": "Or even if you tap or blow air on it."}, {"start": 205.42, "end": 208.16, "text": "Don't panic if the LED always stays on."}, {"start": 208.16, "end": 213.28, "text": "All you need to do is increase the load resistance of the first transistor."}, {"start": 213.28, "end": 218.39999999999998, "text": "For example if you are using a 270 ohm resistor, replace it with a higher one, say 330 ohm resistor"}, {"start": 218.4, "end": 222.96, "text": "and keep increasing until the LED just turns off."}, {"start": 222.96, "end": 227.22, "text": "I advise you to purchase at least 3 resistors and start from the minimum."}, {"start": 227.22, "end": 232.6, "text": "If the LED stays on, you will use the next resistor and so on."}, {"start": 232.6, "end": 237.9, "text": "Coming back to the main circuit, even though it turns on LED with a clap, it stays on only"}, {"start": 237.9, "end": 242.72, "text": "for a moment and normally we would want to increase that duration."}, {"start": 242.72, "end": 247.88, "text": "And obviously a 555 timer in mono stable mode is the best candidate for doing that."}, {"start": 247.88, "end": 253.82, "text": "What this arrangement does is, whenever the trigger pin detects a drop in voltage, the"}, {"start": 253.82, "end": 259.34, "text": "555 timer turns on the output for a duration determined by the value of capacitor and resistor."}, {"start": 259.34, "end": 264.54, "text": "We will first build this mono stable circuit and then couple the trigger pin with the output"}, {"start": 264.54, "end": 267.24, "text": "of a primary circuit."}, {"start": 267.24, "end": 270.58, "text": "So let's place the 555 timer IC on the breadboard."}, {"start": 270.58, "end": 274.88, "text": "Connect the pins 6 and 7 and pins 4 and 8."}, {"start": 274.88, "end": 279.82, "text": "Now connect a 100k ohm resistor between the pins 7 and 8."}, {"start": 279.82, "end": 284.98, "text": "Next goes the capacitor with its positive terminal connected to pin 6 and its negative terminal"}, {"start": 284.98, "end": 287.6, "text": "connected to negative rail."}, {"start": 287.6, "end": 291.6, "text": "You can choose the capacitor's value depending on the amount of time you require the LED to"}, {"start": 291.6, "end": 293.38, "text": "stay on."}, {"start": 293.38, "end": 299.32, "text": "Now connect the output of 555 timer which is at pin 3 to the positive of the LED and the"}, {"start": 299.32, "end": 303.84, "text": "negative of the LED to negative rail via a 270 ohm resistor."}, {"start": 303.84, "end": 307.38, "text": "Connect pin 1 to negative rail and pin 4 to positive rail."}, {"start": 307.38, "end": 312.38, "text": "You can now test this mono stable circuit by applying 0V at the trigger pin."}, {"start": 312.38, "end": 322.32, "text": "Now it's time to couple output of a primary circuit with the trigger pin of this mono stable circuit."}, {"start": 322.32, "end": 327.24, "text": "As we don't require LED at the output of a primary circuit, I am removing it along with"}, {"start": 327.24, "end": 331.92, "text": "its series resistor."}, {"start": 331.92, "end": 337.04, "text": "Place a 1k ohm resistor between the collector of second transistor and positive rail."}, {"start": 337.04, "end": 342.6, "text": "This resistor acts as a load for the second transistor as well as keeps the output high when the"}, {"start": 342.6, "end": 344.70000000000005, "text": "transistor is not turned on."}, {"start": 344.70000000000005, "end": 350.6, "text": "After this, use a 100nF capacitor to couple the output of the second transistor to the trigger"}, {"start": 350.6, "end": 353.12, "text": "pin of 555 timer ILC."}, {"start": 353.12, "end": 358.16, "text": "The capacitor acts as a filter and prevents continuous loud sounds from triggering the monostable"}, {"start": 358.16, "end": 359.20000000000005, "text": "circuit."}, {"start": 359.20000000000005, "end": 364.20000000000005, "text": "So normally the voltage at the trigger pin will be near to positive voltage and it drops whenever"}, {"start": 364.2, "end": 369.5, "text": "you clap which triggers the monostable circuit and so the LED should glow."}, {"start": 369.5, "end": 378.82, "text": "Finally connect the power supply and here you go, the clap switch or sound triggered LED."}, {"start": 378.82, "end": 381.52, "text": "Thanks for your time, do subscribe and have fun."}]}