{"video_id": "Gpm-TI21x9s", "url": "https://www.youtube.com/watch?v=Gpm-TI21x9s", "title": "Gpm-TI21x9s", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.24, "end": 6.24, "text": "Hey guys, so this is a balancing robot. And yes, yes, I know there are already a lot of balancing"}, {"start": 6.24, "end": 11.92, "text": "robots projects on the internet, but I wanted to make one for myself for a long time. And actually"}, {"start": 11.92, "end": 17.52, "text": "I wanted to make something special and make a mini balancing robot using this tiny PCB here."}, {"start": 17.52, "end": 21.52, "text": "But I kind of failed with the stepper motors and I will explain that problem in the video,"}, {"start": 21.52, "end": 26.48, "text": "so stay tuned for that. So what I've done in the end is to use the same PCB that I've prepared for"}, {"start": 26.48, "end": 32.24, "text": "the mini balancing robot, design a small 3D printed body and use bigger stepper motors and like that"}, {"start": 32.24, "end": 37.44, "text": "be able to finish my idea. For now, this robot is pretty much stable even if you push it around."}, {"start": 38.0, "end": 42.72, "text": "And I had a very hard time getting the good PID values so it would be more and more stable,"}, {"start": 42.72, "end": 48.400000000000006, "text": "but I'm not yet 100% happy with these results. Anyway, the robot should also get information"}, {"start": 48.400000000000006, "end": 53.44, "text": "from a homemade remote with a Bluetooth connection and like that we could move around. But internally,"}, {"start": 53.44, "end": 59.12, "text": "it should also get information from this IMU module here and calculate a PID value for the angle so it"}, {"start": 59.12, "end": 63.92, "text": "will never fall and always try to stay horizontal. That's pretty interesting and I think you will"}, {"start": 63.92, "end": 69.03999999999999, "text": "learn a lot with this video because I will explain step by step the circuit and also the code. So what"}, {"start": 69.03999999999999, "end": 83.28, "text": "do you think? Will this work? Stay tuned to find out. So guys, let's get started."}, {"start": 83.44, "end": 94.32, "text": "These PCBs were manufactured by PCBWay and the finish quality is very good, especially with these gold"}, {"start": 94.32, "end": 101.2, "text": "plated pads. If you want to finish your product faster, you could also ask PCBWay to make a panelized"}, {"start": 101.2, "end": 107.75999999999999, "text": "order where you receive multiple PCBs on a single panel. Together with this, you can also order the"}, {"start": 107.76, "end": 114.32000000000001, "text": "SMD stencil from PCBWay and use it to add solder paste and solder all the components at once and by"}, {"start": 114.32000000000001, "end": 120.32000000000001, "text": "that you save time and effort. All the orders are high quality and you could select a lot of settings,"}, {"start": 120.32000000000001, "end": 127.84, "text": "such as the thickness, flexible PCBs, the color of the solder mask, the amount of layers, the material,"}, {"start": 127.84, "end": 135.04000000000002, "text": "the surface finish and more. So upload the Gerber files directly on PCBWay.com and make the order in just a couple of minutes."}, {"start": 135.04, "end": 142.72, "text": "What's up my friends, welcome back. This here is the PCB that I've made for this project."}, {"start": 143.84, "end": 150.79999999999998, "text": "And my plan was to use this PCB with this kind of stepper motors. I have this from some old DVD"}, {"start": 150.79999999999998, "end": 157.51999999999998, "text": "writers and I thought it would work great connected to this PCB. It's very easy to control them with some"}, {"start": 157.52, "end": 164.8, "text": "stepper drivers so that's not the problem. The problem was mechanical. You see these motors have"}, {"start": 164.8, "end": 171.60000000000002, "text": "the shaft connected to the magnets inside. This shaft is supported on both sides, here and here."}, {"start": 173.76000000000002, "end": 179.68, "text": "So if I want to add a wheel to this shaft, I had to cut it smaller and in that way we have support only"}, {"start": 179.68, "end": 186.48000000000002, "text": "on one side. That's the problem. Without support on both sides, this shaft will move around and"}, {"start": 186.48000000000002, "end": 192.8, "text": "automatically break all the small coils and magnets inside. I've also tried gluing a bearing at the"}, {"start": 192.8, "end": 200.48000000000002, "text": "output but without success. Inside the shaft is kept in the center by a metal ball and once you move"}, {"start": 200.48000000000002, "end": 207.04000000000002, "text": "that, you can say goodbye to the whole motor. I've ordered these motors here which are smaller,"}, {"start": 207.04, "end": 213.44, "text": "but this time they are too small. They don't have enough torque and guess what? Their shaft is also"}, {"start": 213.44, "end": 219.84, "text": "weak and it will break very easy just as the other ones. So I had no other option but to use the NEMA 17"}, {"start": 219.84, "end": 229.28, "text": "motors. These are one of the smaller NEMA 17 steppers. On the side of that PCB I've also designed this support."}, {"start": 230.79999999999998, "end": 235.92, "text": "And like this we can attach the motors below. The battery in the middle and the PCB will be kept"}, {"start": 235.92, "end": 243.04, "text": "in place with some plastic supports. So this is not a mini robot anymore but anyway, let's make this"}, {"start": 243.04, "end": 248.0, "text": "robot and you will definitely learn something new. So let's see what we have on the PCB."}, {"start": 249.27999999999997, "end": 255.76, "text": "If you want the same PCB, you can get the Gerber files from below and go to PCBway.com. You click the"}, {"start": 255.76, "end": 261.84, "text": "Code Now button and select your settings such as the thickness, the amount of PCBs, the materials and the"}, {"start": 261.84, "end": 268.47999999999996, "text": "solar mask color. In my case I've selected the black one but you can select any other one as for example"}, {"start": 268.47999999999996, "end": 275.03999999999996, "text": "purple or the matte black which look amazing. On the next page you can upload the Gerber files"}, {"start": 275.03999999999996, "end": 282.23999999999995, "text": "and order the PCBs. I've received my ports to Spain in around 8 days so let's check them out."}, {"start": 284.15999999999997, "end": 287.52, "text": "On the front part we have some spaces for two stepper motor drivers."}, {"start": 287.52, "end": 296.64, "text": "On the front part you can use the basic A4988 drivers or even better you can use the TMC2225 drivers"}, {"start": 296.64, "end": 303.68, "text": "for better and silent movement. Below that we have these 4 pins which are used to connect a"}, {"start": 303.68, "end": 310.24, "text": "buck converter for 5V. Because I want to use a 2S or maybe a 3S battery and because the digital"}, {"start": 310.24, "end": 315.68, "text": "part will work at 5V, I will connect a buck converter here to these pins and have that voltage."}, {"start": 318.08, "end": 323.2, "text": "On the bottom side we have the output for the 2 stepper motors. This is the place where I wanted"}, {"start": 323.2, "end": 329.12, "text": "to solder those tiny motors but unfortunately they break too easy. If you manage to use them,"}, {"start": 329.12, "end": 335.28, "text": "just solder the motor and use a zip tie like this one and keep them in place. It would be a lot cooler"}, {"start": 335.28, "end": 343.59999999999997, "text": "to have a mini robot but anyway. What more do we have on the PCB? These 4 pins here are for the IMU module"}, {"start": 343.6, "end": 352.08000000000004, "text": "and I will use the MPU 6050 as always. We use this module to measure the angle. On the top part we"}, {"start": 352.08000000000004, "end": 359.6, "text": "have 4 more pins for the Bluetooth module and I will use the HC05. On side of that we have these 4 more"}, {"start": 359.6, "end": 366.88, "text": "pins for the I2C for an OLED display. I might add this as well so we can draw faces for the robot and give it"}, {"start": 366.88, "end": 374.8, "text": "more personality. I've also placed an SMD buzzer here for some notifications. On the bottom of the"}, {"start": 374.8, "end": 380.15999999999997, "text": "PCB we have some LEDs to make the robot look cooler and also the input from the battery."}, {"start": 381.92, "end": 387.44, "text": "So now let's take a look on the back of the PCB. Actually the Bluetooth module will go here"}, {"start": 387.44, "end": 395.12, "text": "because the other side will be full of components. Below here we have the Atmega 328 microcontroller"}, {"start": 395.12, "end": 401.76, "text": "and the needed components in order to work. It's very difficult to see but we have 3 pairs of pads"}, {"start": 401.76, "end": 406.4, "text": "for each stepper driver and by soldering this here we can select the microstepping amount."}, {"start": 407.36, "end": 415.44, "text": "That's it for the PCB, that's all we need. The PCB, the stepper drivers as well, the back converter module"}, {"start": 415.44, "end": 423.36, "text": "for 5V, the HC05 Bluetooth module, the NPU6050 sensor and two NEMA17 stepper motors."}, {"start": 425.04, "end": 431.04, "text": "If you want you can also add an OLED screen like this one. As for the tiny components we need the"}, {"start": 431.04, "end": 438.48, "text": "buzzer, also some SMD capacitors, some LEDs and resistors and yet mega cheap together with the 60MHz"}, {"start": 438.48, "end": 445.36, "text": "resonator. As for the battery, you can use a 3S LiPo battery like this one. But in my case,"}, {"start": 445.36, "end": 450.16, "text": "because I have a lot of batteries from cell phones, I want to connect 2 of these iPhone batteries in"}, {"start": 450.16, "end": 459.04, "text": "series and get 12V. These are very flat and will occupy less space. As for the body, just download"}, {"start": 459.04, "end": 466.96000000000004, "text": "the STL files from below and print them using PLA material. I've used a 0.2 mm layer height and a 0.4 mm"}, {"start": 466.96, "end": 474.96, "text": "nozzle with 3 perimeters and 20% infill. As for the wheels, the inner part is made out of PLA but the"}, {"start": 474.96, "end": 480.71999999999997, "text": "exterior is made out of flexible material and this must be printed at very low speeds. Like that we"}, {"start": 480.72, "end": 487.36, "text": "can have more grip. The wheels have this hole so we can pass a screwdriver and tie the screw here."}, {"start": 488.48, "end": 493.52000000000004, "text": "So we have to add a screw nut inside and then insert the shaft on the motor and tie the screw."}, {"start": 494.32000000000005, "end": 500.64000000000004, "text": "And like that it will stay in place. Once we tie the screw, we can add this rubber part on top."}, {"start": 502.24, "end": 506.88000000000005, "text": "So these are all the parts that we need for this robot, more or less. You have the full part"}, {"start": 506.88, "end": 512.96, "text": "list below on electronoops.com. So let's assemble it. It should end up something like this, like this"}, {"start": 512.96, "end": 520.64, "text": "3D design example. So I get the main 3D printed part and add the stepper motors. You just have to"}, {"start": 520.64, "end": 527.84, "text": "apply a little bit of force and it will snap into place. Then we add some screws and washers and tie the"}, {"start": 527.84, "end": 536.48, "text": "motor. Also make sure that the motor connector is on the back side of the robot. Now get the plastic"}, {"start": 536.48, "end": 544.88, "text": "wheels and add a small nut inside of this hole. We also add a screw. Now we can add a wheel to each"}, {"start": 544.88, "end": 553.6, "text": "motor. We tie that screw so it will stay tight on the motor shaft. Now this part was printed in flexible"}, {"start": 553.6, "end": 561.04, "text": "filament. So we can now add this part on top of the wheels. First I wanted the battery to go here above"}, {"start": 561.04, "end": 567.5999999999999, "text": "the motors but you will see later that I will change the position. Now let's assemble the PCB so download"}, {"start": 567.5999999999999, "end": 574.0799999999999, "text": "this schematic from below and have it in front of you. I first solder these SMD capacitors."}, {"start": 576.16, "end": 580.3199999999999, "text": "And then we add some female pins for the drivers so we can remove it when we want."}, {"start": 582.0799999999999, "end": 586.48, "text": "Now I get one of these small buck converters and solder the 5V connection on the back."}, {"start": 586.48, "end": 594.96, "text": "I also connect it to 12V and test if the output is around 5V. Now we can solder this on the PCB but"}, {"start": 594.96, "end": 601.76, "text": "we will do that later. Now solder that buzzer here on top and the LEDs on the bottom of the PCB."}, {"start": 603.6, "end": 608.16, "text": "On the other side we can solder the Atmega microcontroller, the crystal resonator and the"}, {"start": 608.16, "end": 615.04, "text": "small resistors and capacitors. Now at this point I connect my FTDI programmer and test the connection to"}, {"start": 615.04, "end": 625.04, "text": "make sure it works. If the chip works, on the front side I solder the MPU6050. On the back I also add"}, {"start": 625.04, "end": 632.16, "text": "some female pins for the Bluetooth module. Now that the Atmega chip is in place and it works, I can now"}, {"start": 632.16, "end": 639.28, "text": "solder the buck converter on top so we can supply the PCB with the battery. I might also add the OLED screen"}, {"start": 639.28, "end": 645.36, "text": "later when everything works. So please check this full schematic below for all the connection if you"}, {"start": 645.36, "end": 651.8399999999999, "text": "are trying to make the same project. Also remember to solder together the pads for the MS2 on the back"}, {"start": 651.8399999999999, "end": 657.76, "text": "in order to enable the quarter micro stepping. At this point you can download the code from below"}, {"start": 657.76, "end": 664.16, "text": "and upload it to the PCB using the FTDI programmer connected to the wired port. Now we have to connect"}, {"start": 664.16, "end": 670.64, "text": "the PCB to the motors and the battery. For the battery I've soldered together in series three of these"}, {"start": 670.64, "end": 676.8, "text": "iPhone batteries. Like that I will have around 12V and I can also have a very thin battery."}, {"start": 678.64, "end": 684.7199999999999, "text": "Now get this plastic printed leg and screw it on one arm of the PCB. Do the same with the other side"}, {"start": 684.7199999999999, "end": 691.52, "text": "but don't tie the screws yet. Now place the PCB over the main body and we glue in place these small"}, {"start": 691.52, "end": 699.36, "text": "plastic arms. Now we can tie the screws and the PCB will be fixed in place. So solder the wires from"}, {"start": 699.36, "end": 706.64, "text": "the stepper motors to the PCB on these pins here. Between the battery and the PCB I add a switch so"}, {"start": 706.64, "end": 712.8, "text": "we can turn the robot on and off. But guys, before we go over the code, I have to say that with this"}, {"start": 712.8, "end": 719.6, "text": "shape, this robot won't be stable. Why is that? Well, because this type of balancing robot will need some"}, {"start": 719.6, "end": 724.96, "text": "weight on the upper part in order to have some inertia. But at this moment all the weight is on"}, {"start": 724.96, "end": 728.72, "text": "the bottom side of the robot as you can see and is very difficult to balance."}, {"start": 732.48, "end": 736.4, "text": "This robot will work exactly the same as trying to balance a stick in your hand."}, {"start": 737.6800000000001, "end": 740.24, "text": "If the stick is too short, it will be impossible."}, {"start": 740.24, "end": 747.6, "text": "When the stick is large enough, you can move your hand in the same direction as the tilt and you can"}, {"start": 747.6, "end": 755.12, "text": "stabilize it. That's why I've placed some threaded rods on top of the robot. On top I have a plywood"}, {"start": 755.12, "end": 762.4, "text": "part and here I can place the battery. Like this we can have more inertia when moving. This is a crucial"}, {"start": 762.4, "end": 769.36, "text": "part for this project. With the same code before, I now got better results but as you can see the robot is"}, {"start": 769.36, "end": 774.64, "text": "still wobbling around. That's because we can still have to adjust the PID values in the code."}, {"start": 775.6800000000001, "end": 781.12, "text": "And this was the longest part of this project. I had to manually go and change the PID values"}, {"start": 781.12, "end": 785.6800000000001, "text": "till I got better and better but even so I am not quite happy with the final results."}, {"start": 786.88, "end": 792.0, "text": "So for example, if you start only with the P values and the I and the D are zero, you get this kind of"}, {"start": 792.0, "end": 797.44, "text": "oscillations where the wheels are rotating in the same direction as the tilt of the robot according to the"}, {"start": 797.44, "end": 806.96, "text": "angle. But then we add some D values and this will react to the speed of changing of the angle and it"}, {"start": 806.96, "end": 812.32, "text": "will try to stop the oscillations. But that's not enough, especially when the error is very small."}, {"start": 813.6, "end": 819.0400000000001, "text": "So finally, to fine adjust the position, we can add the I and that will increase and decrease slowly"}, {"start": 819.04, "end": 825.5999999999999, "text": "when the error is very small. So after more than 30 tries, I got more or less good results and the"}, {"start": 825.5999999999999, "end": 831.8399999999999, "text": "robot is quite stable but I am not entirely happy yet. So at this point I've decided to make a second"}, {"start": 831.8399999999999, "end": 837.76, "text": "part for this project where I will show you how to tune the PID values. So till then I will try to get"}, {"start": 837.76, "end": 842.9599999999999, "text": "better results and in that video I will explore the mathematics and physics behind this kind of project,"}, {"start": 842.96, "end": 850.0, "text": "including the IMU position, the center of gravity, the inertia of the robot, the motor speed and the PID algorithm."}, {"start": 854.5600000000001, "end": 859.6800000000001, "text": "Before I end this video, let's take a look at the code. These here are the variables that you could"}, {"start": 859.6800000000001, "end": 865.9200000000001, "text": "change in order to tune the PID controller. This is the same that we had for the brushless PID controller"}, {"start": 865.92, "end": 872.8, "text": "or the ping pong ball controller but this time we use stepper motors. To create the step pulses applied"}, {"start": 872.8, "end": 879.28, "text": "to the stepper drivers, we use a timer, timer 2 in this case. So by setting these registers, we can"}, {"start": 879.28, "end": 886.16, "text": "make that timer to click every 20 microseconds. Next, with these lines here in the code, we read the raw data"}, {"start": 886.16, "end": 893.5999999999999, "text": "from the gyro and the accelerometer. To overcome the gyro offset, we make around 500 reads from the IMU module"}, {"start": 893.6, "end": 899.36, "text": "and we save this data as an offset and subtract that later in the main loop. Then we calculate the"}, {"start": 899.36, "end": 905.6800000000001, "text": "angle each loop, which is said to be around 4000 microseconds. Using this gyro angle variable,"}, {"start": 905.6800000000001, "end": 911.6, "text": "we can calculate the PID values. As always, we first find the PID error which is the difference between"}, {"start": 911.6, "end": 916.5600000000001, "text": "the real angle of the robot and the desired angle, which in this case should be zero so the robot will"}, {"start": 916.5600000000001, "end": 923.36, "text": "stay horizontal. Finally, inside of the timer routine, depending on the PID output, we calculate the"}, {"start": 923.36, "end": 928.88, "text": "speed of the motors by creating more or less, faster or slower pulses applied to the stepper motors."}, {"start": 930.0, "end": 935.36, "text": "And to make the code faster, instead of using a digital write function, we use register control,"}, {"start": 935.36, "end": 939.6800000000001, "text": "where this line here for example is the same as setting the digital pin D3 to high."}, {"start": 940.5600000000001, "end": 945.2, "text": "And for more about this, you can take a look at my Arduino register control video and the links are"}, {"start": 945.2, "end": 952.24, "text": "below. So using this code, the robot should be able to stay horizontal. When I lift the code,"}, {"start": 952.24, "end": 958.08, "text": "it will detect the angle and starts the PID code. When it detects a tilt on the front side,"}, {"start": 958.08, "end": 962.88, "text": "it will accelerate the wheels so it will get horizontal once again and do the same process"}, {"start": 962.88, "end": 968.5600000000001, "text": "backwards if the tilt is on the other side. If you do this fast enough with the PID control,"}, {"start": 968.5600000000001, "end": 974.88, "text": "you get a stable horizontal robot. So this is not yet perfect. I will make it better in the second"}, {"start": 974.88, "end": 981.76, "text": "part of this project. Without a remote, we can control it. I will also add that in the second part."}, {"start": 982.48, "end": 987.28, "text": "I want to use this Wii console nunchuck and get the movement from this joystick and we can send the"}, {"start": 987.28, "end": 994.0, "text": "data using a Bluetooth module. This actually has an accuracy communication so I might use that to read"}, {"start": 994.0, "end": 999.76, "text": "the values from the joystick. The schematic would be something like this with the battery and also a"}, {"start": 999.76, "end": 1006.24, "text": "switch, the Arduino, the joystick analog outputs and the Bluetooth module. Stay tuned for more."}, {"start": 1007.04, "end": 1013.04, "text": "So guys, that's how a balanced robot works and how you can make one. You have my PCB below for download,"}, {"start": 1013.04, "end": 1018.4, "text": "you also have the schematic for the robot and controller, the part list and the codes and everything"}, {"start": 1018.4, "end": 1023.1999999999999, "text": "is below in the description. If you have learned something new, consider giving me a like or comment"}, {"start": 1023.1999999999999, "end": 1029.6, "text": "below. Thanks again and see you later guys. Hey, so one more video that ends, I hope that you like it."}, {"start": 1029.6, "end": 1034.08, "text": "Okay, so listen, if you want to buy my merch, my t-shirts, you have the links below for my shop"}, {"start": 1034.08, "end": 1038.72, "text": "and I promise that I will make more designs. Also, maybe you would comment below which one you like"}, {"start": 1038.72, "end": 1042.96, "text": "more and what more designs you would like to see because in that way I could start designing them"}, {"start": 1042.96, "end": 1060.16, "text": "and post my new t-shirts. So thank you for all the support and I'll see you in the next video."}]}