{"video_id": "PWyqVEkZGWk", "url": "https://www.youtube.com/watch?v=PWyqVEkZGWk", "title": "PWyqVEkZGWk", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 5.74, "text": "Hey everybody, welcome back to RC with Adam. My name is Adam. In this video, you're going to"}, {"start": 5.74, "end": 12.4, "text": "learn about how to set up your quadcopter motors, specifically in Betaflight. And you might be"}, {"start": 12.4, "end": 16.72, "text": "wondering, set up the motors, what does that even mean? Like, why would I have to set up the motors?"}, {"start": 16.86, "end": 21.6, "text": "Well, there are a few reasons why. Because you see, the flight controller, the brain of the"}, {"start": 21.6, "end": 29.02, "text": "quadcopter, needs to know which motor to spin up at which time. And it needs to know where that"}, {"start": 29.02, "end": 35.519999999999996, "text": "motor is. Or basically, that motor has to be in the right spot. And we need to make sure that our"}, {"start": 35.519999999999996, "end": 41.64, "text": "motors are spinning in the correct direction. So those are the two main things. Now in this video,"}, {"start": 41.72, "end": 47.64, "text": "we're going to cover how to set up the ESC protocol, which is not very hard. We're going to cover motor"}, {"start": 47.64, "end": 54.0, "text": "order, or used to be called motor mapping, and motor direction. And that's going to be how it spins."}, {"start": 54.0, "end": 60.96, "text": "And then what you need to do if you want to spin props out, which is how I like to have my propellers"}, {"start": 60.96, "end": 66.12, "text": "spin. And I'm going to show you how to do all of that. The bad news is it can be kind of a complicated,"}, {"start": 66.7, "end": 71.78, "text": "or just not complicated, it can be confusing. And and maybe that's why your quadcopter isn't flying."}, {"start": 71.78, "end": 76.3, "text": "And maybe it's not working, and you're frustrated. And I totally get that. The good news is Betaflight"}, {"start": 76.3, "end": 80.4, "text": "has made it much easier. But either way, I'm going to walk you through it. And we're going to do this"}, {"start": 80.4, "end": 85.72, "text": "together. But first, I need to tell you that this video is sponsored by PCBWay. They make custom"}, {"start": 85.72, "end": 92.46000000000001, "text": "printed circuit boards. That's what PCB stands for. And if you are into that, you can send them a file"}, {"start": 92.46000000000001, "end": 98.82000000000001, "text": "of your own design of your own circuit board. And they can assemble that they have 1000s of components,"}, {"start": 98.82000000000001, "end": 104.2, "text": "and they can actually put all of them on the board so that it works and is ready to rock and roll when"}, {"start": 104.2, "end": 109.52000000000001, "text": "it comes to your door. So that's a pretty cool service. If you're not into PCBs, they also offer rapid"}, {"start": 109.52, "end": 115.82, "text": "prototyping services. So you could get something injection molded or 3d printed or sheet metal"}, {"start": 115.82, "end": 123.25999999999999, "text": "bended or even CNC'd out of various materials. So if that sounds interesting to you, check the link"}, {"start": 123.25999999999999, "end": 129.34, "text": "down in the description of this video and tell them that I sent you if you want, but it probably won't"}, {"start": 129.34, "end": 134.56, "text": "make a difference. Okay, now what we have what we're using today is this seven inch FPV drone that I"}, {"start": 134.56, "end": 139.48, "text": "bought secondhand. So it's kind of one of those things where like, you don't know exactly how it's"}, {"start": 139.48, "end": 144.35999999999999, "text": "built or what's been going on. And this could be a situation where the motors aren't working,"}, {"start": 144.35999999999999, "end": 149.83999999999997, "text": "and it really is confusing to you. All right, step one, we need to determine what we're working with."}, {"start": 149.83999999999997, "end": 157.29999999999998, "text": "So in this case, we have a four in one ESC board, and it's mounted in the center of our quadcopter."}, {"start": 157.38, "end": 163.54, "text": "That's very common, like four in one ESCs are very, very common. Now spoiler alert, this time,"}, {"start": 163.72, "end": 169.39999999999998, "text": "it's actually been flipped over, it's been it's been rotated in a roll orientation, and it's been"}, {"start": 169.4, "end": 174.66, "text": "flipped. And that is why these motors are not spinning in the correct direction. And I'll,"}, {"start": 174.78, "end": 180.38, "text": "I'll demonstrate that once we get this connected to beta flight. So we're going to connect our flight"}, {"start": 180.38, "end": 185.4, "text": "controller, and everything's like hooked up to everything else. Like the flight controller is"}, {"start": 185.4, "end": 189.78, "text": "connected to the ESC, we're going to connect our flight controller to beta flight, we're going to"}, {"start": 189.78, "end": 196.20000000000002, "text": "get into beta flight. Now, if you are setting this up from a brand new profile, it's going to ask you"}, {"start": 196.2, "end": 200.29999999999998, "text": "some other questions, like if you want to enable default settings, and you want to say yes, and then"}, {"start": 200.29999999999998, "end": 209.0, "text": "it will come up with a prompt that says, hey, your ESC protocol has not been set. And so to do that,"}, {"start": 209.0, "end": 215.57999999999998, "text": "you want to go to the motors tab on the left hand side. And then you'll see this right here where it says"}, {"start": 215.57999999999998, "end": 223.78, "text": "motor ESC features, it'll probably say disabled at first. And then you want to select the one that you"}, {"start": 223.78, "end": 229.96, "text": "want the protocol that you want. In this case, we're doing D shot 600. And I found that information"}, {"start": 229.96, "end": 237.76, "text": "by going to the T motor, the manufacturer's website for this stack. And so basically look at the manual"}, {"start": 237.76, "end": 244.72, "text": "or the manufacturer website, and that should give you that information. Once you do that, go and click"}, {"start": 244.72, "end": 251.86, "text": "save and reboot, and then come back to this page. Now, at this point, let's just kind of, you know,"}, {"start": 251.86, "end": 257.96000000000004, "text": "see what the motors are doing. And so this next step, we've already done the ESC protocol,"}, {"start": 257.96000000000004, "end": 263.84000000000003, "text": "that's been D shot, and then we're going to do the motor order before we change the direction of"}, {"start": 263.84000000000003, "end": 269.5, "text": "the motors. So let's see what we're working with here. So we want to plug in a battery, make sure"}, {"start": 269.5, "end": 276.88, "text": "your propellers are not connected to your motors, like take them off completely. Okay, because we have"}, {"start": 276.88, "end": 282.26, "text": "to spin the motors. So with the battery plugged in, and we're still connected to beta flight,"}, {"start": 282.7, "end": 288.7, "text": "what we want to do is go to this little motor testing box. And it's going to say motor test mode"}, {"start": 288.7, "end": 293.36, "text": "slash arming notice, it's saying take off your propellers, because you might chop your fingers"}, {"start": 293.36, "end": 298.7, "text": "off. And click I understand the risks. And then it's going to give us these motor sliders right here."}, {"start": 298.7, "end": 307.08, "text": "And we can slide the motors. And so we have motor 123 and four. Now, if we look at the in the little"}, {"start": 307.08, "end": 313.68, "text": "section that says mixer, we have a little diagram of the quadcopter. And we see that the motors are"}, {"start": 313.68, "end": 322.36, "text": "123 and four. So the motors are labeled. So the goal is when we spin these motors here, I'm just going to"}, {"start": 322.36, "end": 330.32, "text": "spin one, we want that motor to correspond with the motor in the diagram. So as it's as it's laid out."}, {"start": 330.54, "end": 338.48, "text": "So when I spin up motor one, we have the rear left motor is spinning. Okay, and that's not correct,"}, {"start": 338.48, "end": 346.38, "text": "because we want motor one to be on the opposite side. Motor two is going to be the front left. And"}, {"start": 346.38, "end": 351.36, "text": "that's incorrect. We want that to be on the other side. And then motor three is going to be the opposite."}, {"start": 351.36, "end": 357.76, "text": "And motor four is going to be the opposite of that it should be on the other side. And again,"}, {"start": 357.76, "end": 363.28000000000003, "text": "we don't care about the actual spinning direction right now. And again, the reason why these two are"}, {"start": 363.28000000000003, "end": 369.1, "text": "opposite is because the flight or the excuse me, the ESC board has been flipped, it's been rotated."}, {"start": 369.1, "end": 376.54, "text": "So for whatever reason, the pilot who built this decided to flip the ESC upside down. Now,"}, {"start": 376.54, "end": 383.02000000000004, "text": "the great thing is we don't have to change the wire direction or, or undo the ESC or anything like"}, {"start": 383.02000000000004, "end": 388.56, "text": "that, we can do this all through software. So what we're going to do is we're going to get out of the"}, {"start": 388.56, "end": 396.92, "text": "motor testing mode. So we're going to check that I understand the risk box again. And then we're going"}, {"start": 396.92, "end": 403.46000000000004, "text": "to go down to reorder motors, and that's going to be at the bottom right of the screen. Let's click"}, {"start": 403.46000000000004, "end": 408.86, "text": "on that. And then it's going to say, Hey, take off your propellers again. And then here's the"}, {"start": 408.86, "end": 412.96000000000004, "text": "information notice, it's going to say motors will spin up one by one, you will be able to select which"}, {"start": 412.96000000000004, "end": 416.98, "text": "motor is spinning, the battery should be plugged in correct ESC protocol should be selected, which"}, {"start": 416.98, "end": 424.68, "text": "we've already done. This utility can only rearrange currently active motors. So more complex remapping"}, {"start": 424.68, "end": 430.96, "text": "requires a CLI resource command. And that's what I've done in the past, past, that's more complicated."}, {"start": 431.28000000000003, "end": 435.92, "text": "All right, so basically, we're going to click I understand the risks. Okay, and let's click start."}, {"start": 437.64, "end": 444.28000000000003, "text": "So you see, it says click on the spinning motor, and the spinning motor is the back left motor right now."}, {"start": 444.54, "end": 449.88, "text": "So we're going to click on that. Now it's spinning the front left motor, we're going to click on that one on"}, {"start": 449.88, "end": 456.64, "text": "the diagram. And now spinning the rear right motor, we're going to click on that one. And finally, the"}, {"start": 456.64, "end": 461.24, "text": "front right motor, and we're going to click on that one. And it helps if you have your quadcopter in the"}, {"start": 461.24, "end": 468.21999999999997, "text": "same orientation as what you see on the screen, as shown with the arrow. So now it says ready, check the"}, {"start": 468.21999999999997, "end": 474.64, "text": "motor spinning order by clicking on the image. So now we can see so we click on the motor, and it's going to"}, {"start": 474.64, "end": 482.65999999999997, "text": "spin it up. And so they're all spinning correctly. So we click on that motor and spins up. So let's"}, {"start": 482.65999999999997, "end": 490.0, "text": "click Save. Wow, that's loud. Okay, sorry about that. So it's going to it's going to restart the"}, {"start": 490.0, "end": 497.38, "text": "aircraft and save it. And then you see, I'm getting this accelerometer warning. That's fine, because I"}, {"start": 497.38, "end": 503.15999999999997, "text": "haven't finished setting this all up. Once I get the quad like stabilized, and the the screws tighten down,"}, {"start": 503.16, "end": 510.5, "text": "then I'll do the accelerometer calibration. All right, let's go back into the motors tab."}, {"start": 511.40000000000003, "end": 518.1, "text": "And now let's check the motors again with this testing mode. So let's spin up motor one."}, {"start": 518.84, "end": 526.6, "text": "And it spins. All right. Motor two should be the front right and it is motor three should be the back"}, {"start": 526.6, "end": 532.86, "text": "left and it is and motor four is the front left. All right. So congratulations."}, {"start": 533.16, "end": 539.9599999999999, "text": "That solved a lot of problems. Okay, so we so now we have the motor order taken care of. Let's move on"}, {"start": 539.9599999999999, "end": 545.56, "text": "to the motor direction. Now at this point, we need to decide if we want to have our propellers spinning"}, {"start": 545.56, "end": 552.3399999999999, "text": "in or outward. And so if you look at the front of the quad, here's some propellers here. If you want"}, {"start": 552.3399999999999, "end": 558.3, "text": "them to spin. Well, let's see, these are right propellers. Yeah, I don't know. I don't have the right"}, {"start": 558.3, "end": 562.68, "text": "propellers on here. But this is just for demonstration purposes. So if you want them to spin in an"}, {"start": 562.68, "end": 568.68, "text": "outward rotation, like spinning out away from the front and out away from the back,"}, {"start": 569.4799999999999, "end": 574.76, "text": "then that's called props out. If you want them to spin inward, like towards your camera,"}, {"start": 575.3199999999999, "end": 582.3599999999999, "text": "or inward towards the tail of the quadcopter, that's called props in. I like to have them spin props"}, {"start": 582.3599999999999, "end": 589.4799999999999, "text": "out, because I think it keeps junk from getting slung onto the lens of the camera."}, {"start": 589.48, "end": 596.28, "text": "And so and as some people have other preferences, but that's how I like to have them. So we want to"}, {"start": 596.28, "end": 601.64, "text": "make sure that the motors are spinning in that orientation. Now this is this part is really"}, {"start": 601.64, "end": 609.16, "text": "important. If you decide to, to use reversed props or spinning props out, you want to go over to the"}, {"start": 609.16, "end": 614.6, "text": "motor mixer section. And right below that diagram, you'll see a little slider that says motor direction"}, {"start": 614.6, "end": 621.0, "text": "is reversed, you want to click that. And you see how it changes the little arrows, those little"}, {"start": 622.0400000000001, "end": 627.08, "text": "yellow arrows, it's going to change the direction. And that's going to show you like, yeah, you want"}, {"start": 627.08, "end": 632.6800000000001, "text": "that's, that's how they should be spinning. Now clicking this box does not actually change the"}, {"start": 632.6800000000001, "end": 639.96, "text": "motor direction. This just tells the flight controller that that is the way the motors are spinning. So it can"}, {"start": 639.96, "end": 647.0, "text": "work its magic and fly stable stably. So we want to make sure we click that. And then let's hit save and"}, {"start": 647.0, "end": 656.6, "text": "reboot. Man, that's loud. Okay. All right, let's get back in here. Let's go to the motors tab again."}, {"start": 657.1600000000001, "end": 663.0, "text": "Okay, so now we can check the motor direction, we're going to go into the testing mode, we're going to start"}, {"start": 663.0, "end": 669.0, "text": "with motor one, we're going to spin it up. And it is spinning, I can just feel it with you know, feel"}, {"start": 669.0, "end": 674.84, "text": "the motor bell with my finger. Don't get your finger caught in there or anything. It is spinning props"}, {"start": 674.84, "end": 680.84, "text": "in. Or if you're looking straight down, it's spinning in a clockwise rotation, we want it to spin the"}, {"start": 680.84, "end": 686.2, "text": "opposite direction. So what we're going to do, actually, we don't even need to do that. Sorry,"}, {"start": 686.2, "end": 690.76, "text": "that doesn't even make any sense. All right, now that we're back in the motor tab, we're going to go down to"}, {"start": 690.76, "end": 695.72, "text": "the button at the bottom right. And it's going to say motor direction, we're going to click on that."}, {"start": 696.68, "end": 702.4399999999999, "text": "It's going to give us the safety warning, and then information notice, and it gives you the instructions"}, {"start": 702.4399999999999, "end": 708.68, "text": "on how to do that. And it says some, not all DSHOT ESDs will work with this dialogue. So just keep that in"}, {"start": 708.68, "end": 715.4, "text": "mind, if it doesn't work for some reason, this is possibly why. All right, so we're going to say yes, I"}, {"start": 715.4, "end": 720.4399999999999, "text": "understand the risks. And you can do a wizard thing where it's guided or you can do individually."}, {"start": 720.76, "end": 727.0, "text": "Let's go ahead and do the guided version. And so it's going to say, so we're going to start"}, {"start": 727.0, "end": 733.4, "text": "spinning the motors. Okay, click on motor numbers individually to change spin direction, verify all"}, {"start": 733.4, "end": 739.56, "text": "motors are spinning correctly. So what we can do is, let's just start with one and we'll go through"}, {"start": 739.56, "end": 744.84, "text": "them all. So motor number one is spinning the wrong way. It's spinning clockwise, we want to change that."}, {"start": 744.84, "end": 751.08, "text": "So let's click on number one, it stopped the motor, and now it's spinning in the opposite direction."}, {"start": 751.08, "end": 756.2, "text": "So that's good. Motor number two, the front right motor, that's spinning in the correct direction,"}, {"start": 756.2, "end": 762.2800000000001, "text": "which is clockwise, or in in how I want these props to be set up. And you and it does show this little"}, {"start": 762.2800000000001, "end": 768.2, "text": "diagram and which way the props should be spinning, since we have it set up for reversed. Let's go to"}, {"start": 768.2, "end": 776.2, "text": "motor three, that is spinning in the correct direction as well. And then motor four is spinning in the"}, {"start": 776.2, "end": 781.5600000000001, "text": "wrong direction. It's spinning like props in, we want it to spin props out. So let's click on number four."}, {"start": 782.5200000000001, "end": 789.32, "text": "And there we go. Now it's spinning in the correct direction. Okay, so then we'll hit stop motors, and then"}, {"start": 789.32, "end": 795.48, "text": "close. And is there can we hit save and reboot? Is that an option? All right, now let's go over to the motor test"}, {"start": 796.28, "end": 802.12, "text": "thing right here. And we'll spin up the motor. And yeah, it's going the right way. Okay, we can click"}, {"start": 802.12, "end": 809.96, "text": "on the slide, do the master slider and slide all of them. And check them. Yes, so they are all spinning"}, {"start": 809.96, "end": 815.4, "text": "in the correct direction. So that's it. I think that's it. So we don't have the option to save and"}, {"start": 815.4, "end": 821.48, "text": "reboot. So I guess it just automatically saved it. So that's great. All right, so that that's it. That's it,"}, {"start": 821.48, "end": 827.32, "text": "actually. So congratulations, you should have your quadcopter working properly. Now, the next thing"}, {"start": 827.32, "end": 835.88, "text": "is, we would want to check and make sure that the motor responds properly, based on our control inputs."}, {"start": 835.88, "end": 841.96, "text": "And that that's kind of a separate thing. Because this should be like the baseline, like the flight"}, {"start": 841.96, "end": 849.24, "text": "controller now understands which motors are where, and that the motors are in the correct spot."}, {"start": 850.6, "end": 855.08, "text": "And that they're spinning in the correct direction. So this is kind of the baseline thing. That's all"}, {"start": 855.08, "end": 859.88, "text": "we're going to do in this video. Thanks for watching. I hope this was helpful. If you have questions"}, {"start": 859.88, "end": 864.84, "text": "about setting up your quadcopter and getting the motors right, leave a comment down below. And hopefully,"}, {"start": 864.84, "end": 871.24, "text": "I or someone else will be able to help you. Thanks for watching. Get out there and fly something and I'll see you next time."}]}