{"video_id": "qNLvoSQCx60", "url": "https://www.youtube.com/watch?v=qNLvoSQCx60", "title": "qNLvoSQCx60", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 7.4, "text": "Let's imagine you got a microcontroller board like this ESP32 and you just recorded"}, {"start": 7.4, "end": 11.1, "text": "an awesome sound clip which sounds like this."}, {"start": 11.1, "end": 13.040000000000001, "text": "Stay creative!"}, {"start": 13.040000000000001, "end": 19.26, "text": "Now of course you want to playback this sound with the help of the ESP32 so what do you"}, {"start": 19.26, "end": 20.26, "text": "do?"}, {"start": 20.26, "end": 24.36, "text": "Well, the input side is pretty straight forward."}, {"start": 24.36, "end": 32.4, "text": "By simply adding a microSD card breakout board to the ESP32 through its SPI interface."}, {"start": 32.4, "end": 37.78, "text": "Due to this fast data line all the bits of the original audio file can be read by the"}, {"start": 37.78, "end": 42.86, "text": "ESP32 without losing any audio quality."}, {"start": 42.86, "end": 49.36, "text": "That means we still got the original resolution of 16 bits which describes in how many steps"}, {"start": 49.36, "end": 54.9, "text": "our original analog audio signal was digitally converted."}, {"start": 54.9, "end": 61.8, "text": "As a rule of thumb the more bits we got the closer we are to the original analog signal."}, {"start": 61.8, "end": 69.18, "text": "Also the sampling rate of 44.1kHz is kept intact which describes how often the voltage of the"}, {"start": 69.18, "end": 71.84, "text": "analog signal got sampled."}, {"start": 71.84, "end": 76.7, "text": "In this case around every 22.7 microseconds."}, {"start": 76.7, "end": 82.8, "text": "And once again the higher the sampling rate the closer we get to the real analog signal."}, {"start": 82.8, "end": 89.8, "text": "But let me tell you that 16 bits and 44.1kHz sounds pretty good."}, {"start": 89.8, "end": 96.86, "text": "So the input side is done and for the output side we could use the internal DAC aka digital"}, {"start": 96.86, "end": 103.92, "text": "to analog converter of the ESP32 to create the analog audio signal."}, {"start": 103.92, "end": 110.1, "text": "But sadly it only comes with a resolution of 8 bits which would act as a bottleneck for"}, {"start": 110.1, "end": 112.68, "text": "our audio quality."}, {"start": 112.68, "end": 123.22, "text": "Instead I wanted to use this MAX98357A amplifier breakout board which uses I2S to communicate."}, {"start": 123.22, "end": 129.7, "text": "So in this video we will find out what I2S is and why it is pretty handy to use."}, {"start": 129.7, "end": 136.0, "text": "And along the way we will not only learn working with the I2S amplifier board but also with"}, {"start": 136.0, "end": 139.26, "text": "an I2S microphone board."}, {"start": 139.26, "end": 153.06, "text": "Let's get started!"}, {"start": 153.06, "end": 161.44, "text": "This video is sponsored by JLCPCB who produce high quality PCBs for a very affordable price."}, {"start": 161.44, "end": 166.58, "text": "After over 3 years of using their service I can still highly recommend it."}, {"start": 166.58, "end": 175.44, "text": "So why not upload your Gerber files today and receive your PCBs sometimes even within a week."}, {"start": 175.44, "end": 183.3, "text": "First off I want to say that we are not forced to use an I2S DAC amplifier board on the output."}, {"start": 183.3, "end": 192.74, "text": "We could also build up a 16-bit R2R DAC but that would require 16 pins of the ESP32 and thus"}, {"start": 192.74, "end": 195.5, "text": "is not practically usable."}, {"start": 195.5, "end": 203.5, "text": "Or we could simply get a 16-bit DAC IC which we could hook up to the ESP32 through for example"}, {"start": 203.5, "end": 205.66, "text": "I2C."}, {"start": 205.66, "end": 213.0, "text": "But then again if we already use a communication protocol why not use I2S which was specifically"}, {"start": 213.0, "end": 216.2, "text": "designed for audio applications."}, {"start": 216.2, "end": 225.32, "text": "I2S stands for Inter-IC Sound and it is an electrical serial bus interface used for obviously connecting"}, {"start": 225.32, "end": 228.23999999999998, "text": "digital audio devices."}, {"start": 228.23999999999998, "end": 235.7, "text": "It communicates PCM audio data which stands for Pulse Code Modulation and that is a method"}, {"start": 235.7, "end": 243.45999999999998, "text": "to digitally represent sampled analog signals which is for example used by our .Wave sound"}, {"start": 243.45999999999998, "end": 245.06, "text": "file."}, {"start": 245.06, "end": 251.68, "text": "It basically stores the binary values of all the sampled analog voltage values in it and"}, {"start": 251.68, "end": 256.58, "text": "that is basically what we want to send around with I2S."}, {"start": 256.58, "end": 262.48, "text": "For first practical example however let's not start off with the amplifier board but instead"}, {"start": 262.48, "end": 268.24, "text": "with this INMP441 microphone breakout board."}, {"start": 268.24, "end": 272.86, "text": "With it the I2S concept will be easier to understand."}, {"start": 272.86, "end": 283.48, "text": "Since we only have to read in data with the microphone while we would have to read in data and send out data with the microSD card and the amplifier board."}, {"start": 283.48, "end": 288.04, "text": "But anyway the microphone features 6 pins."}, {"start": 288.04, "end": 296.66, "text": "Of which 2 are for power, 3 are for the I2S interface and 1 is kind of a bonus to select whether the microphone"}, {"start": 296.66, "end": 299.56, "text": "outputs its data on the left or right channel."}, {"start": 299.56, "end": 309.18, "text": "The 3 pins required for the I2S are called World Select, Serial Clock and Serial Data."}, {"start": 309.18, "end": 316.18, "text": "In the case of the amplifier board later on they feature slightly different names but still mean the same thing."}, {"start": 316.18, "end": 326.8, "text": "So as a first test I soldered wires to the 5 important pins and continued by having a look at the ESP32 pinout diagram."}, {"start": 326.8, "end": 334.8, "text": "In order to find out where to connect the I2S pins and to my surprise there were no specific pins mentioned."}, {"start": 334.8, "end": 344.8, "text": "As it turns out the ESP32 comes with 2 I2S peripherals but you can select the pins for them by yourself."}, {"start": 344.8, "end": 353.48, "text": "So I decided on the pins 15, 2 and 4 according to this wiring diagram."}, {"start": 353.48, "end": 362.68, "text": "And after connecting a microUSB cable I had a quick look at the I2S programming guide page for the ESP32."}, {"start": 362.68, "end": 372.76, "text": "I simply copied a bit of the shown codes in order to not only set the resolution to 16 bits and the sampling rates to 44.1kHz"}, {"start": 372.76, "end": 378.0, "text": "but also to initialize and start the I2S communication."}, {"start": 378.0, "end": 384.92, "text": "All I had to add were a couple of lines to output the received data through the Serial Monitor."}, {"start": 384.92, "end": 394.62, "text": "And after uploading the code and opening the Serial Monitor we can see that by whistling into the microphone or tapping it"}, {"start": 394.62, "end": 401.18, "text": "the Serial Monitor or even better the Serial Plotter seems to react accordingly."}, {"start": 401.18, "end": 402.18, "text": "Awesome!"}, {"start": 402.18, "end": 411.42, "text": "That means everything works fine and it was time to have a look at the three I2S pins on the oscilloscope."}, {"start": 411.42, "end": 418.3, "text": "First off we can see that the word select line constantly alters between high and low."}, {"start": 418.3, "end": 430.18, "text": "The reason is that this bus transmits stereo audio and so the low state of the word select line indicates the left channel and the high state stands for the right channel."}, {"start": 430.18, "end": 439.42, "text": "By the way in this example we only got data on the left channel because the unconnected LR pin defines that."}, {"start": 439.42, "end": 450.66, "text": "Then we got the Serial Clock generated by the ESP32 at whose rising edge the data of the Serial Data gets sampled."}, {"start": 450.66, "end": 459.90000000000003, "text": "This way the audio data bits sent out by the microphone can be read by the ESP32 which is pretty standard"}, {"start": 459.9, "end": 462.14, "text": "communication interface knowledge."}, {"start": 462.14, "end": 468.14, "text": "You should know from my SPI, I2C or for example CAN video."}, {"start": 468.14, "end": 474.58, "text": "But what is special about this communication is the frequency of the clock signal."}, {"start": 474.58, "end": 483.82, "text": "It is actually adjustable and depends on the sampling rate, bit resolution and whether you want to transmit mono or stereo."}, {"start": 483.82, "end": 503.82, "text": "In our microphone example we selected 44.1kHz with 16 bits and stereo which means we have to multiply 44.1kHz by 16 by 2 which equals 1.411MHz which is also the frequency we are measuring."}, {"start": 503.82, "end": 515.06, "text": "Now of course at this point we could alter the received microphone data to for example create a voice changer or even a pretty scientific sound level meter."}, {"start": 515.06, "end": 519.06, "text": "But that was not the goal of this video."}, {"start": 519.06, "end": 532.06, "text": "Instead I soldered wires to my I2S amplifier board as well as the microSD card board and hooked it all up to the ESP32 according to this wiring diagram."}, {"start": 532.06, "end": 540.06, "text": "This time though the coding was not only about the I2S write part but also about SPI."}, {"start": 540.06, "end": 555.06, "text": "Which is why instead of writing all of the code by myself which could have taken months, I decided to use the available ESP8266 audio library and some code bits from SparkFun."}, {"start": 555.06, "end": 562.06, "text": "But in the code we can still see that the I2S part is pretty straightforward to implement."}, {"start": 562.06, "end": 572.06, "text": "And after uploading the code, connecting a speaker and inserting the microSD card with the sound file we can hear this."}, {"start": 572.06, "end": 574.06, "text": "Stay creative!"}, {"start": 574.06, "end": 575.06, "text": "Awesome!"}, {"start": 575.06, "end": 580.06, "text": "And just like that you are now familiar with the I2S basics."}, {"start": 580.06, "end": 593.06, "text": "And all in all I can say that it is a pretty easy to implement and handy to use communication interface when it comes to receiving and sending digital audio."}, {"start": 593.06, "end": 606.06, "text": "And if you are interested in a more advanced video about the topic then I would highly recommend checking out Bitlooney's video about creating a sound driver for the ULP of the ESP32."}, {"start": 606.06, "end": 612.06, "text": "But anyway I hope you enjoyed this video and learned something new."}, {"start": 612.06, "end": 618.06, "text": "If so don't forget to like, share, subscribe and hit the notification bell."}, {"start": 618.06, "end": 622.06, "text": "Stay creative and I will see you next time!"}]}