{"video_id": "S0j4xOuRzD4", "url": "https://www.youtube.com/watch?v=S0j4xOuRzD4", "title": "S0j4xOuRzD4", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 7.78, "text": "This little component right here is a full bridge rectifier which converts our AC mains voltage we"}, {"start": 7.78, "end": 14.700000000000001, "text": "get from our outlets into a rather bumpy DC voltage. This might sound unspectacular but"}, {"start": 14.700000000000001, "end": 20.98, "text": "if we add a capacitor to the rectifier's output we get a smooth DC voltage that is basically"}, {"start": 20.98, "end": 27.32, "text": "required for every modern power supply to work. So yes, full bridge rectifiers are a big deal"}, {"start": 27.32, "end": 34.52, "text": "and make our modern electronics world possible. But that doesn't mean they are perfect. They in fact"}, {"start": 34.52, "end": 40.88, "text": "come with a noticeable voltage drop which multiplies with the flowing current equals the power loss that"}, {"start": 40.88, "end": 47.44, "text": "the rectifier dissipates in the form of heat. Needless to say we want to keep this power loss as small as"}, {"start": 47.44, "end": 54.88, "text": "possible to increase efficiency and that is why I was super excited to find this active rectifier board"}, {"start": 54.88, "end": 60.7, "text": "on the internet which apparently replaces the old school diodes of a full bridge rectifier"}, {"start": 60.7, "end": 66.76, "text": "with MOSFETs in order to decrease the voltage drop and thus power losses."}, {"start": 66.76, "end": 72.98, "text": "So in this video we will not only put this pre-made active rectifier board to the test but also"}, {"start": 72.98, "end": 80.16, "text": "try to create our own DIY version in order to find out whether they are the future of rectification"}, {"start": 80.16, "end": 85.44, "text": "or whether we should stick with the old school solution instead. Let's get started!"}, {"start": 94.08, "end": 99.92, "text": "This video is sponsored by Altium. Now you might already be familiar with the Altium Designer for"}, {"start": 99.92, "end": 107.12, "text": "creating schematics and PCBs since I mentioned it once or twice before. But today I want to tell you about"}, {"start": 107.12, "end": 114.24000000000001, "text": "Altium 365 which is already integrated into the designer software and lets you easily share your"}, {"start": 114.24000000000001, "end": 120.64, "text": "designs not only with your colleagues but basically the entire world. This way you can get feedback"}, {"start": 120.64, "end": 127.12, "text": "easily and speed up your design process. So why not give it a try for free by clicking the link in the"}, {"start": 127.12, "end": 134.08, "text": "description. First off we need to understand how a traditional full bridge rectifier functions."}, {"start": 134.08, "end": 140.72000000000003, "text": "As you can see in this schematic it only consists of 4 diodes positioned in a particular arrangement"}, {"start": 141.36, "end": 146.8, "text": "which I personally like to draw like this because this way it is easier to understand."}, {"start": 147.76000000000002, "end": 153.84, "text": "And let's imagine we got a resistive load on the output across which we should later get the bumpy"}, {"start": 153.84, "end": 161.60000000000002, "text": "DC voltage we saw before and on the input we got the mains AC voltage. So how exactly do we go from"}, {"start": 161.6, "end": 169.68, "text": "this to this is the question? Well the answer lies in the behavior of a diode which lets current flow in"}, {"start": 169.68, "end": 176.72, "text": "only one direction and not the other. That means that when AC mains voltage is in the positive region"}, {"start": 176.72, "end": 182.95999999999998, "text": "we got a voltage potential here which lets current flow this way. And when the AC mains voltage is in"}, {"start": 182.95999999999998, "end": 189.04, "text": "the negative region we got the opposite voltage potential here which this time lets current flow this way."}, {"start": 190.0, "end": 196.88, "text": "So in both cases a current flow through the load was possible and what is remarkable is that the current"}, {"start": 196.88, "end": 204.88, "text": "direction was always the same which basically means we folded over one half of the AC voltage and thus created DC."}, {"start": 205.84, "end": 212.0, "text": "Pretty straightforward if you ask me but the bad news is that every diode comes with a certain voltage drop"}, {"start": 212.0, "end": 218.88, "text": "which causes the power loss I talked about at the beginning. The AC rectifier idea wants to change"}, {"start": 218.88, "end": 226.0, "text": "that by replacing the diodes with MOSFET switches that come with super low resistances and thus should"}, {"start": 226.0, "end": 233.68, "text": "decrease the power losses. Only problem is that MOSFETs are not exactly diodes even though they come with a"}, {"start": 233.68, "end": 240.96, "text": "body diode that also only allows one current path direction. But using the body diode is not the goal"}, {"start": 240.96, "end": 247.52, "text": "of the voltage voltage drop. Since its voltage drop is also rather high. No, we want to apply a DC voltage"}, {"start": 247.52, "end": 254.64000000000001, "text": "to the MOSFETs gate in order to properly turn it on. So for full bridge rectifier we would need some"}, {"start": 254.64000000000001, "end": 261.28000000000003, "text": "kind of circuitry that detects when the AC voltage is either positive or negative and depending on that"}, {"start": 261.28000000000003, "end": 267.6, "text": "only turns on the two MOSFETs diagonally to one another to mimic the functionality of a full bridge"}, {"start": 267.6, "end": 275.6, "text": "rectifier. Good timing is also key here because if just one additional MOSFET is on at any point"}, {"start": 275.6, "end": 282.32000000000005, "text": "we basically got a short circuit. And that is exactly why I was rather happy that I didn't have to design"}, {"start": 282.32000000000005, "end": 292.32000000000005, "text": "such a circuit myself because I found the TEA2206 and TEA2208IC on the internet. They are active bridge"}, {"start": 292.32, "end": 299.28, "text": "rectifier controllers and can do what I just described by utilizing their built in comparators and MOSFET"}, {"start": 299.28, "end": 305.84, "text": "drivers. So according to their typical application schematic there is not much I have to add to the"}, {"start": 305.84, "end": 312.88, "text": "ICs to create an active rectifier, just some MOSFETs and capacitors. And in case you are wondering the"}, {"start": 312.88, "end": 321.92, "text": "2206 one only replaces the lower side diodes with MOSFETs while the 2208 one replaces them all which"}, {"start": 321.92, "end": 328.64000000000004, "text": "begs the question why I even got the 2206 version if it only does half the job of lowering the power"}, {"start": 328.64000000000004, "end": 335.84000000000003, "text": "losses. Well, the reason is that I got my hands on a development board around it which I can use to"}, {"start": 335.84000000000003, "end": 343.76, "text": "get my feet wet since it should be functional right? To safely try it out I utilized my small auto"}, {"start": 343.76, "end": 351.76, "text": "transformer to decrease the mains voltage to 25V ACRMS which I directly hooked up to the active rectifier."}, {"start": 352.56, "end": 357.44, "text": "And as you can see on the oscilloscope it does seem to work just fine, awesome!"}, {"start": 358.56, "end": 364.64000000000004, "text": "That means it was time for the first efficiency tests slash comparisons which I performed by adding"}, {"start": 364.64000000000004, "end": 371.44, "text": "a capacitor bank to the rectifier's output as well as a constant load and then drawing varying constant"}, {"start": 371.44, "end": 378.16, "text": "current with it while measuring how much input power that required. Of course to get accurate values on"}, {"start": 378.16, "end": 385.04, "text": "the output side I also utilized my multimeter to precisely measure the current and my oscilloscope"}, {"start": 385.04, "end": 391.84000000000003, "text": "to get the RMS voltage value. After that was done I replaced the active rectifier with a normal full"}, {"start": 391.84000000000003, "end": 398.48, "text": "bridge rectifier and basically repeated this test in order to find out that the average efficiency was"}, {"start": 398.48, "end": 404.8, "text": "bumped up around 2 to 4% with the active version. Not bad!"}, {"start": 404.8, "end": 409.76, "text": "But of course next I wanted to replace all the diodes to increase the efficiency even more."}, {"start": 410.48, "end": 418.48, "text": "To do that I soldered the TEA2208IC to a breakout board and afterwards to a perf board to which I"}, {"start": 418.48, "end": 425.12, "text": "then added the 4 MOSFETs and some capacitors pretty much like the typical application schematic recommended"}, {"start": 425.12, "end": 432.56, "text": "me to do. The result didn't look half bad but I was still very nervous while doing the first test with"}, {"start": 432.56, "end": 438.64, "text": "lowered mains voltage. But as you can see on the oscilloscope this active rectifier also seems to"}, {"start": 438.64, "end": 445.6, "text": "work just fine at least with resistive loads. Because while trying to charge up the capacitor bank for"}, {"start": 445.6, "end": 450.8, "text": "the power test there appeared to be some sort of short circuit problem with the rectifier."}, {"start": 451.68, "end": 459.68, "text": "Not sure if my design with the low cost high resistance MOSFETs is the problem or whether the topology and IC can"}, {"start": 459.68, "end": 465.92, "text": "generally not handle capacitive loads because the datasheet also states that a boost type power"}, {"start": 465.92, "end": 472.24, "text": "factor circuit must follow the application which more or less prevents current surges from capacitors."}, {"start": 473.12, "end": 477.76, "text": "The circuit does however work just fine with like I said resistive loads."}, {"start": 478.56, "end": 484.08, "text": "But due to obvious safety concerns I really didn't want to include it in the next mains voltage power"}, {"start": 484.08, "end": 490.32, "text": "supply test in which I basically measured the efficiency of a common switch mode power supply"}, {"start": 490.32, "end": 497.36, "text": "before and after implementing an active rectifier. The only thing though that held me back once again"}, {"start": 497.36, "end": 506.4, "text": "was a familiar sentence in the TEA2206 datasheet that states that it is intended for applications followed by a PFC."}, {"start": 507.52, "end": 513.04, "text": "And since such a power factor circuit got mentioned twice now, let me tell you that it basically"}, {"start": 513.04, "end": 518.0799999999999, "text": "prevents that mains current only gets drawn near the peak of the AC mains voltage."}, {"start": 519.04, "end": 525.28, "text": "Instead it distributes the current draw evenly across the whole sinusoidal voltage but more about"}, {"start": 525.28, "end": 531.68, "text": "that topic in another video. The only problem was that pretty much all of my power supplies didn't"}, {"start": 531.68, "end": 539.4399999999999, "text": "come with this feature except of course one that I need to charge my newest laptop. And I decided to"}, {"start": 539.44, "end": 546.1600000000001, "text": "not sacrifice it for this video which is why I pushed my luck and tried it with this a bit nicer power"}, {"start": 546.1600000000001, "end": 552.08, "text": "supply that not only comes with less sharp current surges but also some filters on its inputs."}, {"start": 553.12, "end": 559.7600000000001, "text": "So after doing the usual power measurement test with it, I desoldered its original full bridge rectifier"}, {"start": 559.7600000000001, "end": 563.6, "text": "and simply replaced it with the leads of the active rectifier boards."}, {"start": 563.6, "end": 568.16, "text": "So I did not get the same thing as I did. And luckily nothing exploded after the power up and"}, {"start": 568.16, "end": 572.32, "text": "everything worked perfectly fine so that I could do all the measurements."}, {"start": 573.2, "end": 579.76, "text": "Now the final results tell us that the active rectifier is once again more efficient but this time"}, {"start": 579.76, "end": 588.24, "text": "only with a difference of around 0.2 to a maximum of 0.9%. The reason is that due to the higher mains"}, {"start": 588.24, "end": 595.12, "text": "voltage level of 230V that gets transformed down, there is only a small current flowing through the"}, {"start": 595.12, "end": 601.76, "text": "rectifier which does not create that big of a power loss and thus is not that important for the efficiency."}, {"start": 602.8, "end": 608.64, "text": "But if we got a low voltage high current system without transformation then a better rectifier"}, {"start": 608.64, "end": 613.12, "text": "is definitely recommended as we proved in test 1 of this video."}, {"start": 613.12, "end": 620.0, "text": "So in conclusion the old school full bridge rectifier is definitely good enough for most of the mains"}, {"start": 620.0, "end": 625.84, "text": "voltage rectification because it is cheap, rigid and efficient enough for this task."}, {"start": 626.72, "end": 631.92, "text": "With that being said I hope you learned something new through this video and now understand the"}, {"start": 631.92, "end": 639.04, "text": "advantages and disadvantages of active rectifiers. If so consider supporting me through Patreon."}, {"start": 639.04, "end": 657.76, "text": "Don't forget to like, share, subscribe and hit the notification bell. Stay creative and I will see you next time!"}]}