{"video_id": "AN3yxIBAxTA", "url": "https://www.youtube.com/watch?v=AN3yxIBAxTA", "title": "AN3yxIBAxTA", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.96, "end": 4.5600000000000005, "text": "This is a brushless motor one-axis PID control example."}, {"start": 5.68, "end": 10.32, "text": "In general, all flying machines use this kind of feedback control in order to fly straight."}, {"start": 11.6, "end": 17.2, "text": "To control the inclination angle, the system uses the MPU6050 gyro and accelerometer"}, {"start": 17.2, "end": 19.92, "text": "and to control the movement, these two brushless motors."}, {"start": 21.68, "end": 27.6, "text": "The idea of this tutorial is to understand how PID control works inside of a drone flight controller"}, {"start": 27.6, "end": 32.64, "text": "in order to be able to create our own flight controller code for the fully Arduino based project."}, {"start": 34.08, "end": 35.2, "text": "So let's get started."}, {"start": 45.92, "end": 47.84, "text": "What's up my friends, welcome back."}, {"start": 48.88, "end": 53.28, "text": "In this video we will see an example of PID control for one axis movement."}, {"start": 53.28, "end": 61.04, "text": "Once we see how the control works for just one axis, we could apply the code for two axis in case of a drone."}, {"start": 62.64, "end": 65.84, "text": "The first thing to do is to build a balance for our test."}, {"start": 67.12, "end": 70.8, "text": "For that I've used a 55 cm long square meter bar."}, {"start": 72.16, "end": 74.48, "text": "I've drilled a hole exactly in the middle."}, {"start": 75.44, "end": 79.2, "text": "Then I've passed an 8 mm screw through the hole and through some bearings."}, {"start": 79.2, "end": 86.32000000000001, "text": "I fit in place the two bearings to a wood support and screw in place this wood support to a wood base."}, {"start": 88.32000000000001, "end": 92.08, "text": "The only thing left is to make some holes in both ends of the metal bar."}, {"start": 93.68, "end": 97.92, "text": "Through these holes I'll pass some zip ties and tighten place two brushless motors."}, {"start": 99.76, "end": 102.24000000000001, "text": "The motors are connected following this schematic."}, {"start": 102.24, "end": 109.19999999999999, "text": "I've soldered the ESCs to each motor and make sure that the motors will spin in these directions."}, {"start": 111.36, "end": 116.72, "text": "I've soldered together the supply wires of each ESCs and added a LiPo connector to the end."}, {"start": 118.24, "end": 125.84, "text": "To supply the motors you could use a 3S LiPo battery or as in my case a PC power supply with 12V output,"}, {"start": 125.84, "end": 129.44, "text": "since I will be using the motors for a long time for multiple tests."}, {"start": 131.20000000000002, "end": 136.72, "text": "Now the next step is to add the Arduino microcontroller and the MPU 6050 IMU board."}, {"start": 138.4, "end": 144.72, "text": "Using a breadboard I make these connections from the Arduino to the module and connect ground and signal to the two ESCs."}, {"start": 146.32, "end": 151.2, "text": "Now make sure that you place the IMU board as center as you can between the two motors."}, {"start": 151.2, "end": 157.6, "text": "I've used a small balsa wood board and some double side tape to fit everything in place."}, {"start": 159.83999999999997, "end": 161.44, "text": "Now the circuit is ready."}, {"start": 162.56, "end": 165.76, "text": "The MPU 6050 I2C connection is done."}, {"start": 166.48, "end": 170.48, "text": "The ESC signals are connected and the power supply is ready to go."}, {"start": 172.16, "end": 174.72, "text": "The only thing left is to program the Arduino."}, {"start": 176.56, "end": 179.2, "text": "Ok, so let's understand what PID control is."}, {"start": 179.2, "end": 184.56, "text": "PID stands for proportional, integral and derivative control."}, {"start": 186.39999999999998, "end": 191.51999999999998, "text": "In our case we want to control the angle of the metal bar since we want the drone to fly straight,"}, {"start": 191.51999999999998, "end": 193.76, "text": "horizontal and without wobbling around."}, {"start": 196.0, "end": 202.56, "text": "These brushless motors are very powerful and any small change of power will spin the metal bar to the left or to the right."}, {"start": 204.48, "end": 207.28, "text": "We need a fast and accurate control of the angle."}, {"start": 209.83999999999997, "end": 214.48, "text": "Ok, so the MPU 6050 module will give us gyro and acceleration data."}, {"start": 215.76, "end": 220.64, "text": "Using this data and applying some filters we obtain the real inclination angle of the metal bar."}, {"start": 222.32, "end": 226.56, "text": "We will see the entire code and how to obtain the data and the angle a little bit later."}, {"start": 228.0, "end": 229.83999999999997, "text": "First, let's see how we will proceed."}, {"start": 229.84, "end": 238.88, "text": "Ok, so we know the real angle of the metal bar and we want it to stay always at 0 degrees which is perfectly horizontal."}, {"start": 240.24, "end": 244.16, "text": "The maximum angle to the right will be in this case around 45 degree."}, {"start": 244.16, "end": 253.84, "text": "Ok, so let's imagine now that we power up the motors with no control at all."}, {"start": 255.2, "end": 258.71999999999997, "text": "The brushless motors will be always different respecting the power."}, {"start": 258.72, "end": 270.48, "text": "It's almost impossible to have the same output power for the same signal since the motors are mechanical things and even a small difference will make a motor have more power than the other one."}, {"start": 270.48, "end": 277.20000000000005, "text": "So even with the same speed signal the metal bar will lean to the direction of the less powerful motor."}, {"start": 278.72, "end": 282.40000000000003, "text": "In this case, the PID control will work in the following way."}, {"start": 282.4, "end": 288.0, "text": "I think this is the most common representation of a PID control that you could find."}, {"start": 289.67999999999995, "end": 296.0, "text": "As you can see, we have our process that in this case will be the movement of the motors to keep the metal bar horizontal."}, {"start": 297.2, "end": 303.91999999999996, "text": "After the process, we have our feedback to the system that in this case is the real angle that the IMU unit will give us."}, {"start": 306.08, "end": 309.12, "text": "Now we first have to calculate the error of our control."}, {"start": 309.12, "end": 315.44, "text": "This error is the difference between a desired value and the real value of the system."}, {"start": 316.88, "end": 325.04, "text": "In our case, our desired value is zero degree angle of the metal bar and the real value is the data received from the IMU unit."}, {"start": 326.8, "end": 330.56, "text": "So, the first thing to do is to create a variable and name it error."}, {"start": 332.32, "end": 336.56, "text": "We will give the difference value between the real angle and zero to this variable."}, {"start": 336.56, "end": 340.56, "text": "Now we have our error value in each loop."}, {"start": 342.64, "end": 346.24, "text": "The next step in the PID control is to use these three constants."}, {"start": 347.6, "end": 355.6, "text": "These constants are Kp, Ki and Kd as for proportional constants, integrate constants and derivative constant."}, {"start": 356.72, "end": 362.88, "text": "The total output of the PID control is the sum of these three parts, proportional, integrate and derivative."}, {"start": 362.88, "end": 367.36, "text": "The total output of the PID control is the sum of these two constants."}, {"start": 369.6, "end": 375.28, "text": "Ok, so let's start with the integrate and derivative constants equal to zero and the proportional to one."}, {"start": 377.04, "end": 380.88, "text": "In this case, the output of the PID control will be the error itself."}, {"start": 380.88, "end": 394.8, "text": "Now we know that we should apply a 1000 microseconds to 2000 microseconds signal to the ESC in order to spin the motors where 1000 is no spinning at all and 2000 is full throttle."}, {"start": 396.24, "end": 399.36, "text": "These values may vary depending on your used ESC."}, {"start": 399.36, "end": 410.72, "text": "Now let's imagine that we make the motor spin at low speed by applying a signal of 1200 microseconds, which is around 20% throttle."}, {"start": 411.28000000000003, "end": 414.08000000000004, "text": "Plus or minus the output of the PID control."}, {"start": 414.08, "end": 421.76, "text": "I say plus or minus because to the right side we have positive values of the angle and in the left side negative."}, {"start": 422.32, "end": 429.2, "text": "So we have to sum the PID value to the right motor and subtract the PID output to the left motor in order to balance the power."}, {"start": 431.2, "end": 438.32, "text": "We power up the system and let's say that at the beginning the left motor will push a little bit harder making the metal bar lean to the right."}, {"start": 438.32, "end": 444.24, "text": "As the bar leans to the right the PID value increase proportional to the angle."}, {"start": 445.68, "end": 454.32, "text": "As bigger the angle gets the right motor will spin faster each time and the left motor slower since we sum the PID value to one and subtract it to the other."}, {"start": 456.48, "end": 459.2, "text": "That will make the bar start leaning to the opposite side."}, {"start": 460.71999999999997, "end": 465.92, "text": "And here, once again following the same process we will start leaning to the right side and so on."}, {"start": 465.92, "end": 472.88, "text": "This will create an oscillating movement of the bar that will maybe stabilize after a long time."}, {"start": 475.12, "end": 479.20000000000005, "text": "The oscillation is too slow with the proportional constant equal to 1."}, {"start": 479.20000000000005, "end": 482.72, "text": "So after some tests I define it to 3 and this is the result."}, {"start": 484.72, "end": 486.08000000000004, "text": "Seems pretty good for now."}, {"start": 488.16, "end": 492.40000000000003, "text": "What we need now is to fast react at the speed of movement of the bar."}, {"start": 492.4, "end": 498.47999999999996, "text": "In this case it's not the angle that we will control but the speed in degrees per second."}, {"start": 500.47999999999996, "end": 507.67999999999995, "text": "So our code will also count the elapsed time of each loop and by dividing the angle difference by this time we will get the speed."}, {"start": 509.67999999999995, "end": 514.9599999999999, "text": "Now we have to multiply this speed by the derivative constant which in this case won't be zero anymore."}, {"start": 514.96, "end": 520.5600000000001, "text": "I set the derivative constant too high and the system gets crazy."}, {"start": 522.08, "end": 524.0, "text": "Set it to low and it won't affect."}, {"start": 525.84, "end": 531.6, "text": "To cancel both effects I'll make the PAT output to be the sum of the proportional and derivative values."}, {"start": 531.6, "end": 538.96, "text": "After some tests I've set the derivative constant to 2 and the result was quite good."}, {"start": 540.32, "end": 545.2, "text": "Now the system stabilizes itself quite well with a good response to the fast speed changes."}, {"start": 547.36, "end": 550.0, "text": "Then what will the integral part add to the system?"}, {"start": 550.0, "end": 557.2, "text": "Well, for very small angles the proportional constant won't affect anymore or the value will be very small."}, {"start": 557.68, "end": 561.84, "text": "And if the metal bar is not moving the derivative constant won't affect neither."}, {"start": 563.76, "end": 567.04, "text": "So the bar could get stabilized but not perfect horizontal."}, {"start": 569.04, "end": 573.84, "text": "For that we add the integrate constant that gets bigger and bigger as more time is elapsed."}, {"start": 573.84, "end": 575.6800000000001, "text": "So the bar is the first."}, {"start": 575.84, "end": 583.2, "text": "To show you how this works I will keep the bar lean to the right and observe that each time the right motor spins faster and the left one slower."}, {"start": 584.88, "end": 588.5600000000001, "text": "That's because each loop the integral value increase a little bit more."}, {"start": 590.5600000000001, "end": 596.08, "text": "This will fine tune our PID control when the angle is very small and the speed is almost zero."}, {"start": 596.08, "end": 604.24, "text": "The integral constant usually is very low. In my case 0.048 was a good value."}, {"start": 606.5600000000001, "end": 614.8000000000001, "text": "For our drone flight controller you could even not use the integral constant and make the PID output just the sum of the proportional and derivative values."}, {"start": 617.36, "end": 623.6, "text": "Now that I've explained you how each part of the PID control works, I've made a bunch of tests and changing the values"}, {"start": 623.6, "end": 632.64, "text": "and my best result was Kp equal to 3.44, Kd equal to 1.92 and Ki equal to 0.048."}, {"start": 635.0400000000001, "end": 640.16, "text": "These PID constants will change depending of the shape, weight and size of the system."}, {"start": 640.16, "end": 643.84, "text": "So when we will add the second axis these values will definitely change."}, {"start": 646.24, "end": 649.44, "text": "Ok, so let's now take a look at the code that I've used."}, {"start": 649.44, "end": 650.48, "text": "I'll show you how to use the code that I've used."}, {"start": 650.48, "end": 651.0400000000001, "text": "I'll show you how to use the code that I've used."}, {"start": 651.0400000000001, "end": 654.8000000000001, "text": "You could download all the schematics, codes and examples using the link below."}, {"start": 656.5600000000001, "end": 659.6800000000001, "text": "Also check my webpage for more details of the tutorial."}, {"start": 662.08, "end": 667.36, "text": "Ok, the first thing to do is to import the libraries and define our motors, the right and the left one."}, {"start": 669.44, "end": 676.8000000000001, "text": "If we study the NPU6050 datasheet and the register map, we will see that it will give us 3 values for the acceleration"}, {"start": 676.8, "end": 681.52, "text": "and 3 values for the gyro data, one for each of the x, y and z axes."}, {"start": 683.1999999999999, "end": 685.68, "text": "We will store those values in these constants."}, {"start": 687.68, "end": 694.0, "text": "In order to obtain a good real angle, we will have to add a filter between the angle obtained with the gyro values"}, {"start": 694.0, "end": 696.0, "text": "and the one obtained with the accelerations."}, {"start": 696.0, "end": 704.4, "text": "We can get the total angle using this formula where we can obtain the gyro angle directly with the IMU values"}, {"start": 704.4, "end": 709.92, "text": "and the acceleration angle using the Euler formula and finally applying the complementary filter."}, {"start": 711.68, "end": 715.6, "text": "This is a real data graphic made with the NPU6050 values."}, {"start": 717.36, "end": 724.64, "text": "The yellow line is the real angle and as you can see it's way better having less errors than using just gyro or acceleration values."}, {"start": 726.0, "end": 728.4, "text": "That's why we are using the complementary filter."}, {"start": 730.08, "end": 736.0, "text": "Ok, now in the setup loop we write the minimum values to the motors and add a delay of 7 seconds"}, {"start": 736.0, "end": 738.88, "text": "to give us time to connect the power supply to the motors."}, {"start": 740.96, "end": 746.0, "text": "In the void loop, as we talked before, we measure the real elapsed time using the millis function."}, {"start": 748.16, "end": 752.88, "text": "We will use this elapsed time to calculate the speed in the derivative part of the PID."}, {"start": 752.88, "end": 762.48, "text": "Now we send the slave address to the IMU module which is 0x68 and send the first direction of the acceleration data."}, {"start": 764.88, "end": 771.12, "text": "Since each value for each axis is divided in two 8-bit registers, we ask for 6 registers."}, {"start": 772.64, "end": 780.24, "text": "Once we receive those 6 registers, we combine the high and low part of each in order to obtain the x, y and z accelerations."}, {"start": 780.24, "end": 792.16, "text": "Now, in order to convert these values to g's, we divide them by 16384 since this is the values that the module gives us for 1g accelerations."}, {"start": 794.32, "end": 797.76, "text": "Using this Euler formula, we obtain the acceleration angles."}, {"start": 797.76, "end": 807.52, "text": "Now, we ask for the gyro data and divide that value by 131 as the datasheet tells us in order to obtain degrees per second."}, {"start": 808.96, "end": 814.88, "text": "If we multiply these values by the elapsed time and sum the value each loop, we obtain the inclination angle."}, {"start": 816.64, "end": 823.52, "text": "Finally, we calculate the real total angle applying the complementary filter between the gyro angle and the acceleration angles."}, {"start": 823.52, "end": 827.4399999999999, "text": "Here we start the PID control."}, {"start": 828.72, "end": 833.04, "text": "Remember that we will use just one angle because this is a one axis test."}, {"start": 834.8, "end": 841.76, "text": "In this case, I've used the y axis because in the way I've placed the IMU module, that is the parallel axis with the metal bar."}, {"start": 841.76, "end": 846.3199999999999, "text": "First, we calculate the error as mentioned before."}, {"start": 847.52, "end": 850.48, "text": "We create the proportional value of the PID control."}, {"start": 852.0, "end": 860.24, "text": "Next, we create the integral value and finally the derivative values dividing the subtraction between the last error and the actual error by the elapsed time."}, {"start": 860.24, "end": 865.04, "text": "That will give us the speed in degrees per second."}, {"start": 867.28, "end": 871.12, "text": "Finally, the total PID output is the sum of these 3 parts."}, {"start": 872.8, "end": 881.6, "text": "Now we have to give a maximum and minimum range for the PID, since the motors could only accept values between 1000 and 2000 microseconds."}, {"start": 881.6, "end": 884.72, "text": "Now we apply that range here."}, {"start": 886.4, "end": 889.6800000000001, "text": "We calculate the throttle and write these values to each motor."}, {"start": 891.36, "end": 896.4, "text": "Remember that we have to add the PID output to one motor and subtract it to the other one."}, {"start": 898.24, "end": 899.12, "text": "We are done."}, {"start": 899.12, "end": 900.88, "text": "The PID control is ready."}, {"start": 902.48, "end": 905.6, "text": "The drone could now fly straight even if I push it around."}, {"start": 905.6, "end": 910.32, "text": "As you could see, the metal bar gets always horizontal."}, {"start": 912.0, "end": 917.84, "text": "If we change the desired angle when we calculate the error, we could stabilize the bar in any other angle."}, {"start": 919.6800000000001, "end": 925.6, "text": "This is not the perfect PID control, but fine tuning the constants, you could always obtain the best results."}, {"start": 927.52, "end": 932.4, "text": "In next videos, we will see how to adapt this code for our flight controller and for two axes."}, {"start": 932.4, "end": 938.4, "text": "Also, how to change the desired angle depending on the received values from the radio controller of the drone."}, {"start": 940.56, "end": 945.1999999999999, "text": "I hope that you learned how PID works for drones and also for any other system."}, {"start": 946.64, "end": 949.4399999999999, "text": "If you like this video, click the like button like crazy."}, {"start": 950.3199999999999, "end": 954.0799999999999, "text": "Also, share my videos with your friends because that will help my channel a lot."}, {"start": 955.76, "end": 960.64, "text": "Don't forget to subscribe and also consider helping my projects on my new Patreon page."}, {"start": 962.4, "end": 966.9599999999999, "text": "If you have any questions, just leave it in the comment section below or my Q&A page."}, {"start": 968.56, "end": 970.9599999999999, "text": "Thanks again and see you later guys!"}]}