{"video_id": "dV8rpGUoxns", "url": "https://www.youtube.com/watch?v=dV8rpGUoxns", "title": "dV8rpGUoxns", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 4.76, "text": "Hey everybody, Kenneth Russell here. I hope you're doing great today. Today I'm talking about cables,"}, {"start": 4.88, "end": 8.52, "text": "how to understand cables and their connectors. Check it out."}, {"start": 14.84, "end": 20.36, "text": "Well, if you're a musician or working in sound in any way, you're going to come across cables"}, {"start": 20.36, "end": 25.68, "text": "and all different types of cables. And sometimes it can be kind of daunting if you're just getting"}, {"start": 25.68, "end": 28.900000000000002, "text": "into it because there's all these different connectors. You don't know what they're called."}, {"start": 28.9, "end": 33.56, "text": "So let's talk about the connectors in the first half of this video. And then we're going to talk"}, {"start": 33.56, "end": 39.3, "text": "about the cable itself in the second half of the video. By the way, a huge shout out to Hosea Cables"}, {"start": 39.3, "end": 45.32, "text": "for sending me all these cables. And they're just awesome cables. I've been buying Hosea Cables for"}, {"start": 45.32, "end": 50.54, "text": "years. If you're looking to buy an instrument cable for your guitar or microphone or whatever kind of"}, {"start": 50.54, "end": 55.54, "text": "cable you're looking for, don't look any further than Hosea. They really are awesome cables. They"}, {"start": 55.54, "end": 60.8, "text": "have different levels, good, better, best, and they're all very good actually. So let's talk"}, {"start": 60.8, "end": 65.16, "text": "about connectors. The first connector I want to talk about is the quarter inch connector."}, {"start": 65.62, "end": 72.08, "text": "This would be also called an instrument cable or a guitar cable. Quarter inch, instrument,"}, {"start": 72.34, "end": 76.66, "text": "guitar cable. These are all synonymous with each other. So if someone says, hey, hand me that guitar"}, {"start": 76.66, "end": 80.24, "text": "cable or hand me that instrument cable. This is what they're talking about."}, {"start": 80.24, "end": 86.86, "text": "So the quarter inch cable just has two ends like this usually. And this is the male connector."}, {"start": 87.02, "end": 92.0, "text": "They're both male connectors. And we'll talk about that in a second. But they basically just one goes"}, {"start": 92.0, "end": 96.53999999999999, "text": "in your guitar, one goes in your pedal board or amp. There's a bunch of different applications for"}, {"start": 96.53999999999999, "end": 103.96, "text": "quarter inch cables. So this is what the quarter inch connector looks like. Now there is a male end and"}, {"start": 103.96, "end": 112.24, "text": "the female end to just about any cable really. And this is the male end. And I'll let you decide"}, {"start": 112.24, "end": 116.47999999999999, "text": "why it's called the male end. I'm not going to go into that, but let me see. Where was the"}, {"start": 116.47999999999999, "end": 123.47999999999999, "text": "other one I was looking at? Oh, and then this is the female end there. And it's just basically"}, {"start": 123.47999999999999, "end": 130.04, "text": "the male end goes into the female end. And so, you know, on your guitar, that's what this is going to be."}, {"start": 130.04, "end": 136.28, "text": "This is the female quarter inch connector or the jack. A lot of times people just say jack. If it's"}, {"start": 136.28, "end": 140.95999999999998, "text": "attached to something, it's usually called a jack. Then you just plug it in like that. So in theory,"}, {"start": 141.1, "end": 147.1, "text": "I could have the end of this cable could be a female connector and I could keep on connecting them"}, {"start": 147.1, "end": 152.85999999999999, "text": "and just making a big long chain. So this is the quarter inch connectors, the male and female"}, {"start": 152.85999999999999, "end": 159.54, "text": "quarter inch connectors. The next kind of cable is the XLR cable. And that is this right here."}, {"start": 159.54, "end": 168.12, "text": "Now, XLR technically is just the designation for the cable end itself. But usually when someone says"}, {"start": 168.12, "end": 176.82, "text": "XLR cable, they're meaning give me a microphone cable or an audio cable with these connectors at"}, {"start": 176.82, "end": 182.22, "text": "the end of it. So you can see here, this also has two ends to it. This is the female end because it's"}, {"start": 182.22, "end": 188.18, "text": "got three holes there. And this is the male end. It's got three stems there and they connect together."}, {"start": 188.18, "end": 194.96, "text": "And you can make audio cables like this. Microphone cables connect together and loop like that,"}, {"start": 195.08, "end": 198.9, "text": "which there's no purpose in that other than storing it maybe. But you can connect them,"}, {"start": 199.42000000000002, "end": 203.82, "text": "daisy chaining them. And then on the back of your speaker or whatever, it's going to have one of these"}, {"start": 203.82, "end": 209.5, "text": "ends that's going to plug into or your microphone. There's a lot of different uses for this on a mixing"}, {"start": 209.5, "end": 216.22, "text": "desk. Most of the inputs are going to be XLR. If it's a pro mixing desk, sometimes you'll have quarter"}, {"start": 216.22, "end": 222.18, "text": "inch on the mixing desk as well. Usually those are your main connectors. Also, XLR cables can be"}, {"start": 222.18, "end": 228.28, "text": "data cables used for DMX lights. And we'll talk about that in just a minute. Right now, we're going"}, {"start": 228.28, "end": 233.06, "text": "to talk about just the connectors themselves. The next connector that is not known as much on the lower"}, {"start": 233.06, "end": 240.42, "text": "end stuff, but a lot higher end pro audio gear has speak on connectors. And this is a speak on"}, {"start": 240.42, "end": 246.11999999999998, "text": "connector right there. And this is, I think these are both the male ends right here. Now you'll see"}, {"start": 246.11999999999998, "end": 253.67999999999998, "text": "sometimes that there'll be a female end. This is what the female end looks like. And they click in"}, {"start": 253.67999999999998, "end": 259.41999999999996, "text": "like that. Now the great thing about speak on connectors is they lock into place until you pull"}, {"start": 259.41999999999996, "end": 265.7, "text": "this back and you undo it. So basically they just go in like this, you twist them, it locks into place,"}, {"start": 265.7, "end": 272.36, "text": "and then you've got a very, very secure cable until you pull this back. So these are speak on connectors."}, {"start": 272.36, "end": 277.52, "text": "If you can use them for your speakers, these are great because you're not going to have anybody"}, {"start": 277.52, "end": 283.82, "text": "tripping over a cable and it unplugs. So if you're a DJ, maybe you're a mobile church setting up in a"}, {"start": 283.82, "end": 289.65999999999997, "text": "school where people are walking around a lot, it's not a permanent situation. If you have the choice for"}, {"start": 289.65999999999997, "end": 295.24, "text": "speak on, they're, they're very, very good. A lot of times too, you'll hear the word new tricks."}, {"start": 295.24, "end": 302.02, "text": "Someone will say, Hey, give me a new tricks cable or that new tricks connector. It actually isn't a"}, {"start": 302.02, "end": 306.78000000000003, "text": "new tricks cable or new tricks connector. New tricks is a brand name. So it's kind of like Kleenex."}, {"start": 307.16, "end": 310.96000000000004, "text": "So, you know, if someone says, give me a Kleenex, they really, they're just saying, give me a tissue,"}, {"start": 310.96000000000004, "end": 315.94, "text": "but Kleenex is synonymous with that. So sometimes if someone says, give me a new tricks connector,"}, {"start": 316.2, "end": 323.0, "text": "they really mean speak on. And a lot of times you'll have a quarter inch to speak on adapter used as"}, {"start": 323.0, "end": 329.28, "text": "well. If your speaker cabinet only has speak on connectors, but you only have quarter inch cables,"}, {"start": 329.28, "end": 334.74, "text": "the next kind of connector we're going to talk about is the RCA cable. Now this one has a lot"}, {"start": 334.74, "end": 340.36, "text": "of different applications that you will see, not just in pro audio, but in home audio as well."}, {"start": 340.36, "end": 346.2, "text": "And this is what the, the RCA connector looks like there. And you know, you'll see this a lot of times"}, {"start": 346.2, "end": 352.7, "text": "the back of like a stereo system. There's just a lot of applications. The, the consumer world has"}, {"start": 352.7, "end": 359.84, "text": "really embraced the RCA connector. But it's also has a lot of purposes in pro audio and in sound."}, {"start": 359.84, "end": 364.34, "text": "For example, a lot of times if you're doing anything stereo, if you're coming from a computer"}, {"start": 364.34, "end": 370.91999999999996, "text": "and you're hooking up into a mixing desk, a lot of times they'll have from your computer to a,"}, {"start": 371.0, "end": 373.94, "text": "like one cable coming out of that, which we'll talk about in a second."}, {"start": 373.94, "end": 379.54, "text": "And then it's making a Y connection to the mixing desk left and right. A lot of times the other end"}, {"start": 379.54, "end": 384.86, "text": "of these will say, we'll have like a red and a yellow. These are also used in video as well."}, {"start": 384.86, "end": 388.92, "text": "They're, they're pretty cool cable because they'll transmit a lot of different types of information,"}, {"start": 388.92, "end": 394.9, "text": "but this is the, the RCA connector right here. So the connector itself is called RCA."}, {"start": 394.9, "end": 402.42, "text": "The next connector is a 3.5 millimeter connector or a eighth inch sometimes is what it's called."}, {"start": 402.42, "end": 408.02000000000004, "text": "It actually 3.5 is, is more accurate, but let me open this up here. You're probably very familiar"}, {"start": 408.02000000000004, "end": 413.34000000000003, "text": "with this because this is the kind of connector that's going to be on your phone. So if you're,"}, {"start": 413.34000000000003, "end": 420.44, "text": "you're plugging this in from an iPod or an iPhone into something else, this is going to be the connector."}, {"start": 420.44, "end": 427.72, "text": "So that, that little jack that's on everybody's phone, that is a, a 3.5 millimeter jack. Now I'm going to"}, {"start": 427.72, "end": 432.92, "text": "actually grab my headphones here. This is actually the headphones to my phone right here. And you can"}, {"start": 432.92, "end": 439.72, "text": "see on this one, there's actually three white lines there. That's because this has a microphone hooked up"}, {"start": 439.72, "end": 444.76000000000005, "text": "into this. There's actually three different signals happening left, right, and then the microphone."}, {"start": 444.76000000000005, "end": 450.52000000000004, "text": "Usually though, in the, the pro audio world, you're going to see this connector right here, which is,"}, {"start": 450.52, "end": 457.4, "text": "it's got two lines here. This is a stereo connector, which means there's a left and a right. So this,"}, {"start": 457.4, "end": 462.52, "text": "this has a stereo connector. Now this is the same type of thing. You're going to see a male in like"}, {"start": 462.52, "end": 469.88, "text": "this and a female in. Also, before I move on too far, this is a quarter inch cable with a stereo"}, {"start": 470.68, "end": 475.96, "text": "connector there, a left and right. So this actually has two cables in here, two signals going through"}, {"start": 475.96, "end": 480.28, "text": "this cable as well. And we'll talk about that a little bit more in a second. The next cable we're"}, {"start": 480.28, "end": 487.56, "text": "going to talk about is MIDI. This is a MIDI cable here, and it's got two different ends like this"}, {"start": 487.56, "end": 495.24, "text": "that have five pins. They look similar to an XLR, but they have five pins. This is a data cable. It's"}, {"start": 495.24, "end": 504.44, "text": "going to transmit, uh, ones and zeros from a keyboard or an effects pedal, or there's a lot of applications."}, {"start": 504.44, "end": 512.04, "text": "This is definitely a pro audio cable here. So a lot of times in the back of, of, uh, of keyboards,"}, {"start": 512.04, "end": 517.56, "text": "you'll see MIDI. Um, a lot of times keyboards are kind of moving away from MIDI and they're going to USB."}, {"start": 518.36, "end": 523.8, "text": "So a lot of your older keyboards are going to see MIDI instead of the USB. If you're hooking it up"}, {"start": 523.8, "end": 528.44, "text": "like to a computer to record or something like that. So this is a MIDI cable and it produces or"}, {"start": 528.44, "end": 533.96, "text": "transmits data. So now that we've talked about the different types of connectors in cables, let's talk"}, {"start": 533.96, "end": 539.8000000000001, "text": "about the cable itself. So for example, let me compare a few different cables that I might have."}, {"start": 539.8000000000001, "end": 548.2, "text": "This is a guitar cable and this is a speaker cable. Both of these have quarter inch jacks here,"}, {"start": 548.2, "end": 554.2, "text": "but they're made for two different reasons. Obviously this guitar cable, this generally when someone says"}, {"start": 554.2, "end": 559.5600000000001, "text": "quarter inch cable, they're talking about an instrument cable. They're talking about this. This is for"}, {"start": 559.56, "end": 567.88, "text": "instrument purposes, but this thicker cable here is for speaker purposes. Now here's the thing with this."}, {"start": 567.88, "end": 573.4, "text": "Sometimes you can take a instrument cable and hook it up to a speaker and it'll work, but"}, {"start": 574.1999999999999, "end": 579.56, "text": "instrument cables are not made for speakers. Instrument cables are not rated. They're not made for"}, {"start": 580.3599999999999, "end": 586.28, "text": "sending loud to a loud speaker spending, sending the audio to a loud speaker. So even though sometimes if"}, {"start": 586.28, "end": 592.8399999999999, "text": "you hook up this cable to a speaker, it'll work, it's not going to be as good as audio and I think"}, {"start": 592.8399999999999, "end": 597.8, "text": "that you might be able to damage your equipment if it's kept on for a long, long time. If you're just"}, {"start": 597.8, "end": 603.3199999999999, "text": "testing something out, it'll be just fine. But if you're carrying a load on this, this cable is"}, {"start": 603.3199999999999, "end": 607.8, "text": "probably going to get kind of hot and I just wouldn't do it. Now the other way around, if you take a"}, {"start": 607.8, "end": 613.4, "text": "speaker cable and try to use this for guitar, it's not going to do anything bad and it's not going to do"}, {"start": 613.4, "end": 618.52, "text": "anything good either. It's not going to be able to transfer the signal. It literally just won't go"}, {"start": 618.52, "end": 624.52, "text": "through. So anyway, sometimes you'll see these two different connectors used for two different"}, {"start": 624.52, "end": 633.24, "text": "purposes. So how do you know if it's a connector or not? Like this one here, this one looks just like"}, {"start": 633.24, "end": 639.0799999999999, "text": "an instrument cable, but it's not. It's a speaker cable. So how do you know on the cable itself,"}, {"start": 639.08, "end": 644.2800000000001, "text": "see if you can read that there. It'll say speaker cable. And this one says speaker gauge,"}, {"start": 645.0, "end": 651.0, "text": "speaker cable, 16 gauge. And so on these, on the instrument cable, it's going to say"}, {"start": 651.5600000000001, "end": 656.76, "text": "either instrument or guitar cable. I don't know if you can see that there or not, but it'll say"}, {"start": 656.76, "end": 663.08, "text": "guitar cable on there. So, or instrument cable. So that's how you know. So whenever you, you,"}, {"start": 663.08, "end": 668.5200000000001, "text": "if you have a lot of cables, you might want to just label them. That's what I do. A lot of times,"}, {"start": 668.52, "end": 675.0, "text": "I'll just put a piece of tape on the end of it and I'll just put GTR or SPK or something like that."}, {"start": 675.0, "end": 681.48, "text": "So I know if that's a speaker cable or if it is in fact a instrument cable. The next kind of connector"}, {"start": 681.48, "end": 691.4, "text": "is XLR. And these three can all be used for speaker. You can use a, a, a speak on XLR or quarter inch"}, {"start": 691.4, "end": 696.4399999999999, "text": "cable. And here's the thing. There's really not much of a difference between these cables. If you're"}, {"start": 696.44, "end": 700.6800000000001, "text": "hooking them up to a speaker, you're pretty much going to get the same audio. Matter of fact,"}, {"start": 700.6800000000001, "end": 707.96, "text": "a speak on cable and a quarter inch cable, these are the same cables with just different connectors"}, {"start": 707.96, "end": 714.6, "text": "at the end. Now the XLR cable is a balanced cable, but it's not really going to make a difference in"}, {"start": 714.6, "end": 718.6800000000001, "text": "the sound that you have. If you have a buzz in your system, perhaps you might want to try to use"}, {"start": 718.6800000000001, "end": 724.2, "text": "an XLR instead of another cable. But generally speaking, XLR, quarter inch, speak on,"}, {"start": 724.2, "end": 728.84, "text": "they're all going to work really well for speakers, but they're three different connectors."}, {"start": 728.84, "end": 735.1600000000001, "text": "Just depending on the manufacturer, they may want to use only quarter inch or only XLR or only speak on."}, {"start": 735.1600000000001, "end": 742.0400000000001, "text": "A lot of, a lot of backs of speaker cabinets have all three of them on it. So just it's the same basic"}, {"start": 742.0400000000001, "end": 749.96, "text": "thing. People ask sometimes, are you going to get a lesser quality audio if you use a adapter,"}, {"start": 749.96, "end": 755.0, "text": "like one of these going from a quarter inch to the speak on? No, you're not. All that the speak on is"}, {"start": 755.0, "end": 761.48, "text": "doing is just making that really secure connection. Now over time, probably it's going to wear better,"}, {"start": 761.48, "end": 765.88, "text": "the speak on connector is, than a quarter inch connector, but it's going to give you the same"}, {"start": 765.88, "end": 769.72, "text": "sound. Same thing with if you're converting anything. If you're, if you're having like,"}, {"start": 770.6800000000001, "end": 775.1600000000001, "text": "going from an eighth inch to a quarter inch, it's the same sound. It's just the connector"}, {"start": 775.9599999999999, "end": 781.0, "text": "transmitting the signal. If it's a quality connector, then it's going to have good sound coming to it."}, {"start": 781.0, "end": 789.88, "text": "Now let's talk about XLR cables, both data and audio cables. Okay. So if it's a longer XLR audio cable,"}, {"start": 789.88, "end": 794.12, "text": "usually it's going to be labeled like this one, it says microphone cable. Sometimes you'll see them"}, {"start": 794.12, "end": 800.36, "text": "where they're labeled, uh, just XLR or they'll just say audio cable. Let's see this one here."}, {"start": 800.36, "end": 809.08, "text": "This one just says balanced, uh, interconnected. This one is shorter. It says it's a five foot cable."}, {"start": 809.08, "end": 813.48, "text": "It's a, it's just says audio. And the reason why that is, is because a five foot cable is not going"}, {"start": 813.48, "end": 817.48, "text": "to be very good for a microphone because you can't hold it for very long. You can't even stand and sing"}, {"start": 817.48, "end": 825.24, "text": "with it. So XLR cables are the connectors, but one is data and one is microphone. What does that mean?"}, {"start": 825.24, "end": 830.84, "text": "These have different homages. Basically they're going to produce different frequencies. And so"}, {"start": 831.48, "end": 837.72, "text": "they're going to transmit frequencies better for the different applications. So a lot of times you can"}, {"start": 837.72, "end": 845.8, "text": "actually take a XLR microphone cable and plug it into a DMX light, which is going to be a, it's"}, {"start": 845.8, "end": 853.88, "text": "transmitting data, uh, ones and zeros digital signal, and it'll actually transmit it, but it won't do it"}, {"start": 853.88, "end": 860.6, "text": "well, and it's going to have some interference and it's not going to be as reliable as a DMX cable."}, {"start": 860.6, "end": 868.2, "text": "Basically the DMX cable is better at transmitting the digital information. So unless you're just in"}, {"start": 868.2, "end": 875.16, "text": "an absolute pinch, use a data cable to transmit DMX signals and don't use a microphone cable."}, {"start": 875.16, "end": 881.8, "text": "Here's the thing, data cables, the DMX cable will not go the other way around. You cannot use a DMX cable"}, {"start": 881.8, "end": 887.88, "text": "for a microphone or any sort of audio. It just simply is incapable of transmitting that information."}, {"start": 887.88, "end": 894.28, "text": "It's not made for that. It's a digital cable. It's not an analog cable for those purposes. So you can try"}, {"start": 894.28, "end": 899.64, "text": "to hook it up. It's just, you're never going to get sound out of it. It does, you can use the, the, the"}, {"start": 899.64, "end": 904.52, "text": "microphone cable for digital, even though it's not recommended, but it will not go the other way around."}, {"start": 904.52, "end": 910.28, "text": "So therefore what I do is I always label my DMX cables. I just put a piece of tape on it and I"}, {"start": 910.28, "end": 915.3199999999999, "text": "write DMX on it just so that there's no way in the pinch. You know, the thing is whenever you need a"}, {"start": 915.3199999999999, "end": 919.88, "text": "new cable, you don't always have a lot of time. So you're just like grabbing a cable and you're trying"}, {"start": 919.88, "end": 925.56, "text": "to hook it up. So I always make sure that it's super, super obvious of DMX cables so that I don't"}, {"start": 925.56, "end": 931.16, "text": "accidentally grab the wrong one. Now, if you ever have any questions with it, it'll say on here, let's see,"}, {"start": 931.16, "end": 941.16, "text": "this one says DMX cable, 24 gauge, 120 ohm. If you look here, let me see if it'll focus on that."}, {"start": 943.56, "end": 950.76, "text": "So it'll say DMX cable on the cable itself and on a microphone cable. It will either have nothing,"}, {"start": 950.76, "end": 957.0, "text": "which is usually they have it now though, because DMX is so popular or it'll say a microphone cable,"}, {"start": 957.0, "end": 962.6, "text": "or it might even say audio cable or instrument cable. But usually it says microphone if it is a"}, {"start": 962.6, "end": 967.4, "text": "microphone cable. So you want to make sure that it does say audio or microphone on the XLR if you're"}, {"start": 967.4, "end": 972.92, "text": "using it for an audio purpose. So with cables, as you can see, it's actually not super complicated."}, {"start": 972.92, "end": 977.24, "text": "There's only really a handful of connectors. There's more connectors out there, but these are the ones"}, {"start": 977.24, "end": 982.6, "text": "that you're going to encounter most. If you're working in sound or you're working in as a musician,"}, {"start": 982.6, "end": 987.32, "text": "you're going to see these connectors all the time. It's important that as a musician, you're familiar"}, {"start": 987.32, "end": 991.88, "text": "with these because it's kind of the language that everyone is speaking. This is the information that"}, {"start": 991.88, "end": 997.0, "text": "you're going to need to know as a musician. And so hopefully this was helpful to you. If it was,"}, {"start": 997.0, "end": 1001.24, "text": "please hit the thumbs up button, subscribe to my YouTube channel. If you didn't like this video,"}, {"start": 1001.24, "end": 1005.48, "text": "just go ahead and hit the thumbs down button. I won't be offended. I am kind of surprised you stuck"}, {"start": 1005.48, "end": 1009.96, "text": "around this long just to hit the thumbs down. But if you did, it's all good. Okay."}, {"start": 1009.96, "end": 1016.0400000000001, "text": "I make videos that help make musicians better musicians. So hopefully this helped you."}, {"start": 1016.0400000000001, "end": 1019.32, "text": "Anyway, Kinnis Russell out and I'll see you in another video."}]}