{"video_id": "U5cqrrhq9TA", "url": "https://www.youtube.com/watch?v=U5cqrrhq9TA", "title": "U5cqrrhq9TA", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 10.56, "text": "This heat gun is pure perfection while this LED strip is straight up garbage."}, {"start": 10.56, "end": 17.88, "text": "Wait, what? The reason why I am saying this is because when looking at the current consumption"}, {"start": 17.88, "end": 24.54, "text": "of those two loads we can see a remarkable difference. First off the heat gun which draws"}, {"start": 24.54, "end": 31.299999999999997, "text": "current exactly in phase with our mains voltage and its shape also almost looks like it aka"}, {"start": 31.299999999999997, "end": 39.84, "text": "sinusoidal. Lovely. But next we got the terrible LED strip which draws current abruptly and"}, {"start": 39.84, "end": 45.04, "text": "only for a short amount of time near the peak of our mains voltage."}, {"start": 45.04, "end": 52.3, "text": "Okay so what is the problem here? I mean both devices seem to work perfectly fine."}, {"start": 52.3, "end": 58.879999999999995, "text": "Well the problem is that the LED strip with its AC to DC power supply draws a lot of apparent"}, {"start": 58.879999999999995, "end": 65.72, "text": "power from the power grid because of the weird current waveform while the real power it actually"}, {"start": 65.72, "end": 71.97999999999999, "text": "requires to do its job of lighting up LEDs is rather small in comparison."}, {"start": 71.97999999999999, "end": 78.8, "text": "That is a huge problem because nowadays we got tons of AC to DC power supplies in our homes"}, {"start": 78.8, "end": 83.94, "text": "and if they would all perform this bad then our power grids will have to face some big"}, {"start": 83.94, "end": 90.5, "text": "challenges in the future. But it doesn't have to be this way and that is why such power factor"}, {"start": 90.5, "end": 98.24, "text": "correction circuits or PFC for short do exist. And in this video I will show you what they can do,"}, {"start": 98.24, "end": 105.67999999999999, "text": "how we can make them and why they are super important for our electrical future. Let's get started!"}, {"start": 108.8, "end": 120.08, "text": "This video is sponsored by Mauser Electronics who not only offer a huge selection of electronics"}, {"start": 120.08, "end": 127.12, "text": "components but also development boards. And I am not talking about microcontroller boards or similar"}, {"start": 127.12, "end": 134.4, "text": "even though they also have them. No, I am talking about development boards built around the newest ICs"}, {"start": 134.4, "end": 142.88, "text": "and technologies which also includes functional PFCs that you will see later. If you are curious for more"}, {"start": 142.88, "end": 147.6, "text": "then head over to Mauser Electronics or check the link in the video description."}, {"start": 149.28, "end": 157.6, "text": "Now let's start off with a popular analogy which is the foam to drink ratio. You see the liquid alone"}, {"start": 157.6, "end": 165.28, "text": "represents our real power aka the power that actually gets used to light things up, heat things up or"}, {"start": 165.28, "end": 172.4, "text": "for example charge your phone's battery. But as you can see that is not all in our glass which in total"}, {"start": 172.4, "end": 179.28, "text": "represents our apparent power and that is the power your energy provider actually has to deal with in its grid"}, {"start": 179.28, "end": 187.28, "text": "so that you can get your desired real power. No, we still got the foam which is our reactive power"}, {"start": 187.92000000000002, "end": 195.84, "text": "and truth be told completely useless because it only oscillates between the energy provider and hooked up loads."}, {"start": 196.88, "end": 201.92000000000002, "text": "Due to it more current flows through the grid than what we actually need for the real power demand"}, {"start": 201.92, "end": 209.6, "text": "and as you might know for bigger current flow we need thicker wires so that things do not get terribly"}, {"start": 209.6, "end": 217.92, "text": "inefficient and hot and that of course costs lots of money. So keeping the reactive power close to zero"}, {"start": 217.92, "end": 225.76, "text": "is our goal here meaning that apparent power should equal the real power. And in the heat gun example we"}, {"start": 225.76, "end": 232.95999999999998, "text": "started with we can actually see such a behaviour that real power equals apparent power meaning it is"}, {"start": 232.95999999999998, "end": 238.79999999999998, "text": "definitely possible. Which brings us to the question how such reactive power comes to be."}, {"start": 240.0, "end": 246.32, "text": "The most popular examples for that are simply a motor and a capacitive power supply that you can"}, {"start": 246.32, "end": 254.07999999999998, "text": "sometimes find in LED lights. Both of them create quite a bit of reactive power in comparison to their real power"}, {"start": 254.08, "end": 260.64, "text": "power and the root of all evil for that is like I teased at the beginning their current flow."}, {"start": 261.6, "end": 268.64, "text": "The power supply ones leads in comparison to the mains voltage and the one from the motor lacks in comparison."}, {"start": 269.52000000000004, "end": 274.64, "text": "The reason for that are of course the electrical properties of the capacitor for the power supply"}, {"start": 275.2, "end": 282.16, "text": "and the inductance for the motor coils. But feel free to watch my previous videos about those topics here"}, {"start": 282.16, "end": 289.12, "text": "so that I can keep the rest of this video short and sweet. Because in a nutshell such phase shifts"}, {"start": 289.12, "end": 296.48, "text": "do create reactive power. And the simple fix here is to add inductance to the capacitance and vice versa"}, {"start": 296.48, "end": 303.68, "text": "capacitance to the inductance to get rid of the phase shifts and thus reduce the reactive power"}, {"start": 303.68, "end": 311.44000000000005, "text": "and get a power factor of almost 1. By the way the power factor is simply the real power divided by the"}, {"start": 311.44, "end": 318.4, "text": "apparent power and thus 1 means real power equals apparent power which is what we are after."}, {"start": 319.44, "end": 325.76, "text": "Now like I said one solution is adding capacitance or inductance to the power grid to decrease the"}, {"start": 325.76, "end": 333.52, "text": "phase shifts and that is actually the first type of a power factor correction circuit and it is called a"}, {"start": 333.52, "end": 340.56, "text": "passive one. Of course there is also an active one that I already presented to you at the start."}, {"start": 341.44, "end": 347.92, "text": "And to understand why we need it let's go back to the current draw of a common power supply I found in my shelf."}, {"start": 348.96, "end": 355.44, "text": "As you can see the more DC current I draw from its output the bigger the current pulse on the input"}, {"start": 355.44, "end": 362.64, "text": "near the peak of the mains voltage gets. And by doing my usual measurements next we can see that this"}, {"start": 362.64, "end": 369.76, "text": "current draw creates kind of a lot of reactive power which is easily noticeable through the low power factor."}, {"start": 370.64, "end": 378.48, "text": "But there is no phase shift so how does that work? Well the problem here is that this current waveform"}, {"start": 378.48, "end": 383.2, "text": "can be depicted as a sum of lots of current waveforms with different frequencies."}, {"start": 384.24, "end": 391.92, "text": "Most importantly of course is the 50Hz fundamental frequency which is our mains voltage frequency and"}, {"start": 391.92, "end": 402.64000000000004, "text": "it obviously does not feature a phase shift. But then there are also 150Hz, 250Hz, 350Hz and so on parts"}, {"start": 403.2, "end": 410.8, "text": "which are called 3rd, 5th, 7th and so on current harmonics and they do kind of feature a phase shift"}, {"start": 410.8, "end": 418.16, "text": "that creates the reactive power. By using my oscilloscope we can actually see how much they matter in comparison"}, {"start": 418.16, "end": 425.28000000000003, "text": "to the fundamental 50Hz frequency and let's just say that they are pretty dominant on the screen here."}, {"start": 426.32000000000005, "end": 433.36, "text": "So what we can do to fix this problem is basically convert this small current pulse to an even sinusoidal"}, {"start": 433.36, "end": 441.68, "text": "one. And like I said before a circuit that can do that is an active PFC for which I looked for on Mauser"}, {"start": 441.68, "end": 448.88, "text": "electronics and I found a promising looking IC that only requires a few external components to function."}, {"start": 449.92, "end": 456.72, "text": "But before creating a whole PCB for it which requires lots of time I firstly wanted to do some"}, {"start": 456.72, "end": 462.64, "text": "initial tests with a similar IC for which Mauser luckily offered a development board."}, {"start": 462.64, "end": 469.76, "text": "After powering its low voltage side with my lab bench power supply I next prepared a proper mains"}, {"start": 469.76, "end": 476.56, "text": "voltage wire for it and this break might be a good opportunity to state that working with all the"}, {"start": 476.56, "end": 483.59999999999997, "text": "mains voltage shown in this video can be dangerous and you should only do that if you are professional."}, {"start": 484.64, "end": 491.68, "text": "Okay with that out of the way I plugged the circuit into mains voltage and was very happy to find out"}, {"start": 491.68, "end": 500.8, "text": "that nothing exploded. On its output I measured a voltage of around 400VDC which means the circuit works correctly."}, {"start": 501.92, "end": 507.52, "text": "And before I start explaining here why this high voltage and how it is made and what not,"}, {"start": 508.16, "end": 514.5600000000001, "text": "let's rather keep it practical and crack open the power supply that came with the horrible current draw."}, {"start": 515.6, "end": 521.36, "text": "After removing its full bridge rectifier, I simply connected the output of the PFC"}, {"start": 521.36, "end": 528.88, "text": "to the input of the power supply and by once again plugging in mains voltage nothing blew up and the"}, {"start": 528.88, "end": 535.76, "text": "power supply seems to work correctly as well. This time though the input current does follow the mains"}, {"start": 535.76, "end": 542.72, "text": "voltage shape a lot more when drawing more current on the outputs. That not only means that the current"}, {"start": 542.72, "end": 549.9200000000001, "text": "harmonics are mostly gone but also that the reactive power of the system decreased while the power factor"}, {"start": 549.92, "end": 558.0, "text": "increased. Awesome! I think you can see the difference with and without a PFC pretty clearly in this chart here."}, {"start": 558.7199999999999, "end": 563.04, "text": "Which now brings us to the question how such an active PFC pulls this off?"}, {"start": 564.16, "end": 570.7199999999999, "text": "Well in a nutshell it does so by increasing the changing mains input voltage into a constant higher"}, {"start": 570.72, "end": 579.52, "text": "DC voltage voltage that the power supply then uses. Because yes, an active PFC is basically just a glorified"}, {"start": 579.52, "end": 587.52, "text": "boost converter. You see the problem of normal AC to DC power supplies is that they only draw current near"}, {"start": 587.52, "end": 594.0, "text": "the voltage peak of the mains voltage because that is when the utilized capacitor's voltage drops beneath"}, {"start": 594.0, "end": 602.32, "text": "the input voltage and thus can get charged up again. But by supplying a constant boosted voltage this problem"}, {"start": 602.32, "end": 609.92, "text": "basically disappears. Of course creating such a stable boosted DC voltage from a varying input voltage"}, {"start": 609.92, "end": 617.2, "text": "is not that easy because you need to monitor the input and output voltage as well as the flowing current"}, {"start": 617.2, "end": 623.9200000000001, "text": "current and then turn on or off the boost converter MOSFET switch accordingly so that always the right"}, {"start": 623.9200000000001, "end": 631.5200000000001, "text": "amount of energy gets transferred to the output. When having a look at our practical example then the MOSFET"}, {"start": 631.5200000000001, "end": 638.5600000000001, "text": "switching pattern looks something like this with a bigger duty cycle at low input voltages and a smaller"}, {"start": 638.5600000000001, "end": 647.12, "text": "duty cycle at higher input voltages which corresponds with the theory. So all in all such active PFC"}, {"start": 647.12, "end": 654.88, "text": "are pretty awesome. And considering that there are already regulations in place that limit the created current"}, {"start": 654.88, "end": 662.96, "text": "harmonics from appliances they will sooner or later become mandatory. So if you are shopping for a new beefy power supply"}, {"start": 663.6, "end": 671.2, "text": "maybe next time consider getting one with a built in PFC. With that being said I hope you enjoyed this video"}, {"start": 671.2, "end": 678.88, "text": "and learn something new. As always don't forget to like, share, subscribe and hit the notification bell."}, {"start": 679.9200000000001, "end": 684.88, "text": "Stay creative and I will see you next time!"}]}