{"video_id": "WoHjWZFTnpQ", "url": "https://www.youtube.com/watch?v=WoHjWZFTnpQ", "title": "WoHjWZFTnpQ", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 5.5200000000000005, "text": "Hey everybody, this is Tristan from Easy Drone, and in today's tutorial, I'm going to be teaching you guys how to fly an FPV drone."}, {"start": 5.96, "end": 12.02, "text": "From everything from the different modes, to how the modes work, from what the sticks do, to flying the drone. So, let's dive in."}, {"start": 12.36, "end": 16.56, "text": "Alright, so the first thing that we need to learn is how our sticks actually work."}, {"start": 16.62, "end": 22.98, "text": "So, on the left-hand side right here, we have a stick that centers in the middle, but it'll stay wherever you put it."}, {"start": 23.04, "end": 24.96, "text": "And that's our throttle and yaw stick."}, {"start": 24.96, "end": 30.42, "text": "So, the throttle will make the drone go up and down, and then the yaw will make the drone spin side to side like this."}, {"start": 30.82, "end": 33.94, "text": "On the other side of our controller, we have our pitch and roll stick."}, {"start": 34.32, "end": 38.06, "text": "Now, this one centers to the middle every time, so if you let go of it, it'll always go to the middle."}, {"start": 38.56, "end": 42.16, "text": "And with this right-hand stick, if we tilt it forwards, the drone will tilt forwards."}, {"start": 42.82, "end": 44.2, "text": "Backwards, it'll tilt backwards."}, {"start": 44.84, "end": 47.019999999999996, "text": "If we tilt it to the right, the drone will also tilt to the right."}, {"start": 47.14, "end": 49.74, "text": "Same thing with left, any sort of diagonal turn."}, {"start": 50.06, "end": 52.92, "text": "Wherever you move this stick, the drone will also tilt in that direction."}, {"start": 52.92, "end": 54.68, "text": "So, again, a quick little overview."}, {"start": 54.84, "end": 57.34, "text": "We have throttle, yaw, that's spinning side to side."}, {"start": 57.68, "end": 59.160000000000004, "text": "And then we have tilt stick."}, {"start": 59.24, "end": 60.92, "text": "This is our pitch stick going up and down."}, {"start": 61.44, "end": 65.82000000000001, "text": "And then this is going to be our tilt stick, our roll stick going left to right."}, {"start": 66.0, "end": 70.7, "text": "So, now that we've went over what the sticks on our controller do, let's talk about flight modes."}, {"start": 71.1, "end": 72.5, "text": "So, there's three main flight modes."}, {"start": 72.68, "end": 75.22, "text": "There is horizon mode, angle mode, and acro mode."}, {"start": 75.62, "end": 76.64, "text": "Now, horizon mode sucks."}, {"start": 76.74000000000001, "end": 77.46000000000001, "text": "It's hard to master."}, {"start": 77.6, "end": 78.48, "text": "No one ever does it."}, {"start": 78.58, "end": 79.7, "text": "And it's inconsistent."}, {"start": 79.88, "end": 81.26, "text": "So, I'm not even going to talk about it today."}, {"start": 81.26, "end": 85.88000000000001, "text": "If you want to learn about it, I did put information about it on my article, which is linked down below."}, {"start": 86.42, "end": 87.62, "text": "So, angle and acro mode."}, {"start": 88.34, "end": 90.68, "text": "Angle mode is the easiest for people to learn."}, {"start": 90.80000000000001, "end": 93.06, "text": "I always start people off by teaching them angle mode."}, {"start": 93.34, "end": 95.54, "text": "The throttle and the yaw are always the same."}, {"start": 95.66000000000001, "end": 100.10000000000001, "text": "So, our left stick here, our throttle and the yaw are always going to be the same, no matter if it's angle or acro mode."}, {"start": 100.18, "end": 103.78, "text": "So, what I'm going to be focusing on right now is our right stick, our pitch, and our roll."}, {"start": 104.26, "end": 109.08000000000001, "text": "When we pitch the drone forwards in angle mode, it's only limited to a certain height."}, {"start": 109.08, "end": 114.88, "text": "And wherever you put the stick, if I have the stick right here, I put it halfway forwards."}, {"start": 115.0, "end": 117.8, "text": "The drone is going to tilt halfway of its range limit."}, {"start": 118.12, "end": 120.66, "text": "And if I push it all the way forwards, it's going to tilt all the way forwards."}, {"start": 121.0, "end": 128.94, "text": "So, if this drone can only tilt 30 degrees in any given direction, and if I push my stick halfway to the top, the drone is going to tilt 15 degrees."}, {"start": 128.94, "end": 131.4, "text": "And if I push it all the way, it's going to tilt 30 degrees."}, {"start": 132.26, "end": 133.48, "text": "So, the stick's always in the middle."}, {"start": 133.56, "end": 136.52, "text": "So, if I pull it down halfway, the drone would tilt back 15 degrees."}, {"start": 136.85999999999999, "end": 139.07999999999998, "text": "Back all the way, and it would tilt back 30 degrees."}, {"start": 139.28, "end": 142.42, "text": "When I release the stick, the drone would just snap back to level."}, {"start": 142.7, "end": 143.94, "text": "And that's how angle mode works."}, {"start": 144.02, "end": 149.78, "text": "It's always actively trying to level out the drone or put it at the exact angle corresponding to where your stick is at."}, {"start": 150.12, "end": 151.68, "text": "Now, acro mode is a little different."}, {"start": 151.68, "end": 163.04000000000002, "text": "Instead of correlating the position of your stick with the angle of the drone, acro mode correlates the position of your stick with the speed to rotate the drone at, in that direction that your stick is in."}, {"start": 163.52, "end": 171.58, "text": "So, if I push my stick all the way forwards, the drone is going to rotate forwards really fast and keep flipping forwards until I release my stick."}, {"start": 172.66, "end": 178.84, "text": "If I push my stick halfway forwards, the drone is going to start rotating forwards at half that speed."}, {"start": 178.84, "end": 184.64000000000001, "text": "And again, it's not locked to a constant angle, so it's just going to be a constant rotation."}, {"start": 185.70000000000002, "end": 190.94, "text": "In acro mode as well, whenever you release that stick, the drone does not snap back to level like it does in angle mode."}, {"start": 191.12, "end": 193.9, "text": "It will continue on in whatever position you left it in."}, {"start": 194.46, "end": 202.68, "text": "So, if I used my roll stick and I rolled my drone sideways, and then I just let go of my stick, my drone would stay like this."}, {"start": 202.72, "end": 206.56, "text": "I'd have to actively roll to the left to get my drone back to level."}, {"start": 206.56, "end": 213.96, "text": "Now that you understand the basics of angle mode, the drone will always stay within a certain angle limit, and the angle corresponds to how far you're pushing the stick."}, {"start": 214.46, "end": 223.42000000000002, "text": "And acro mode, where there isn't a max range the drone can go, it can go wherever, and the speed at which it turns is defined by how fast you push the stick."}, {"start": 223.92000000000002, "end": 229.18, "text": "Let's dive in on how to actually fly your drone in the air, because there are some differences between the two modes."}, {"start": 229.18, "end": 234.96, "text": "And I have a system that I like to teach new pilots with that will make your first flight be really easy."}, {"start": 235.36, "end": 238.14000000000001, "text": "Alright, so first off, we're going to start in angle mode."}, {"start": 238.44, "end": 239.82, "text": "Switch my drone into angle mode."}, {"start": 240.32, "end": 244.58, "text": "And when you're starting out FPV, throttle control is the most important thing to learn."}, {"start": 245.08, "end": 251.12, "text": "So we're going to arm our drone, and I don't recommend doing this actually out with your real FPV drone for the first time."}, {"start": 251.48000000000002, "end": 256.44, "text": "Always start learning FPV in a simulator, but I enjoy it more outside, so I'm going to teach you guys from outside."}, {"start": 256.76, "end": 258.52, "text": "First step is just to hover your drone."}, {"start": 258.52, "end": 260.34, "text": "You want to practice your throttle control."}, {"start": 261.09999999999997, "end": 265.91999999999996, "text": "Beginners tend to go up and down a lot, and this is, uh, it's really hard to land or bring your drone safely."}, {"start": 266.52, "end": 269.21999999999997, "text": "Take it out a little ways so I can actually hear myself talk."}, {"start": 269.34, "end": 272.59999999999997, "text": "So we're just going to practice staying at about the same height and hovering in the same spot."}, {"start": 272.97999999999996, "end": 279.68, "text": "And you notice I'm drifting to the right a little bit, so you're going to have to correct yourself by pushing a little bit to the left until we just stop and stay in the same position."}, {"start": 280.32, "end": 282.47999999999996, "text": "And I want to get a really nice constant hover."}, {"start": 282.47999999999996, "end": 288.34, "text": "You're going to have to adjust your throttle a bit up and down to try to keep your drone really, really, really still."}, {"start": 288.52, "end": 292.34, "text": "And with beginners, throttle control doesn't come naturally."}, {"start": 292.34, "end": 298.2, "text": "They just want to put the stick at a certain spot, and they're going to end up going up, going down, and kind of bouncing back and forth and bunny hopping."}, {"start": 299.2, "end": 302.84, "text": "So throttle control is really important for FPV drones, so that's why we're learning it first."}, {"start": 302.84, "end": 315.2, "text": "So once you've learned how to hover really good, just using your throttle up and down and using your right pitch and roll stick to kind of stay in the same exact spot, the next step is going to be using our pitch and roll stick to move around."}, {"start": 315.34, "end": 321.59999999999997, "text": "Not using our yaw side to side, but we're going to be using our pitch and our roll sticks here."}, {"start": 321.73999999999995, "end": 322.84, "text": "And we're going to have to use throttle."}, {"start": 323.5, "end": 327.65999999999997, "text": "We're going to have to use our throttle skills that we just learned to keep our drone in the air."}, {"start": 327.66, "end": 334.54, "text": "Because when you pitch to the side, your force is going to the side and not down directly, so you're going to have to use a little more throttle when you're going to the side."}, {"start": 335.02000000000004, "end": 348.16, "text": "Make sure you're in a big open field for that, and just kind of get the hang of flying forwards a bit, flying backwards, flying to the side, and keeping your drone not too high in the air and not crashing in the ground."}, {"start": 348.16, "end": 358.12, "text": "When you can pitch to the back, you can fly forwards, and you can fly side to side without losing too much altitude."}, {"start": 358.56, "end": 361.78000000000003, "text": "The next step we're going to do is incorporate our yaw."}, {"start": 362.02000000000004, "end": 364.58000000000004, "text": "So our yaw will actually spin it if I move it to the left here."}, {"start": 364.86, "end": 365.78000000000003, "text": "It'll spin our drone."}, {"start": 366.14000000000004, "end": 368.72, "text": "And we can use our yaw to make nice smooth turns."}, {"start": 368.72, "end": 380.02000000000004, "text": "So if I push my pitch stick forwards here and fly my drone forwards, I can now yaw to the side, and my drone will now be pointing in this new direction and flying in that new direction."}, {"start": 380.46000000000004, "end": 383.20000000000005, "text": "And that's how you do a turn with FPV in angle mode."}, {"start": 383.5, "end": 386.84000000000003, "text": "So with angle mode, you're going to want to bank a little as well."}, {"start": 386.96000000000004, "end": 393.34000000000003, "text": "So when we turn with our yaw, we're going to want to push our roll stick that way slightly as well."}, {"start": 393.34, "end": 396.61999999999995, "text": "And this is just the same as your average motorcycle track."}, {"start": 396.71999999999997, "end": 404.88, "text": "If you do dirt biking or motorcycles, to get a really good turn without blowing out on the track, you need to bank into it a little bit."}, {"start": 404.94, "end": 407.34, "text": "So we're going to bank and yaw at the same time."}, {"start": 409.85999999999996, "end": 412.05999999999995, "text": "In angle mode, though, you don't have to bank if you want."}, {"start": 412.14, "end": 414.91999999999996, "text": "You can just go straight forwards with your pitch stick and then yaw."}, {"start": 415.44, "end": 418.67999999999995, "text": "And your drone will turn around and start flying in the new direction."}, {"start": 418.68, "end": 423.76, "text": "So those are the three steps to learn how to fly your drone in angle mode."}, {"start": 424.08, "end": 425.08, "text": "You start off with the hover."}, {"start": 425.56, "end": 432.64, "text": "You get used to holding your drone at a good, nice altitude with your throttle and keeping it in that position with your pitch and your roll stick."}, {"start": 432.98, "end": 441.12, "text": "Next step is learning how to actually move your drone around with your pitch and your roll stick while keeping it off the ground and keeping it from going too high in the air with your throttle."}, {"start": 441.8, "end": 445.68, "text": "And the third step is just adding that yaw in there that spins your drone from left and right."}, {"start": 445.68, "end": 448.96, "text": "So when you're going, you can actually turn and seeing where you're going."}, {"start": 449.62, "end": 457.22, "text": "And with that yaw step, it's important to add a little bit of banking in there so that you don't cut your turns too wide and your drone goes in hitting into the trees."}, {"start": 457.3, "end": 460.36, "text": "Because I'm going at this height and I just turn, I'll just go sideways into the tree here."}, {"start": 461.46000000000004, "end": 464.26, "text": "So I'll show you guys how that actually helps me."}, {"start": 464.26, "end": 469.74, "text": "So if I'm going straight at the trees here, if I just yaw, I'll go into the trees a bit."}, {"start": 469.8, "end": 472.2, "text": "So I'm going to bank to the side and yaw."}, {"start": 472.82, "end": 478.4, "text": "And you'll see it stopped my momentum going forwards and perfectly transitioned me to going sideways."}, {"start": 479.26, "end": 481.78, "text": "So now I'm going to switch my drone into acro mode."}, {"start": 481.86, "end": 486.21999999999997, "text": "And like I mentioned before, the throttle and the yaw do not change when you're in acro mode."}, {"start": 486.22, "end": 493.48, "text": "So all you have to really focus about is the new steps from acro mode because it's not limited to a max angle with your right hand here."}, {"start": 493.58000000000004, "end": 498.98, "text": "So I'm going to take my drone off and I'm going to bring it super high in the air and just show you how acro mode works really quick."}, {"start": 499.54, "end": 501.86, "text": "Now that we're really high in the air, I'm going to show you how this works."}, {"start": 502.1, "end": 508.44000000000005, "text": "Now, like I mentioned before, the stick position in acro mode correlates to how fast your drone is spinning, not an angle."}, {"start": 508.44, "end": 511.82, "text": "So if I move my stick all the way to the right, I'm just going to keep spinning."}, {"start": 512.68, "end": 517.88, "text": "And if I move my drone just a little bit to the right, I'm going to keep spinning at a slower speed."}, {"start": 519.36, "end": 522.72, "text": "And whenever I let go of my stick, my drone stops at whatever position I left it at."}, {"start": 523.6, "end": 525.36, "text": "I'll take it up high again and show you guys that."}, {"start": 527.64, "end": 533.86, "text": "So if I want to tilt my drone forwards, I need to push it forwards and then let go once I get to the certain angle that I want to be flying at forwards."}, {"start": 534.64, "end": 538.28, "text": "Then to go back to level, I need to pull backwards on my stick to get my drone back to level."}, {"start": 539.0400000000001, "end": 541.36, "text": "The cool thing about acro mode is you can do flips."}, {"start": 541.46, "end": 545.46, "text": "So I can just drop my throttle, spin it all the way around, and let go."}, {"start": 545.58, "end": 546.5, "text": "And I do a perfect flip."}, {"start": 547.48, "end": 549.32, "text": "Now turning is a little bit different."}, {"start": 549.5200000000001, "end": 554.2800000000001, "text": "To turn in acro mode, if we just use our yaw stick, we're just going to look up in the sky."}, {"start": 554.36, "end": 556.36, "text": "And our drone is going to continue going in the same direction."}, {"start": 556.6600000000001, "end": 561.6, "text": "So we can't turn by just using our yaw in acro mode like we could in angle mode."}, {"start": 561.94, "end": 564.8800000000001, "text": "To turn in acro mode, we need to roll at the same time."}, {"start": 564.88, "end": 569.8, "text": "So if I yaw and roll at the same time, I'll get a nice smooth turn."}, {"start": 570.18, "end": 574.82, "text": "And depending on your camera angle, it depends on how much roll and how much yaw you need to use."}, {"start": 574.9, "end": 577.86, "text": "So you're just going to have to play around with it and find what's best for your camera angle."}, {"start": 578.1, "end": 585.12, "text": "But for most drones, you can get a pretty decent turn by using the same amount of roll as you do yaw and have a nice turn there."}, {"start": 585.12, "end": 592.76, "text": "So yeah, that is how you fly in acro mode."}, {"start": 592.98, "end": 595.3, "text": "It's a bit different and it takes a bit getting used to."}, {"start": 595.64, "end": 598.96, "text": "Most people can do it if they think about it really hard when they start out."}, {"start": 599.14, "end": 602.3, "text": "But as soon as they get into a sketchy situation, like they're going at a pole,"}, {"start": 602.5, "end": 606.18, "text": "they tend to make quick moves and end up losing control of the drone and like crashing."}, {"start": 606.18, "end": 611.5999999999999, "text": "So I'd advise people to learn it in angle mode, get a feel for how your drone works,"}, {"start": 611.7199999999999, "end": 612.9399999999999, "text": "and then switch to acro mode."}, {"start": 613.2399999999999, "end": 615.26, "text": "And then you can do cool stuff like this."}, {"start": 615.26, "end": 626.56, "text": "Make sure to hit the thumbs up and subscribe button if this helped you out."}, {"start": 626.74, "end": 630.66, "text": "And check out our posts that's linked below on the best FPV simulators you can get"}, {"start": 630.66, "end": 635.76, "text": "so that you can learn how to fly your FPV drone without crashing, breaking stuff, and wasting your money."}, {"start": 636.22, "end": 637.68, "text": "In FPV, you're always learning new things."}, {"start": 637.76, "end": 641.58, "text": "So if you have any questions, make sure to go to easydrone.com and check out our posts there."}, {"start": 641.66, "end": 643.3199999999999, "text": "We have a lot of tutorials and how-to guides."}, {"start": 643.3199999999999, "end": 644.48, "text": "And yeah, thanks for watching."}, {"start": 645.26, "end": 651.54, "text": "из遠 purposely"}]}