{"video_id": "WpE4mQegNLg", "url": "https://www.youtube.com/watch?v=WpE4mQegNLg", "title": "WpE4mQegNLg", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.72, "end": 8.0, "text": "Hello friends welcome to the IoT projects in this video we will make smart home automation IoT"}, {"start": 8.0, "end": 15.52, "text": "project using ESP32, Dwin HMI display, relay module and few sensors."}, {"start": 17.36, "end": 23.44, "text": "Using this project you can easily control your AC home appliances like lights, fan,"}, {"start": 23.44, "end": 32.72, "text": "AC, TV etc and also monitor the real-time sensor data. So for the demonstration purpose I am using"}, {"start": 32.72, "end": 42.88, "text": "DST22 temperature and humidity sensor and LDR sensor but you can also use DST11 sensor which is more"}, {"start": 42.88, "end": 52.0, "text": "cheaper. This is a 7 inch Dwin HMI touch display here you can monitor the temperature humidity"}, {"start": 52.0, "end": 60.32, "text": "and LDR sensor real-time sensor value. You can also use this project as a smart thermostat controller"}, {"start": 60.32, "end": 68.96000000000001, "text": "where you can turn on and off the devices based on a sensor threshold value like turning on fan or AC"}, {"start": 68.96000000000001, "end": 77.44, "text": "automatically when the temperature value reaches a defined threshold value. Below sensor value widget"}, {"start": 77.44, "end": 86.4, "text": "you can see the four control buttons to control your home appliances. You can click on the toggle switch"}, {"start": 86.4, "end": 94.96, "text": "to turn on and off the relay and here you can attach four different AC appliances to the relay module and"}, {"start": 94.96, "end": 103.84, "text": "in this demo I haven't connected home appliances to the relay but you can easily connect 220 to 250 volt"}, {"start": 103.84, "end": 112.72, "text": "AC appliances and control them using this project. This project is a local area network based project in which"}, {"start": 112.72, "end": 118.24000000000001, "text": "you don't need an active internet connection to control and monitor your home appliances."}, {"start": 119.12, "end": 127.12, "text": "Here I am configuring the ESP32 web server in soft app mode. So you just connect to the ESP32 smart home"}, {"start": 127.12, "end": 134.8, "text": "Wi-Fi access point by entering its password then enter the IP address of the ESP32 board on your"}, {"start": 134.8, "end": 142.16, "text": "web browser to monitor the real-time sensor data and control your appliances remotely using your"}, {"start": 142.16, "end": 149.76, "text": "smartphone or PC. So you don't need any Wi-Fi connection to control and monitor your home appliances."}, {"start": 149.76, "end": 159.6, "text": "During this video I have shared a complete circuit diagram, Arduino source code, doing display GUI designing"}, {"start": 159.6, "end": 164.56, "text": "process etc. So you can easily make this project at your home."}, {"start": 167.44, "end": 178.56, "text": "Although you can make this project easily using ESP32 relay module, DHT sensor and LDR sensor but it is better to use"}, {"start": 178.56, "end": 187.2, "text": "custom PCB for this project to avoid any loose connection. So I have designed a custom PCB for this project."}, {"start": 187.76, "end": 195.92000000000002, "text": "You can go to the download links to download the project Gerber file and order the PCB directly from"}, {"start": 195.92000000000002, "end": 205.6, "text": "pcbware.com. pcbware.com is one-stop solution for your all the PCB needs like PCB prototyping,"}, {"start": 205.6, "end": 214.24, "text": "SMD stencil, PCB assembly, etc. Currently they have moved to a new factory and offering you up to 20%"}, {"start": 214.24, "end": 226.0, "text": "discount on 4 layer PCB and 6 layer PCB. PCBWare provides high quality material TG150 to 160 but keeps the same"}, {"start": 226.0, "end": 233.44, "text": "price with TG130 to 140. So get your first prototype PCB ready from pcbware.com."}, {"start": 233.44, "end": 241.68, "text": "The link is in the description below. Just click on the PCB instant code tab then click on quick order PCB."}, {"start": 242.4, "end": 248.96, "text": "Now upload your Gerber file. Select your preferred shipping method and place your order."}, {"start": 252.48, "end": 260.24, "text": "Now let's assemble all the components and for that you have to connect the GST22 or GST11 sensor,"}, {"start": 260.24, "end": 269.92, "text": "LDR sensor and the relay module to the ESP32 board. So first we interface the sensor and then relays and"}, {"start": 269.92, "end": 278.96000000000004, "text": "make a serial communication to the display using RX2 and TX2 pins on the display module. Now connect the"}, {"start": 278.96000000000004, "end": 288.56, "text": "sensor relay module and doing HMI display to the ESP32 as shown here. Also provide the AC source to your home"}, {"start": 288.56, "end": 297.52, "text": "appliances as shown in the circuit diagram. Now let us visit the official website of dwingglobal.com."}, {"start": 298.08, "end": 306.64, "text": "You can see the Dwing company making a wide range of high quality touch screen for android LCD, HDMI LCD and"}, {"start": 306.64, "end": 315.12, "text": "Linux LCD display. Under the download section go to the tools and download the DGUS Dwing graphic"}, {"start": 315.12, "end": 325.44, "text": "utilized software that is DGUS software and XR21X driver. The driver is for HDL662B board. We don't need to"}, {"start": 325.44, "end": 333.68, "text": "install this DGUS software. Under this DGUS folder you can see some executable files which includes tools"}, {"start": 333.68, "end": 342.48, "text": "like ICL tool, front generating tool, image resizing tool etc. inside this DGUS software."}, {"start": 342.48, "end": 351.92, "text": "Inside XR21X folder there are the driver files. You need to install the driver on your PC to establish"}, {"start": 351.92, "end": 360.88, "text": "the communication between HDL662B and your PC. Double click the executable file to launch the"}, {"start": 360.88, "end": 367.20000000000005, "text": "driver installer. Now click on the install to install the driver on your windows PC."}, {"start": 367.2, "end": 377.44, "text": "After installing the DGUS software and the driver open the DGUS.exe file. By default the software"}, {"start": 377.44, "end": 387.2, "text": "language is in Chinese. So go to the settings and change it to English. Now click on new to create a new"}, {"start": 387.2, "end": 394.96, "text": "project. Select the screen resolution of 800 by 480 pixels. Choose your project folder path."}, {"start": 395.92, "end": 402.0, "text": "In this demonstration I am creating a new folder doing smart home and selecting the same folder path."}, {"start": 403.12, "end": 410.4, "text": "Now you need to prepare images for your project. Here I have already created images and icons for my"}, {"start": 410.4, "end": 423.03999999999996, "text": "project. You can name your project images and icon folder as 32, 42, 46, 56, 58, 62, 64 and so on."}, {"start": 423.76, "end": 431.84, "text": "Because we need to create an ICL file of these pictures later and memory is divided into different section."}, {"start": 431.84, "end": 444.64, "text": "In this tutorial under 32 folder I have placed images of my UI. Make sure that your image resolution is 800 by 480 pixels"}, {"start": 444.64, "end": 455.91999999999996, "text": "and is in .bmp format. Under the 46 folder I have placed icon files. Similarly on the 62 folder I have placed the"}, {"start": 455.92, "end": 465.2, "text": "number icon files. Now add your project images from 32 folder. Here I have a single image. We should create"}, {"start": 465.2, "end": 474.8, "text": "ICL files of our images. So for that go to the settings menu and click on DGUS. After a new window will pop up."}, {"start": 474.8, "end": 481.36, "text": "Now click on ICL tool. Here you need to select the images and generate the ICL file."}, {"start": 482.32, "end": 490.8, "text": "Save this file with the name 32 under the doing set folder. Similarly choose the button icon and generate"}, {"start": 490.8, "end": 502.88, "text": "the ICL file as 46.icl under the same doing set folder. Finally select the number icons and generate the"}, {"start": 502.88, "end": 508.40000000000003, "text": "62.icl file under the same doing under score set folder."}, {"start": 508.4, "end": 518.48, "text": "We have successfully generated 3 ICL files. Now it's time to add functions to our UI. Here select the"}, {"start": 518.48, "end": 529.4399999999999, "text": "00.bmp image then click on icon display menu. Let's create an artistic variables. Select the area and here"}, {"start": 529.44, "end": 538.32, "text": "you need to assign the vp address for this module. I am choosing 1000 as a vp address and selecting your"}, {"start": 538.32, "end": 549.9200000000001, "text": "icon file as 62. Now select the start icon as 0. Under the variable byte choose the integer 2 byte and integer"}, {"start": 549.92, "end": 554.88, "text": "digit as 2. Set the initial value as 0."}, {"start": 557.68, "end": 565.12, "text": "You can also set the initial number as a highest value of your sensor data and resize the artistic variable"}, {"start": 566.08, "end": 575.2, "text": "according to your need and requirement. Now copy this module and place them on the humidity and LDR sensor"}, {"start": 575.2, "end": 585.52, "text": "widget. But don't forget to change their vp address to 1500 and 2000 respectively. You can also change the"}, {"start": 585.52, "end": 595.04, "text": "variable type if needed. Now let's design our toggle switch button for controlling appliances like light, fan,"}, {"start": 595.6, "end": 606.8, "text": "AC, TV etc. Go to icon display menu and choose the var icon display. Select the area where you want to display your icons."}, {"start": 606.8, "end": 616.8, "text": "As always resize the module as your needs and choose the vp address as 2500."}, {"start": 619.4399999999999, "end": 628.0799999999999, "text": "Choose the icon ICL file as 46.icl. When the value is minimum, select the off icon that is 0 icon"}, {"start": 628.8000000000001, "end": 639.2, "text": "and similarly set the maximum value as 1 and select the on icon that is 1 icon and keep the display module as"}, {"start": 640.24, "end": 650.72, "text": "transparent. Now copy the var icon module and paste them onto fan, TV, AC, controller widget area and change"}, {"start": 650.72, "end": 663.44, "text": "their vp addresses. For light the vp address is 2500, for fan 3000 and for tv 3500 and for AC 4000."}, {"start": 666.32, "end": 674.5600000000001, "text": "Now from the touch control menu select the increment adjustment module. You can resize the module then select the data"}, {"start": 674.56, "end": 687.1199999999999, "text": "auto uploading. Click on no button effect. Give the same vp address as 2500. Click on low byte. Select the"}, {"start": 687.1199999999999, "end": 697.5999999999999, "text": "adjust method as plus plus and over limit operation as a cycle. Similarly adjust the step length to 1 and"}, {"start": 697.6, "end": 708.08, "text": "upper limit to 1. Finally set the touch effect as disposable setting. Also copy and paste the incremental"}, {"start": 708.08, "end": 717.9200000000001, "text": "adjustment module and set their vp addresses accordingly. Finally we have completed adding modules to our UI."}, {"start": 717.9200000000001, "end": 727.28, "text": "Now click on save and generate to generate 13 touch file, 14 show file and 22 config bin files."}, {"start": 728.24, "end": 736.48, "text": "Now you can preview the UI of our project from the display menu. Click on preview from the first page and you can see"}, {"start": 737.0400000000001, "end": 745.6, "text": "our newly created UI in a pop-up window. Here we cannot see the artistic variable and button icon module."}, {"start": 747.44, "end": 751.6, "text": "They will be visible when we upload the project to our display."}, {"start": 751.6, "end": 760.32, "text": "So let's quickly do that. If you don't know how to upload the project to this touch display then follow"}, {"start": 760.32, "end": 767.52, "text": "my previous getting started tutorial in which I have explained two processes to upload the project to"}, {"start": 767.52, "end": 777.6, "text": "our display using HD card and T5L download tool. So this is the result of our newly created UI after"}, {"start": 777.6, "end": 788.96, "text": "uploading the project file to the display. As in this project we are sending data to ESP32 web server as"}, {"start": 788.96, "end": 799.0400000000001, "text": "well as on the Dwin HMI display. And we are also receiving the data from both web server and display to the ESP32 module."}, {"start": 799.04, "end": 809.68, "text": "So for sending purpose I am sending the frame with a VP address of that sensor value and that value is updating on the display."}, {"start": 809.68, "end": 815.68, "text": "Similarly for receiving I am checking the serial receive frame for a particular button"}, {"start": 815.68, "end": 824.16, "text": "and that value of the program. So let's see if you can see the code and select the code and select the code."}, {"start": 824.16, "end": 832.0, "text": "Most of the code are similar to our previous project. You can watch those videos if you are viewing our videos for the first time."}, {"start": 832.56, "end": 843.12, "text": "I have already explained them in detail. Now select your ESP32 dev kit and correct COM port to upload this program into your ESP32 board."}, {"start": 843.12, "end": 852.8, "text": "Click on the upload button to upload the code and after successful upload of this program you can see this project into the action."}, {"start": 853.76, "end": 858.16, "text": "Now you can also see the real-time sensor data on the Dwin HMI display."}, {"start": 859.12, "end": 865.44, "text": "You can see the value increasing and decreasing when the light source is moved onto the LDR sensor."}, {"start": 865.44, "end": 878.48, "text": "This is a single page smart home UI where you can monitor the sensor data and control appliances from the same screen."}, {"start": 879.6, "end": 884.72, "text": "You can control your home appliances connected through this four channel relay module."}, {"start": 884.72, "end": 886.64, "text": "You can also see the user's mobile device."}, {"start": 886.64, "end": 891.44, "text": "We have also configured the ESP32 web server in soft IP mode."}, {"start": 891.44, "end": 898.48, "text": "So you just connect the smartphone to ESP32 smart home Wi-Fi access point by entering its password."}, {"start": 899.2, "end": 907.12, "text": "Then enter the IP address of the ESP board on your browser to monitor real-time sensor data and control your"}, {"start": 907.12, "end": 911.52, "text": "appliances remotely using your smartphone or PC."}, {"start": 911.52, "end": 923.12, "text": "So you don't need any Wi-Fi connection to control and monitor your home appliances."}, {"start": 924.3199999999999, "end": 931.4399999999999, "text": "So we have successfully made this smart home controller project with Dwin HMI display and ESP32."}, {"start": 931.44, "end": 935.2800000000001, "text": "So you can see the UI looks pretty good in this HMI display."}, {"start": 936.6400000000001, "end": 939.12, "text": "I hope the tutorial was helpful to you."}, {"start": 939.84, "end": 944.6400000000001, "text": "If it really help you then don't hesitate to like and subscribe to this channel."}, {"start": 945.2800000000001, "end": 947.6800000000001, "text": "It's me Elsan signing off for today."}, {"start": 947.6800000000001, "end": 949.6800000000001, "text": "Catch you soon on the next one."}]}