{"video_id": "z58RORCUTao", "url": "https://www.youtube.com/watch?v=z58RORCUTao", "title": "z58RORCUTao", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 4.84, "text": "A few weeks ago, Mark Roper released a video showing these really cool zipline drones that"}, {"start": 4.84, "end": 10.26, "text": "deliver medical supplies in Rwanda. As cool as this is, he kind of glossed over one of the most"}, {"start": 10.26, "end": 15.76, "text": "interesting features of these drones. Look at these propellers. He mentions that they're shaped like"}, {"start": 15.76, "end": 21.16, "text": "that to reduce the noise, but why does this happen? And what is it about the shape that reduces the"}, {"start": 21.16, "end": 26.04, "text": "noise? The internet right now is just buzzing, waiting for someone to make a 3D printable version"}, {"start": 26.04, "end": 31.54, "text": "of these to see how much quieter they actually are. And that's exactly what I have here. But before"}, {"start": 31.54, "end": 35.6, "text": "we listen to these, let me explain why these propellers are shaped this way in the first place."}, {"start": 36.12, "end": 42.0, "text": "What actually makes sound when a propeller spins really fast? Well, as the blades move past by a"}, {"start": 42.0, "end": 47.480000000000004, "text": "stationary point, it creates a pressure disturbance that propagates away from the blade. The frequency"}, {"start": 47.480000000000004, "end": 52.120000000000005, "text": "that this happens is called the blade passage frequency, and it's equal to the rotational"}, {"start": 52.12, "end": 57.5, "text": "frequency, so how fast the propeller's spinning, times the number of blades on the propeller. So"}, {"start": 57.5, "end": 61.92, "text": "let's say that we have a propeller that has four blades. The traditional way to make these is to"}, {"start": 61.92, "end": 66.96, "text": "space them evenly so that they're 90 degrees apart. When you have a propeller shaped like this, it creates"}, {"start": 66.96, "end": 73.02, "text": "a lot of different frequencies, but it creates a loud frequency at the blade passage frequency, but also"}, {"start": 73.02, "end": 78.24, "text": "it creates frequencies at the harmonics of the blade passage frequency. So if you take an audio recording"}, {"start": 78.24, "end": 83.14, "text": "of this, you'll see peaks at the whole number multiples of the blade passage frequency. But"}, {"start": 83.14, "end": 88.24, "text": "something really interesting happens if you don't space out the blades evenly. So let's say instead"}, {"start": 88.24, "end": 93.89999999999999, "text": "of having the blades spaced 90 degrees apart, we space them 30 degrees apart only. So there's now a large"}, {"start": 93.89999999999999, "end": 99.02, "text": "gap and then a small gap between them, so they aren't evenly spaced. Well then when you record the sound,"}, {"start": 99.08, "end": 103.88, "text": "you get the normal harmonics like before with one, two, three times the blade passage frequency,"}, {"start": 103.88, "end": 110.97999999999999, "text": "but you also get 0.5 times the blade passage frequency and 1.5 and 2.5. So for the same"}, {"start": 110.97999999999999, "end": 116.47999999999999, "text": "acoustic energy, you're spreading out some of the sound into lower frequencies. The most important"}, {"start": 116.47999999999999, "end": 120.97999999999999, "text": "frequency is the one that's generated, which has half the frequency of the blade passage frequency."}, {"start": 121.24, "end": 126.46, "text": "You can see this here. So first we'll start with this four blade propeller. I have these little"}, {"start": 126.46, "end": 132.38, "text": "reflective strips on here so I can measure the RPM. So how many times per second that it's spinning"}, {"start": 132.38, "end": 140.22, "text": "around in a circle? So we're at around 1200 RPM right now. So around 85 Hertz is one of the loudest"}, {"start": 140.22, "end": 149.38, "text": "frequencies here. But now if I switch out these propellers to around a 30 degree propeller,"}, {"start": 149.38, "end": 162.35999999999999, "text": "let's get it to the same RPM. So that's almost exactly the same RPM around 1200. The other one is around 1249."}, {"start": 162.36, "end": 172.20000000000002, "text": "So they're going the same speed now, but let's measure one of the loudest frequencies. So this is crazy."}, {"start": 172.20000000000002, "end": 179.20000000000002, "text": "We're going the same speed with four propellers, but the loudest frequency coming off here is half the"}, {"start": 179.20000000000002, "end": 185.20000000000002, "text": "frequency of the propeller that has the evenly spaced blades. So it's picking up a lower frequency."}, {"start": 185.2, "end": 191.7, "text": "The higher one is still there, but the energy is shared between the two frequencies. So what does that do for us?"}, {"start": 191.95999999999998, "end": 198.6, "text": "Well, humans are less sensitive to low frequency sounds. So we perceive them as quieter than they actually are."}, {"start": 198.95999999999998, "end": 205.07999999999998, "text": "So what this means is that when you space the blades unevenly, it creates a lower frequency that we perceive as quieter."}, {"start": 205.07999999999998, "end": 212.94, "text": "And this fact has been known for a long time. For example, there are cooling fans and helicopter rotors that use uneven blade spacing."}, {"start": 212.94, "end": 218.28, "text": "But this design still doesn't quite look like the zip line design that we saw from Mark Rober's video."}, {"start": 218.28, "end": 222.2, "text": "Why is there this gap between the blades so that they're on different levels?"}, {"start": 222.2, "end": 227.7, "text": "Well, when you have a propeller design like this, there's an interaction that happens where the blades overlap."}, {"start": 227.7, "end": 234.0, "text": "This causes a lot of broadband noise, meaning just a large spread of many frequencies through the spectrum."}, {"start": 234.0, "end": 240.5, "text": "So any noise reduction that you gain with the uneven blade spacing gets canceled out with this broadband noise that's created."}, {"start": 240.5, "end": 247.76, "text": "But if you just get rid of that overlap by raising one of the blades a little bit higher than the other one, then the broadband noise just goes away."}, {"start": 247.76, "end": 252.84, "text": "So an easy way to create this is just to take two double blade propellers and stack them on top of each other."}, {"start": 253.2, "end": 258.16, "text": "So I've made two propellers here. These are taken from an FPV airplane propeller that I have."}, {"start": 258.46, "end": 263.7, "text": "Okay, so what I have here are two different spacings of blades stacked on top of each other."}, {"start": 263.7, "end": 271.7, "text": "And I put a little sticker on each of them so that I can measure the rotational rate, the RPMs as they're spinning to get them at the same RPM."}, {"start": 271.7, "end": 274.7, "text": "Okay, so I'm going to turn both of them on."}, {"start": 274.7, "end": 280.7, "text": "10,300 RPM."}, {"start": 280.7, "end": 286.7, "text": "And this one's at 10,000 RPM."}, {"start": 286.7, "end": 288.7, "text": "10,200 RPM."}, {"start": 288.7, "end": 295.7, "text": "So they're really close to the same RPM."}, {"start": 295.7, "end": 299.7, "text": "Okay, let's listen to both of their sounds."}, {"start": 299.7, "end": 316.7, "text": "Now in front."}, {"start": 316.7, "end": 331.7, "text": "10,300 RPM."}, {"start": 331.7, "end": 344.7, "text": "Now behind."}, {"start": 344.7, "end": 353.7, "text": "The high pitch tones are still there with this one, but they're a lot less because of the acoustic noise has been spread out to that lower frequency as well as the high one."}, {"start": 353.7, "end": 356.7, "text": "Whereas this one has most of the high ones."}, {"start": 356.7, "end": 361.7, "text": "You can see that the uneven space blades have a noticeably lower tone than the evenly spaced one."}, {"start": 361.7, "end": 367.7, "text": "What that amounts to is that it sounds quieter and not quite as annoying as the regularly spaced one."}, {"start": 367.7, "end": 376.7, "text": "So Zipline has made a version of the uneven space blades, but instead of including the four blades, they just have the two of them with a counterbalance on the other side."}, {"start": 376.7, "end": 377.7, "text": "So it sounds like this."}, {"start": 377.7, "end": 389.7, "text": "Now mine isn't perfectly balanced, so it doesn't sound a lot quieter."}, {"start": 389.7, "end": 394.7, "text": "I'd love for someone to make a better version of this in real life that uses the same design as Zipline."}, {"start": 394.7, "end": 399.7, "text": "Also a few months ago, MIT came up with a propeller called the toroidal propeller."}, {"start": 399.7, "end": 402.7, "text": "This is the two blade version."}, {"start": 402.7, "end": 405.7, "text": "And then this is the three blade version."}, {"start": 405.7, "end": 410.7, "text": "This used a propeller in this shape that reduced the sound in a different way."}, {"start": 410.7, "end": 415.7, "text": "It actually reduced the vortices formed and slightly reduced the overall sound levels."}, {"start": 415.7, "end": 421.7, "text": "You can actually see what the flow looks like between a toroidal propeller and a regular one in this simulation here."}, {"start": 421.7, "end": 428.7, "text": "For the standard props, we see small detached tip vortices from the air rolling off the tip of the blades."}, {"start": 428.7, "end": 432.7, "text": "These contribute to the high buzz noise that's typical of quadcopter drones."}, {"start": 432.7, "end": 437.7, "text": "In the case of the toroidal props, this detached vortex is contained within the ring of the prop,"}, {"start": 437.7, "end": 441.7, "text": "and the overall jet of air is much more coherent, so it's quieter."}, {"start": 441.7, "end": 446.7, "text": "So this will correlate to a reduced overall noise signature due to improved turbulent flow."}, {"start": 446.7, "end": 452.7, "text": "This simulation is done using real physics using the software from our sponsor for this video, SimScale,"}, {"start": 452.7, "end": 456.7, "text": "the world's first cloud-native engineering simulation platform."}, {"start": 456.7, "end": 463.7, "text": "SimScale provides engineers and designers access to digital prototyping and simulation early in the design stage,"}, {"start": 463.7, "end": 469.7, "text": "throughout the entire R&D cycle and across the entire enterprise, right in your web browser."}, {"start": 469.7, "end": 474.7, "text": "If you want to learn more about SimScale, you can click the link in my description and create a free community account."}, {"start": 474.7, "end": 478.7, "text": "And also you can access thousands of public simulations as well."}, {"start": 478.7, "end": 486.7, "text": "You can also view the quadcopter project from this video and post-process the simulation results yourself by clicking the link in my description."}, {"start": 486.7, "end": 490.7, "text": "And thanks to them for sponsoring this video and providing these nice simulations."}, {"start": 490.7, "end": 492.7, "text": "Now let's get back to the experiment."}, {"start": 492.7, "end": 496.7, "text": "One problem with this design is notice that with the four propellers,"}, {"start": 496.7, "end": 505.7, "text": "at 1200 RPM we get around 3.1 miles per hour of wind coming off of it."}, {"start": 505.7, "end": 510.7, "text": "But at the same rotational frequency for the unevenly spaced propellers,"}, {"start": 510.7, "end": 515.7, "text": "we're only getting like 2.5, 2.7 miles per hour."}, {"start": 515.7, "end": 521.7, "text": "So for the same rotational speed with the same weight, we get less wind coming off of it."}, {"start": 521.7, "end": 526.7, "text": "Which means to get the same wind speed, you have to speed this one up a little bit faster."}, {"start": 526.7, "end": 529.7, "text": "But that doesn't actually hurt you sound wise."}, {"start": 529.7, "end": 533.7, "text": "Because I can turn up the speed to match the four propeller ones."}, {"start": 533.7, "end": 535.7, "text": "Let's turn it up to get like 3.1."}, {"start": 535.7, "end": 539.7, "text": "So now I turn up the speed."}, {"start": 539.7, "end": 545.7, "text": "So overall you have to spin these a little bit faster than you would the evenly spaced blades."}, {"start": 545.7, "end": 548.7, "text": "So they're less efficient, but you still get the lower frequency,"}, {"start": 548.7, "end": 551.7, "text": "even at the faster speeds to get the same wind speed."}, {"start": 551.7, "end": 556.7, "text": "So overall these still can be a little bit quieter sounding than the evenly spaced blades."}, {"start": 556.7, "end": 561.7, "text": "So what's interesting about this apparent noise reduction with uneven blade spacing,"}, {"start": 561.7, "end": 564.7, "text": "is that it depends on the place where you're listening."}, {"start": 564.7, "end": 569.7, "text": "If you're behind the blades, then the noise reduction is worse for uneven spacing."}, {"start": 569.7, "end": 573.7, "text": "But when you're in front of the blades or in the same plane as the blade, it's actually better."}, {"start": 573.7, "end": 577.7, "text": "So this is actually beneficial for flyover noise for planes."}, {"start": 577.7, "end": 583.7, "text": "Because when they're closest to you, you're in about the same plane as the blade above you, so it's quieter."}, {"start": 583.7, "end": 588.7, "text": "But unfortunately that means it would be worse for drones because everything's below the blades."}, {"start": 588.7, "end": 591.7, "text": "But I'm not sure how ziplines blades would sound on a drone."}, {"start": 591.7, "end": 595.7, "text": "Maybe someone will get a hold of the real blades and do a comparison on a drone."}, {"start": 595.7, "end": 600.7, "text": "Also I got a lot of this information in this video from a paper on uneven blade spacing."}, {"start": 600.7, "end": 603.7, "text": "And I'll put a link to that paper in the description as well."}, {"start": 603.7, "end": 605.7, "text": "And thanks again for watching this video."}, {"start": 605.7, "end": 607.7, "text": "If you like this video, remember to like this video."}, {"start": 607.7, "end": 610.7, "text": "And also subscribe to my channel if you haven't yet."}, {"start": 610.7, "end": 611.7, "text": "And we'll see you next time."}]}