{"video_id": "-AKD2Lv7XqI", "url": "https://www.youtube.com/watch?v=-AKD2Lv7XqI", "title": "-AKD2Lv7XqI", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.64, "end": 5.92, "text": "Hey, what's up guys? We're back talking about filters again. We've already done high pass"}, {"start": 5.92, "end": 13.120000000000001, "text": "and low pass, so today we're going to talk about band pass filters. And a band pass filter very"}, {"start": 13.120000000000001, "end": 21.52, "text": "simply passes frequencies within a certain frequency range and rejects frequencies that"}, {"start": 21.52, "end": 28.32, "text": "are outside of that range. That's about as simple as it gets. So what are its applications? Well,"}, {"start": 28.32, "end": 34.32, "text": "it's used in transmitting and receiving circuits to keep the transmitted or received signal within"}, {"start": 34.32, "end": 41.44, "text": "the allocated frequency bandwidth. They're also used in atmospheric studies and audio applications."}, {"start": 42.480000000000004, "end": 49.92, "text": "So you'll see them a lot there. Now, the way we find our frequencies is the same as we did"}, {"start": 50.56, "end": 55.44, "text": "for our low pass and high pass filters, and we'll come to that in a minute. So first of all,"}, {"start": 55.44, "end": 63.36, "text": "let's look at our high pass filter. It consists of a sine or, you know, whatever our wave input is"}, {"start": 64.24, "end": 70.4, "text": "going through a capacitor to the output with a parallel resistor going to ground."}, {"start": 71.44, "end": 75.84, "text": "And the frequency response of our high pass filter looks like this."}, {"start": 75.84, "end": 84.48, "text": "Anything below this line here is going to be attenuated. Anything above it is going to be passed."}, {"start": 85.84, "end": 92.48, "text": "Then our low pass filter, here we have our input with the resistor and then a parallel capacitor going"}, {"start": 92.48, "end": 100.64, "text": "to ground. And it simply looks like the opposite. Anything above here is going to be attenuated,"}, {"start": 100.64, "end": 106.64, "text": "and everything down here is going to be passed. So that is our high frequency mark, and there is our"}, {"start": 106.64, "end": 118.64, "text": "low frequency mark. And to find that, our frequency cutoff equals 1 over 2 pi r c times the hertz times"}, {"start": 118.64, "end": 126.96000000000001, "text": "the frequency. And it works the same for the band pass filter. Because when we make our band pass filter,"}, {"start": 126.96, "end": 144.4, "text": "what we're doing is here's our input. We're going to have a capacitor, and then a resistor that goes to ground."}, {"start": 144.4, "end": 150.32, "text": "I forgot to draw my resistor in there. And then we're going to have another resistor."}, {"start": 150.32, "end": 158.56, "text": "There's our output, there's our ground. And then we're going to have the parallel capacitor here."}, {"start": 160.0, "end": 166.16, "text": "So what you see here is simply a combination of the high pass and the low pass, and therefore we have"}, {"start": 166.16, "end": 176.0, "text": "the band pass. So if we take our two Bode plots here of these two filters, the low pass"}, {"start": 176.0, "end": 191.36, "text": "and the high pass. So here is our high pass, and here is our low pass, and then here is our low cutoff,"}, {"start": 193.04, "end": 199.12, "text": "here is our high cutoff, and this area right here"}, {"start": 199.12, "end": 211.6, "text": "is the band that we're going to pass. Voila! A band pass filter. So let's put one together on the breadboard."}, {"start": 211.6, "end": 217.92000000000002, "text": "All right, so I've got our band pass filter laid out here, and here's the nuts and bolts of it. This"}, {"start": 217.92000000000002, "end": 223.12, "text": "is called a second order band pass, because we have two separate filters here. And the band that's going"}, {"start": 223.12, "end": 229.68, "text": "to pass is between 1k and 30k. Now you can use that formula I showed you on the other page to figure"}, {"start": 229.68, "end": 236.08, "text": "out how to do that. But here's the layout of our filter. And it matches exactly what you see here."}, {"start": 236.64000000000001, "end": 245.36, "text": "This first capacitor is 15 nanofarads, and then this first resistor is 10k. The second resistor is also"}, {"start": 245.36, "end": 255.04000000000002, "text": "10k. And the second capacitor is 560 picofarad. So we can zoom in here and take a better look."}, {"start": 259.44, "end": 264.88, "text": "This is the input, this is where our signal is coming in, and this is the output being read"}, {"start": 264.88, "end": 278.88, "text": "by the oscilloscope. So let's rotate up here. Have a look at the oscilloscope. Now if you look down at the"}, {"start": 278.88, "end": 288.15999999999997, "text": "bottom of the screen here, or you can just look up there, you can see our frequency is 5.4, so dot dot dot"}, {"start": 288.88, "end": 294.56, "text": "kilohertz. It's a sine wave. And if you look at the peak to peak where the red triangle is there,"}, {"start": 295.6, "end": 305.44, "text": "you can see we're getting 8.8, 8.9 volts, because that frequency is within our band. Now if we drop down"}, {"start": 305.44, "end": 319.36, "text": "below that, our frequency is now 530 hertz, and our peak to peak has dropped to 3.68 volts. So we've got"}, {"start": 319.36, "end": 328.56, "text": "like a 50 percent attenuation. We go back to our 5.43 kilohertz, and you can see we're right back into it."}, {"start": 329.6, "end": 334.56, "text": "And then if we jump above it, we're now at 55 kilohertz."}, {"start": 334.56, "end": 345.52, "text": "You can see again we're at 3.68 volts, and it has simply attenuated back out of it. And as our"}, {"start": 345.52, "end": 355.28, "text": "frequency increases, you can see that our amplitude decreases. So look, we're at 100, or 300,"}, {"start": 355.28, "end": 357.35999999999996, "text": "are we at 300, or where the hell are we at?"}, {"start": 361.76, "end": 368.0, "text": "Okay, 320 or so kilohertz, and our peak to peak is 740 millivolts."}, {"start": 368.0, "end": 380.08, "text": "So there you have it. The band pass filter. A combination of the low pass and the high pass."}, {"start": 380.08, "end": 386.15999999999997, "text": "A little bit of math, and you can select whichever band you want to let through,"}, {"start": 386.88, "end": 392.08, "text": "and which bands you don't want to let through. I hope you guys enjoyed this. If you did,"}, {"start": 393.03999999999996, "end": 397.68, "text": "give me a thumbs up. Feel free to comment, share, and don't forget to subscribe."}, {"start": 398.71999999999997, "end": 405.2, "text": "Big thanks to all the patrons. That's it. I'm out. Peace."}, {"start": 410.8, "end": 415.2, "text": "No, no, we're locked."}, {"start": 416.24, "end": 420.24, "text": "I'm out."}, {"start": 423.03999999999996, "end": 423.7, "text": "Nope."}, {"start": 425.36, "end": 426.64, "text": "Love it."}, {"start": 427.2, "end": 428.0, "text": "Love it."}, {"start": 429.44, "end": 431.12, "text": "Love it."}, {"start": 432.03999999999996, "end": 435.28, "text": "Love it."}, {"start": 437.59999999999997, "end": 438.71999999999997, "text": "Bye."}, {"start": 438.71999999999997, "end": 439.28, "text": "That's it."}]}