{"video_id": "0Mu2L9z1MH8", "url": "https://www.youtube.com/watch?v=0Mu2L9z1MH8", "title": "0Mu2L9z1MH8", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 11.0, "text": "Hey everybody, it's Clark at Amplified Parts and we are here to talk about prototyping circuit boards today."}, {"start": 11.0, "end": 14.0, "text": "One of the easiest ways to start is with a breadboard."}, {"start": 14.0, "end": 17.0, "text": "This is something that you don't have to solder on to."}, {"start": 17.0, "end": 21.0, "text": "We sell these, they're very nice, there's an adhesive back on it."}, {"start": 21.0, "end": 27.0, "text": "And you know, the great thing about this is it's really good to do in the early stages of any kind of prototyping."}, {"start": 27.0, "end": 31.0, "text": "We also sell zip wire, this is basically like a jumper for a breadboard."}, {"start": 31.0, "end": 37.0, "text": "And what's great about this, we have male to male, we have female to male, we have female to female."}, {"start": 37.0, "end": 42.0, "text": "So there's all kinds of different ways that you can lengthen and help design your stuff that much easier."}, {"start": 42.0, "end": 49.0, "text": "Now one of the things that we've noticed a lot of people have been doing lately is Arduino, and this is great for that type of application."}, {"start": 49.0, "end": 54.0, "text": "If you've never used a breadboard before, we have a Junior Genius Kit that is really great."}, {"start": 54.0, "end": 64.0, "text": "It's got simple designs, more complicated designs, and it's a really good gift idea if you're thinking about getting for the Virginine Builder in your life."}, {"start": 64.0, "end": 69.0, "text": "Breadboards aren't really for final design, they're for the prototyping stage, this is what we're talking about now."}, {"start": 69.0, "end": 74.0, "text": "We have a solderable breadboard and a non-solderable breadboard."}, {"start": 74.0, "end": 84.0, "text": "So when you're in your design stage, if you find something you really like on this one, it can be transferred to this and soldered in a more permanent kind of manner."}, {"start": 84.0, "end": 91.0, "text": "Once you get past the breadboard stage, if you want it to be a little more permanent, you could use either a stripboard or a padboard."}, {"start": 91.0, "end": 104.0, "text": "These can be used in DIY pedal builds, and they're a great place to, once you've kind of begun your process of designing with the breadboard, you can move on to this and it makes it a little more permanent."}, {"start": 104.0, "end": 112.0, "text": "We're going to cut to a video close-up that will show you some of the differences between soldering on a padboard and a stripboard, so you can get an idea of which one might work for you better."}, {"start": 112.0, "end": 117.0, "text": "Padboard is a general purpose circuit board with a through-hole design and one pad per hole."}, {"start": 117.0, "end": 125.0, "text": "The padboard we sell is double-sided, with square pads every fifth hole, making it easy to align components and keep track of spacing."}, {"start": 125.0, "end": 129.0, "text": "We're going to add a few resistors to the board and make some connections."}, {"start": 129.0, "end": 140.0, "text": "First, take a resistor and bend the component leads at 90 degrees. If available, a lead bender can be used."}, {"start": 140.0, "end": 147.0, "text": "Next, insert the leads through the holes."}, {"start": 147.0, "end": 152.0, "text": "Hold the resistor down and flip the board over."}, {"start": 152.0, "end": 158.0, "text": "Bend the lead slightly outward to provide tension to hold the component in place."}, {"start": 158.0, "end": 165.0, "text": "Repeat the process with another resistor, with one of the leads going through a hole adjacent to the other resistor's lead."}, {"start": 165.0, "end": 171.0, "text": "When soldering, it's helpful to place the padboard on a flat surface with the leads facing up."}, {"start": 171.0, "end": 174.0, "text": "Apply solder to both neighboring pads one at a time."}, {"start": 174.0, "end": 181.0, "text": "A screwdriver tip is better than a conical tip for making solid contact with both the pad and the component lead."}, {"start": 181.0, "end": 188.0, "text": "To connect the joints, touch the soldering iron between the pads, making contact with both solder joints."}, {"start": 188.0, "end": 190.0, "text": "Apply more solder to both pads."}, {"start": 190.0, "end": 200.0, "text": "After the joints are soldered properly, we are going to trim the leads, but first we will inspect the joint to make sure we have a proper connection."}, {"start": 200.0, "end": 206.0, "text": "Once we are sure the connection has been soldered properly, we can trim the leads."}, {"start": 206.0, "end": 218.0, "text": "We are going to repeat the process with another resistor."}, {"start": 218.0, "end": 222.0, "text": "It's possible to connect components that are not adjacent to one another."}, {"start": 222.0, "end": 225.0, "text": "We will do this with the remaining two resistor leads."}, {"start": 225.0, "end": 235.0, "text": "We bend one of the leads in the direction of the other lead and flatten it to the board, ensuring that it makes contact with the other lead."}, {"start": 235.0, "end": 253.0, "text": "Now we will solder the bent lead at the location where it is going through the board."}, {"start": 253.0, "end": 261.0, "text": "Once the bent lead is soldered in place at the first joint, trim the end of it so that it does not extend beyond the other component's pad to prevent excessive bridging."}, {"start": 261.0, "end": 277.0, "text": "Now we will solder the two leads to the pad where they meet."}, {"start": 277.0, "end": 283.0, "text": "Once the joint has been inspected, the unbent lead can be trimmed."}, {"start": 283.0, "end": 291.0, "text": "A bridged lead like this can be convenient for joints that have multiple connections using the same steps to connect additional components to the lead."}, {"start": 291.0, "end": 297.0, "text": "Once you are finished soldering, you may want to use a flux cleaner on the board as flux can be conductive and corrosive."}, {"start": 297.0, "end": 300.0, "text": "Here we are using Keg's Flux Wash."}, {"start": 300.0, "end": 305.0, "text": "Stripboard is similar to padboard except that every hole in a row is connected."}, {"start": 305.0, "end": 313.0, "text": "Rather than bridging connections with solder or bent leads, the common pads in a row are used as a shared connection point."}, {"start": 313.0, "end": 317.0, "text": "Cuts can be made to the strips to make separate shared joints in a single row."}, {"start": 317.0, "end": 319.0, "text": "This is useful for things like integrated circuits."}, {"start": 319.0, "end": 325.0, "text": "The pins are isolated from each other, but connections can be made easily using the holes in these rows."}, {"start": 325.0, "end": 332.0, "text": "Wire can be used as a jumper to allow two separate rows to share a common node in the circuit."}, {"start": 332.0, "end": 337.0, "text": "The good thing about the stripboards and padboards is they are pretty much interchangeable for design."}, {"start": 337.0, "end": 339.0, "text": "You can use one or the other."}, {"start": 339.0, "end": 343.0, "text": "You might want to get one of each and see which one you are more comfortable with in your design plans."}, {"start": 343.0, "end": 347.0, "text": "Also, we sell the standard padboard that is just a nice square."}, {"start": 347.0, "end": 353.0, "text": "Then we have this one right here that fits very perfectly inside of this enclosure."}, {"start": 353.0, "end": 359.0, "text": "It is kind of hard to tell from this angle, but this one is a one hole and this is a two hole."}, {"start": 359.0, "end": 366.0, "text": "Depending on how you need to lay your stuff out, one or the other might become more useful for you."}, {"start": 366.0, "end": 368.0, "text": "We also sell standoffs."}, {"start": 368.0, "end": 374.0, "text": "The good thing about these is if you are using a box, you don't want to set the board directly down on there."}, {"start": 374.0, "end": 376.0, "text": "That could cause a short or some other issues."}, {"start": 376.0, "end": 378.0, "text": "We sell these great little things."}, {"start": 378.0, "end": 379.0, "text": "They look like feet."}, {"start": 379.0, "end": 381.0, "text": "They are called standoffs."}, {"start": 381.0, "end": 388.0, "text": "They basically go right inside here and it keeps your board off of the box to prevent any kind of shorting or anything like that."}, {"start": 388.0, "end": 390.0, "text": "Any grounding issues."}, {"start": 390.0, "end": 392.0, "text": "As usual, thanks for watching the videos."}, {"start": 392.0, "end": 395.0, "text": "Of course, you can always check all of our social media platforms."}, {"start": 395.0, "end": 399.0, "text": "Facebook, Twitter, every place else we are at."}, {"start": 399.0, "end": 400.0, "text": "Thank you very much for watching."}, {"start": 400.0, "end": 403.0, "text": "There are going to be some links to get you right to these parts."}, {"start": 403.0, "end": 404.0, "text": "Enjoy."}, {"start": 411.0, "end": 412.0, "text": "Thank you."}, {"start": 412.0, "end": 413.0, "text": ", take sure."}, {"start": 413.0, "end": 434.0, "text": "»"}]}