{"video_id": "1WYDsiYJGoQ", "url": "https://www.youtube.com/watch?v=1WYDsiYJGoQ", "title": "1WYDsiYJGoQ", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 5.18, "text": "We're going through Betaflight 4.3 Configurator, looking at every single option, telling you what"}, {"start": 5.18, "end": 10.1, "text": "it is and how to set it up so you know what to do the next time you encounter it. In today's video,"}, {"start": 10.26, "end": 16.2, "text": "we are looking at the Motors tab. If you came here for the Motors tab, then stick around. But if you"}, {"start": 16.2, "end": 20.34, "text": "somehow just stumbled across this video and you want to learn more about Betaflight Configurator,"}, {"start": 20.76, "end": 25.42, "text": "there's a playlist in the video description. You can start with video number one and go from there."}, {"start": 26.060000000000002, "end": 29.68, "text": "Let's get on to the Motors tab. And the first option we're going to look at here is the Mixer."}, {"start": 29.68, "end": 35.18, "text": "And the Mixer tells the Flight Controller how many motors there are, where those motors are"}, {"start": 35.18, "end": 40.9, "text": "located in space, and what direction those motors are going to be spinning. And the reason the Flight"}, {"start": 40.9, "end": 46.8, "text": "Controller needs to know this is the Flight Controller's job is to translate your stick inputs"}, {"start": 46.8, "end": 52.620000000000005, "text": "into movement of the quadcopter. So if you push the roll stick to the left, the Flight Controller"}, {"start": 52.620000000000005, "end": 58.8, "text": "knows the quadcopter needs to roll to the left, and it needs to know which motors it needs to speed up"}, {"start": 58.8, "end": 64.89999999999999, "text": "and slow down to cause the quadcopter to roll to the left. Now the most common mixer you're going to"}, {"start": 64.89999999999999, "end": 71.08, "text": "see is probably Quad X. That's what almost everybody is probably flying. But we can see that there are"}, {"start": 71.08, "end": 77.92, "text": "many different mixers that Betaflight supports. An A-tail Quad, even some fixed-wing mixers. I have to say,"}, {"start": 78.47999999999999, "end": 85.17999999999999, "text": "Betaflight's support for fixed-wing and servos is extremely poor. It just is an afterthought that"}, {"start": 85.18, "end": 89.86000000000001, "text": "hasn't received much development at all, and it can be very difficult to get servos and airplanes"}, {"start": 89.86000000000001, "end": 93.7, "text": "working with Betaflight. If you really want to build an airplane with a Flight Controller,"}, {"start": 94.14000000000001, "end": 98.80000000000001, "text": "strongly recommend using iNav instead of Betaflight. As we come down through the list,"}, {"start": 98.88000000000001, "end": 103.78, "text": "there are some layouts that have more than four motors. Here's a hexacopter mixer. Here is a"}, {"start": 104.78, "end": 111.18, "text": "octocopter mixer. There is an X8 octocopter mixer, where you have four... We have eight motors,"}, {"start": 111.18, "end": 116.78, "text": "but there are two of them are co-located with each other, and so on, and so on. There's a bunch"}, {"start": 116.78, "end": 121.58000000000001, "text": "of different mixers that you could theoretically be using. We're going to go back to the Quad X mixer"}, {"start": 121.58000000000001, "end": 126.96000000000001, "text": "that probably almost everybody is using. And the next option we're going to look at is this one,"}, {"start": 127.26, "end": 132.92000000000002, "text": "Motor Direction is Reversed. I want you to look at this diagram here and look at which direction"}, {"start": 132.92000000000002, "end": 138.86, "text": "the motors are spinning. Because one of the easiest mistakes you can make when setting up a quadcopter is"}, {"start": 138.86, "end": 144.02, "text": "to have one or more of the motors spinning the wrong direction. And a lot of times when I troubleshoot this with people,"}, {"start": 144.34, "end": 148.22000000000003, "text": "I'll say, are your motors spinning the right direction? And they'll go, yes, I double checked them."}, {"start": 148.52, "end": 153.84, "text": "And it turns out you double checked them from memory, but like the Flight Controller doesn't agree with your memory,"}, {"start": 153.84, "end": 159.76000000000002, "text": "and so it can't fly correctly. So whenever you're checking your motor direction, always do it based on the diagram"}, {"start": 159.76000000000002, "end": 164.72000000000003, "text": "that the Flight Controller is giving you. And if we look at what this option does,"}, {"start": 164.72, "end": 170.7, "text": "motor direction is reversed, it switches the direction of all of the motors. So a lot of people would consider"}, {"start": 170.7, "end": 178.28, "text": "normal direction to be props in, they call it, and motor direction is reversed would be props out."}, {"start": 178.5, "end": 183.52, "text": "There's pros and cons to each, and which one you want to choose is not really the topic of this video."}, {"start": 183.68, "end": 188.9, "text": "But the key thing you need to know is that this option does not reverse the motors."}, {"start": 188.9, "end": 194.76000000000002, "text": "So a real common mistake people make is they flip this option, they mean for the motors to be spinning props out,"}, {"start": 194.88, "end": 198.98000000000002, "text": "but the motors are actually spinning props in, and then they get confused when their quadcopter won't fly."}, {"start": 199.4, "end": 207.34, "text": "This tells the Flight Controller what direction you intend for the motors to go. It doesn't make the motors go that direction."}, {"start": 207.54000000000002, "end": 212.02, "text": "Now in order to make the motors spin, we have to choose an ESC and motor protocol."}, {"start": 212.02, "end": 216.88000000000002, "text": "And the most common one that people are going to be using today is DSHOT."}, {"start": 217.26000000000002, "end": 222.68, "text": "There are three variants of DSHOT here in Betaflight, DSHOT 150, 300, and 600."}, {"start": 222.96, "end": 229.28, "text": "DSHOT is a digital protocol that is used to communicate between the Flight Controller and the ESC."}, {"start": 229.5, "end": 235.28, "text": "And it essentially tells the ESC how fast that the Flight Controller wants the motor to be spinning."}, {"start": 235.72, "end": 237.52, "text": "But DSHOT can do more than that."}, {"start": 237.52, "end": 248.52, "text": "DSHOT can also carry digital commands to do things like reverse the motors that normally would have required you to hook up to the ESC and use a configurator or something."}, {"start": 249.02, "end": 255.44, "text": "So DSHOT carries the throttle signal and DSHOT commands which can tell the ESC to do certain things."}, {"start": 255.68, "end": 262.7, "text": "Now the three variants of DSHOT, DSHOT 150, 300, and 600, relate to how fast the packets are sent."}, {"start": 262.7, "end": 267.82, "text": "DSHOT 600 is the fastest that Betaflight supports. DSHOT 150 is the slowest."}, {"start": 268.28, "end": 272.76, "text": "And you might think, well, of course I want the fastest, right? Isn't faster better?"}, {"start": 273.06, "end": 280.02, "text": "And it is true that DSHOT 600 will have lower latency from the Flight Controller to the ESC than DSHOT 150."}, {"start": 280.34, "end": 288.59999999999997, "text": "The disadvantage of the higher DSHOTs is that, well, if you go back far enough, some ESCs just didn't support the faster ones."}, {"start": 288.6, "end": 296.28000000000003, "text": "That's not true anymore. Essentially, all modern ESCs support DSHOT 600 and even higher, although Betaflight doesn't go any higher than 600."}, {"start": 296.64000000000004, "end": 299.12, "text": "But all ESCs can support DSHOT 600."}, {"start": 299.12, "end": 311.3, "text": "The main reason that you might choose a slower one is if you have had to reduce your PID loop rate for some reason, which we'll talk about in another video,"}, {"start": 311.54, "end": 321.08, "text": "8K PID loop DSHOT 600 is sort of the right one to choose because the latency of DSHOT 600 is similar to the latency of the 8K PID loop."}, {"start": 321.24, "end": 328.24, "text": "If you're running a 4K PID loop, then DSHOT, there isn't a lot of benefit to using DSHOT 600, and you may as well use DSHOT 300."}, {"start": 328.24, "end": 332.04, "text": "And if you went down to 2K, I suppose you would use DSHOT 150."}, {"start": 332.32, "end": 335.32, "text": "So the DSHOT that you choose depends on your PID loop rate."}, {"start": 335.56, "end": 343.54, "text": "The other thing to keep in mind is sometimes if your motor signals are getting corrupted, like your ESCs don't start up at the same time,"}, {"start": 343.6, "end": 349.0, "text": "you hear doo-doo-doo-doo-doo-doo-doo-doo-doo-doo-doo-doo, they're sort of out of sync,"}, {"start": 349.40000000000003, "end": 355.96000000000004, "text": "then dropping down from DSHOT 600 to 300 can make the signal a little bit more robust and solve that problem."}, {"start": 355.96, "end": 359.32, "text": "But generally, you'll choose your DSHOT based on your PID loop rate."}, {"start": 359.53999999999996, "end": 361.94, "text": "Continuing to work our way down here, motor stop."}, {"start": 362.09999999999997, "end": 367.5, "text": "Normally, when you arm a freestyle quad or racing quad, the motors begin spinning immediately."}, {"start": 368.06, "end": 371.91999999999996, "text": "That is not how camera platforms usually work."}, {"start": 372.29999999999995, "end": 375.14, "text": "With camera platforms, the way it usually works is you arm the quad,"}, {"start": 375.14, "end": 379.65999999999997, "text": "and then when you raise the throttle, it starts the motors and begins to take off."}, {"start": 380.38, "end": 383.97999999999996, "text": "If you want to emulate that behavior, you can enable motor stop,"}, {"start": 384.2, "end": 388.46, "text": "and then the quad will not spin the motors until you raise the throttle."}, {"start": 388.9, "end": 389.53999999999996, "text": "Don't do this."}, {"start": 389.78, "end": 395.5, "text": "If you're new to freestyle quads and racing quads, it may seem a little bit weird, but this is just how we do it."}, {"start": 395.62, "end": 398.14, "text": "And the reason we do it this way is that when you're flying,"}, {"start": 398.28, "end": 400.64, "text": "quite a lot of the time with a freestyle and racing drone,"}, {"start": 400.91999999999996, "end": 403.08, "text": "you will drop the throttle all the way down to zero."}, {"start": 403.08, "end": 406.78, "text": "And if you have motor stop enabled, when you do that,"}, {"start": 406.91999999999996, "end": 410.09999999999997, "text": "the quad will stop the motors and fall out of the air, and you'll lose control."}, {"start": 410.46, "end": 412.4, "text": "With camera platforms, you don't do that."}, {"start": 412.5, "end": 415.28, "text": "You've always got the throttle raised until the moment that you land."}, {"start": 415.53999999999996, "end": 418.41999999999996, "text": "So don't use motor stop unless you're building a camera platform,"}, {"start": 418.53999999999996, "end": 420.58, "text": "in which case, why are you using Betaflight?"}, {"start": 421.76, "end": 422.82, "text": "Anyway, that's up to you."}, {"start": 423.09999999999997, "end": 425.53999999999996, "text": "Now, though we're not talking about the configuration tab yet,"}, {"start": 425.62, "end": 427.76, "text": "there is one thing I need to show you,"}, {"start": 427.82, "end": 432.44, "text": "and that is if in the configuration tab you have air mode enabled,"}, {"start": 432.44, "end": 435.18, "text": "then motor stop will have no effect."}, {"start": 435.36, "end": 438.74, "text": "It will still be here, but it will always be disabled."}, {"start": 439.56, "end": 441.4, "text": "Air mode overrides motor stop."}, {"start": 441.74, "end": 443.82, "text": "So if you're trying to get motor stop to work,"}, {"start": 444.12, "end": 447.42, "text": "and it's not having any effect, it may be because air mode is enabled."}, {"start": 447.58, "end": 448.1, "text": "What's air mode?"}, {"start": 448.18, "end": 450.76, "text": "Well, we'll talk about that when we get to the configuration tab."}, {"start": 450.9, "end": 451.78, "text": "ESC sensor."}, {"start": 451.78, "end": 456.09999999999997, "text": "If you have an ESC that does BL-Heli32 ESC telemetry,"}, {"start": 456.47999999999996, "end": 460.05999999999995, "text": "ESC sensor tells the flight controller that that is going to be the case."}, {"start": 460.47999999999996, "end": 462.84, "text": "And then when you enable ESC sensor,"}, {"start": 463.11999999999995, "end": 466.47999999999996, "text": "you also have the option here in the power and battery tab"}, {"start": 466.47999999999996, "end": 470.96, "text": "to choose ESC sensor as your current and your voltage meter source."}, {"start": 471.08, "end": 474.76, "text": "So you can get battery voltage and current data from the ESC."}, {"start": 474.76, "end": 479.44, "text": "There's a reason why I don't think this is useful for most people."}, {"start": 479.78, "end": 482.32, "text": "I've got a video about why BL-Heli32 telemetry."}, {"start": 482.74, "end": 484.2, "text": "I'm not too concerned about it."}, {"start": 484.28, "end": 486.53999999999996, "text": "I'll put it down in the video description if you want to check it out."}, {"start": 486.82, "end": 488.82, "text": "But if you are trying to use it,"}, {"start": 489.15999999999997, "end": 493.06, "text": "you will need to enable that option here in this tab."}, {"start": 493.3, "end": 495.44, "text": "Next, we come to bidirectional D-shot."}, {"start": 495.58, "end": 498.52, "text": "This is potentially one of the most important options"}, {"start": 498.52, "end": 502.84, "text": "you can enable in order to get the best flight performance out of your quadcopter."}, {"start": 502.84, "end": 508.53999999999996, "text": "Bidirectional D-shot allows the ESC to send motor RPM"}, {"start": 508.53999999999996, "end": 512.14, "text": "back to the flight controller with extremely low latency."}, {"start": 512.4399999999999, "end": 516.3, "text": "What that means is that the flight controller can filter out the motor RPM"}, {"start": 516.3, "end": 520.3399999999999, "text": "and get rid of that vibration or noise, as we say, very effectively."}, {"start": 520.68, "end": 523.86, "text": "You absolutely want bidirectional D-shot if your ESC supports it."}, {"start": 523.98, "end": 529.12, "text": "All BL-Heli32 ESCs from firmware 32.7 and newer support bidirectional D-shot,"}, {"start": 529.12, "end": 533.46, "text": "which any ESC you buy today, any BL-Heli32 ESC is going to support that."}, {"start": 534.0, "end": 536.78, "text": "And BL-Heli S-ESCs don't support it,"}, {"start": 536.92, "end": 540.92, "text": "but there is a firmware called BlueJ you can flash to most BL-Heli S-ESCs"}, {"start": 540.92, "end": 544.02, "text": "that enables bidirectional D-shot, and I highly advise you to do that."}, {"start": 544.38, "end": 546.16, "text": "I have a video about how to flash BlueJ,"}, {"start": 546.36, "end": 548.34, "text": "and I'll put it in the video description as well."}, {"start": 548.72, "end": 550.72, "text": "You definitely want this enabled."}, {"start": 550.94, "end": 552.8, "text": "If you enable bidirectional D-shot,"}, {"start": 552.8, "end": 556.3599999999999, "text": "then you're also going to see this motor poles option appear."}, {"start": 556.8199999999999, "end": 560.0999999999999, "text": "In order for bidirectional D-shot and RPM filtering to work correctly,"}, {"start": 560.3399999999999, "end": 563.8399999999999, "text": "the flight controller needs to know how many magnets your motor has."}, {"start": 564.2199999999999, "end": 568.38, "text": "The number is going to be 14 for typical 5-inch, 6-inch, 7-inch,"}, {"start": 568.4599999999999, "end": 569.9799999999999, "text": "and even a little bit smaller motors."}, {"start": 570.0999999999999, "end": 573.06, "text": "But if you're uncertain, just literally pick the quad up,"}, {"start": 573.42, "end": 575.5999999999999, "text": "turn it over, rotate the motor in your hands,"}, {"start": 575.68, "end": 578.1999999999999, "text": "and count the magnets on the inside of the bell."}, {"start": 578.4599999999999, "end": 581.18, "text": "Next, we come to the motor idle percent value."}, {"start": 581.18, "end": 584.3399999999999, "text": "And this is the lowest throttle value"}, {"start": 584.3399999999999, "end": 586.4599999999999, "text": "that the flight controller will send to the motors."}, {"start": 586.8199999999999, "end": 590.0999999999999, "text": "The idea is that if the throttle value sent to the motors is too low,"}, {"start": 590.2199999999999, "end": 592.0799999999999, "text": "the motor will stall and stutter,"}, {"start": 592.26, "end": 595.0799999999999, "text": "and if that happens in flight, the quad could fall out of the air."}, {"start": 595.28, "end": 599.76, "text": "So you need to have a minimum idle value that keeps the motor moving,"}, {"start": 600.12, "end": 603.5, "text": "even under sort of adverse airflow conditions."}, {"start": 603.6999999999999, "end": 607.0799999999999, "text": "The default for Betaflight, I believe, is 5.5%."}, {"start": 607.0799999999999, "end": 609.0999999999999, "text": "You sometimes can go a little bit lower."}, {"start": 609.4399999999999, "end": 610.4799999999999, "text": "Why would you want to go lower?"}, {"start": 610.48, "end": 614.4200000000001, "text": "Because the lower the idle value, like if you're inverted,"}, {"start": 614.6800000000001, "end": 618.04, "text": "and you have a high idle value, it will pull you down toward the ground."}, {"start": 618.4, "end": 623.62, "text": "Whereas if you have a lower idle value, you can hang inverted for longer."}, {"start": 624.04, "end": 627.02, "text": "A lower idle value also lets you drop faster."}, {"start": 627.14, "end": 629.86, "text": "When you drop throttle, if you have a high idle value,"}, {"start": 630.04, "end": 632.2, "text": "you will float more and drop slower."}, {"start": 632.44, "end": 634.9, "text": "Whereas with a lower idle value, you will drop faster."}, {"start": 634.9, "end": 640.1, "text": "A higher idle value gives you better prop wash handling during turns."}, {"start": 641.34, "end": 645.3199999999999, "text": "And the reason for that is that motors have more torque at higher throttle."}, {"start": 645.74, "end": 649.34, "text": "So if you drop the throttle all the way down as low as it can possibly go,"}, {"start": 649.5799999999999, "end": 650.86, "text": "the motor won't have a lot of torque,"}, {"start": 650.9599999999999, "end": 656.64, "text": "and it will have a harder time dealing with difficult handling conditions like sharp turns."}, {"start": 656.64, "end": 660.58, "text": "So some racers will actually turn this idle value up to 7 or 8%."}, {"start": 660.58, "end": 664.56, "text": "Many freestyle pilots try and get it down as low as 2 or 3%"}, {"start": 664.56, "end": 667.4399999999999, "text": "so they get that nice hang time and clean drops."}, {"start": 667.44, "end": 677.0200000000001, "text": "I don't recommend that you use this because Betaflight 4.3 has a setting called dynamic idle value."}, {"start": 677.74, "end": 682.5, "text": "And if you use dynamic idle, it overrides the static idle value and works better."}, {"start": 682.86, "end": 685.34, "text": "And we'll talk more about that when we get to the PID tuning tab."}, {"start": 685.9000000000001, "end": 689.2600000000001, "text": "But that's what the idle percent is."}, {"start": 689.5200000000001, "end": 695.72, "text": "The 3D option allows you to reverse the motors while you are in flight,"}, {"start": 695.72, "end": 698.6, "text": "allowing the quadcopter to fly upside down."}, {"start": 698.72, "end": 701.4200000000001, "text": "And that's going to sound a little confusing if you've never heard of it."}, {"start": 701.5, "end": 705.8000000000001, "text": "Basically what happens is that center throttle means that the motors are idled."}, {"start": 706.08, "end": 709.5400000000001, "text": "And then if you raise the throttle, the quadcopter flies up."}, {"start": 709.62, "end": 712.86, "text": "And if you lower the throttle below 50%, it pushes down."}, {"start": 713.0600000000001, "end": 717.52, "text": "So you can literally flip the quad over and hover upside down or fly around upside down"}, {"start": 717.52, "end": 719.96, "text": "and lets you do all kinds of crazy acro stuff."}, {"start": 720.1800000000001, "end": 724.64, "text": "If you enable this option, you have to also change the motor direction"}, {"start": 724.64, "end": 726.92, "text": "in BLHeli in the ESC."}, {"start": 727.0, "end": 729.84, "text": "You can't just enable this option and leave your ESCs alone."}, {"start": 729.92, "end": 730.42, "text": "It won't work."}, {"start": 730.78, "end": 734.74, "text": "I have a video about setting up 3D and I'll link it down in the video description."}, {"start": 734.98, "end": 737.48, "text": "I did it on a little tiny whoop so I didn't have much to lose."}, {"start": 737.86, "end": 738.86, "text": "And it was pretty fun."}, {"start": 739.42, "end": 740.8, "text": "Most people don't do this though."}, {"start": 741.54, "end": 743.18, "text": "So if you've never heard of this, that's probably why."}, {"start": 743.3, "end": 746.4399999999999, "text": "Now that we've set these options up, the motors are capable of spinning."}, {"start": 746.4399999999999, "end": 751.16, "text": "But they won't spin until we change one of the other options on the page."}, {"start": 751.16, "end": 754.36, "text": "Before I tell you what that is, could I ask you to go down and hit the like button?"}, {"start": 755.16, "end": 755.86, "text": "I'm sure it means a lot."}, {"start": 756.0, "end": 756.3199999999999, "text": "Thank you."}, {"start": 756.98, "end": 757.18, "text": "Okay."}, {"start": 757.9, "end": 759.18, "text": "I understand the risks."}, {"start": 759.48, "end": 761.1999999999999, "text": "The propellers are removed."}, {"start": 761.9, "end": 763.4, "text": "Do you understand the risks?"}, {"start": 763.76, "end": 771.02, "text": "If we go and look over in the setup tab, we can see the MSP arming status flag."}, {"start": 771.12, "end": 775.5799999999999, "text": "The MSP flag is telling us that stands for multi-way serial protocol."}, {"start": 775.78, "end": 779.68, "text": "And it means that we are talking to the configurator and we cannot arm the quad."}, {"start": 779.68, "end": 786.62, "text": "If we go to the motors tab and we enable this option, then when we go back to the setup tab,"}, {"start": 786.66, "end": 789.4, "text": "you will see that the MSP flag is gone."}, {"start": 789.7399999999999, "end": 792.12, "text": "And now we can spin the motors."}, {"start": 793.02, "end": 796.7399999999999, "text": "So your props better be off or you could get in trouble."}, {"start": 796.9399999999999, "end": 802.1999999999999, "text": "Now, when I enable that option, these sliders are going to become enabled."}, {"start": 802.1999999999999, "end": 804.54, "text": "But currently the sliders don't do anything."}, {"start": 804.9599999999999, "end": 806.88, "text": "Those sliders are used to spin the motors."}, {"start": 806.9799999999999, "end": 808.4799999999999, "text": "We have four motors, one, two, three, four."}, {"start": 808.48, "end": 811.84, "text": "We can see where those motors are by looking at the mixer diagram."}, {"start": 812.32, "end": 818.64, "text": "And we can raise these sliders and it shows the output value that the motor would be receiving."}, {"start": 818.9, "end": 821.9, "text": "But it's not spinning because we don't have a battery plugged in."}, {"start": 821.98, "end": 823.46, "text": "You can't spin the motors off of USB."}, {"start": 823.62, "end": 825.04, "text": "You've got to plug a battery in."}, {"start": 825.26, "end": 826.16, "text": "So let's do that."}, {"start": 826.38, "end": 830.46, "text": "And now you can see that if I raise those sliders, the motors will begin to spin."}, {"start": 830.72, "end": 833.38, "text": "Let me show you some shortcuts here for working with these sliders."}, {"start": 833.38, "end": 841.82, "text": "If I click on the slider and then use the up arrow, it'll raise slowly, like one at a time."}, {"start": 842.16, "end": 848.76, "text": "If I press page up and page down, it'll go up and down in increments."}, {"start": 849.12, "end": 853.46, "text": "And if I do home and end, it'll go all the way to full and all the way to zero."}, {"start": 853.46, "end": 856.08, "text": "You'd think home would take it all the way to full."}, {"start": 858.72, "end": 865.26, "text": "Well, it looks like end takes it to full and home takes it to zero, which I'm pretty sure is backwards from how it used to be."}, {"start": 865.32, "end": 865.9200000000001, "text": "But there you go."}, {"start": 866.76, "end": 868.0600000000001, "text": "Don't do what I just did."}, {"start": 868.72, "end": 874.6600000000001, "text": "Taking the throttle from zero all the way instantaneously to 100% is not great."}, {"start": 874.66, "end": 878.9599999999999, "text": "I mean, it shouldn't hurt anything, but it's not great."}, {"start": 879.26, "end": 880.3, "text": "And it's not a good..."}, {"start": 880.3, "end": 881.78, "text": "Don't do that if you can point it."}, {"start": 881.98, "end": 883.0, "text": "Use page up and page down."}, {"start": 883.7199999999999, "end": 889.26, "text": "So each of these sliders controls the individual motors, and then the master slider spins all four motors."}, {"start": 889.6, "end": 893.9, "text": "As we're doing that, we can also see an error percent here."}, {"start": 894.24, "end": 897.88, "text": "Now, that error percent only is visible if you're using bidirectional D-shot,"}, {"start": 897.88, "end": 903.28, "text": "because if you're not using bidirectional D-shot, the flight controller sends commands to the ESC,"}, {"start": 903.28, "end": 907.76, "text": "and then it has no idea if the ESC got them or if it didn't, just sends the commands and cross your fingers."}, {"start": 908.22, "end": 911.24, "text": "So bidirectional D-shot is super useful for troubleshooting."}, {"start": 911.5799999999999, "end": 915.76, "text": "As a rule of thumb, you want to see this error percent be less than 1%."}, {"start": 915.76, "end": 917.8399999999999, "text": "Well, you want it to be 0%."}, {"start": 917.8399999999999, "end": 919.74, "text": "It should almost always be 0%."}, {"start": 919.74, "end": 928.6999999999999, "text": "But if it's slightly more than 0%, as long as it's less than 1%, you could fly and not consider yourself to have a serious problem."}, {"start": 929.16, "end": 931.86, "text": "If any of these error percents are more than about 1%,"}, {"start": 931.86, "end": 936.28, "text": "something is wrong with your hardware, your signal wire, something is messed up, you should not fly the quad."}, {"start": 936.76, "end": 942.44, "text": "And notice that it's 0% here, but, like, it might, if I had a problem with electrical noise,"}, {"start": 942.86, "end": 947.12, "text": "start having an issue when I start, like, arm the quad or something."}, {"start": 948.08, "end": 950.54, "text": "But am I staying at 0% as you would hope."}, {"start": 950.54, "end": 954.3399999999999, "text": "The other thing that we're seeing is the RPM of the motors."}, {"start": 954.5799999999999, "end": 956.0999999999999, "text": "And that's what this R is here."}, {"start": 956.78, "end": 962.9, "text": "And you can see that RPM is moving slightly as the motors have small differences in their speed."}, {"start": 962.9, "end": 968.92, "text": "You might also be surprised that the motors aren't spinning at exactly the same RPM,"}, {"start": 969.28, "end": 972.1999999999999, "text": "given that they're getting the exact same throttle signal."}, {"start": 972.5799999999999, "end": 976.4, "text": "And the reason for that is that there's small manufacturing variances in the motors."}, {"start": 976.76, "end": 983.6999999999999, "text": "They are not exactly the same KV, and therefore sending them the same throttle signal produces small variances in RPM."}, {"start": 983.7, "end": 992.34, "text": "In my experience, a difference in RPM of maybe 1 to 200 RPM is normal for, like, motors in this class."}, {"start": 992.5, "end": 995.12, "text": "More than that could be an indication of a problem."}, {"start": 995.22, "end": 1000.82, "text": "In other words, if we raise the master slider, and we see that some of these motors are spinning at about 3,500 RPM,"}, {"start": 1001.0, "end": 1007.12, "text": "but then one of them is spinning at, like, 3,000 or 2,800 RPM, that motor might be screwed up."}, {"start": 1007.12, "end": 1012.62, "text": "Now, I want to go back to this error percent, because I want you to see that if I unplug the battery,"}, {"start": 1014.64, "end": 1017.28, "text": "the error percent is going to go to 100%."}, {"start": 1017.28, "end": 1021.0, "text": "If you see your error percent at 100% and your ESC is powered up,"}, {"start": 1021.1, "end": 1025.34, "text": "what it probably means is that your ESC doesn't support bidirectional D-shot."}, {"start": 1025.46, "end": 1029.04, "text": "It could be that the flight controller is unplugged or something in theory."}, {"start": 1029.04, "end": 1034.94, "text": "But most often, that's going to be a BL-Heli S ESC, which needs Blue Jay flash to it,"}, {"start": 1035.18, "end": 1036.68, "text": "and that's why you would see that."}, {"start": 1036.68, "end": 1041.16, "text": "Now, you may be a little bit surprised to see this gyro readout scale here,"}, {"start": 1041.3200000000002, "end": 1044.8, "text": "and that's just showing me, as if I move the quad or tap the table,"}, {"start": 1044.9, "end": 1048.8400000000001, "text": "we can see a readout of the vibration that the quad is experiencing."}, {"start": 1049.04, "end": 1050.44, "text": "Why is that on the motors tab?"}, {"start": 1050.8600000000001, "end": 1055.24, "text": "Because a good way to test for a bad motor,"}, {"start": 1055.6000000000001, "end": 1056.94, "text": "I told you you could look at the RPM."}, {"start": 1057.3600000000001, "end": 1061.02, "text": "Another thing you can do is you can look at the vibration that the motor creates."}, {"start": 1061.44, "end": 1065.18, "text": "So if I enable the slider here, what I'm going to do is I'm going to reset,"}, {"start": 1065.18, "end": 1068.4, "text": "and I'm going to look at the XYZ values."}, {"start": 1068.8, "end": 1071.78, "text": "And what I'm seeing here is the max value in parentheses"}, {"start": 1071.78, "end": 1073.94, "text": "and the current value here on the left."}, {"start": 1074.1000000000001, "end": 1078.8600000000001, "text": "And you can see the max value is about 0.98 Gs for all three of them."}, {"start": 1079.0600000000002, "end": 1082.9, "text": "And then the RMS, the root mean square, is sort of the average for all three axes,"}, {"start": 1083.0, "end": 1085.0600000000002, "text": "and that's 0.4 roughly."}, {"start": 1085.06, "end": 1088.58, "text": "What I'm then going to do is I'm going to raise the slider"}, {"start": 1088.58, "end": 1094.96, "text": "and bring it back down again."}, {"start": 1095.08, "end": 1097.8999999999999, "text": "And I'm going to look at the amount of vibration that that motor created."}, {"start": 1098.4199999999998, "end": 1102.12, "text": "And in fact, I have one of these motors that's been dinged up really badly."}, {"start": 1102.28, "end": 1103.8, "text": "Yes, that's the one."}, {"start": 1103.94, "end": 1105.04, "text": "That's motor number one."}, {"start": 1105.56, "end": 1108.3, "text": "And that motor is in okay shape."}, {"start": 1108.3, "end": 1112.72, "text": "And that was about 3.4, 2.2, and 1.7 Gs."}, {"start": 1112.82, "end": 1117.06, "text": "If we then look at this banged up motor, which is motor number three,"}, {"start": 1117.24, "end": 1118.36, "text": "we should see a difference."}, {"start": 1118.44, "end": 1119.4199999999998, "text": "So let's reset that."}, {"start": 1123.3799999999999, "end": 1123.86, "text": "Bingo."}, {"start": 1124.3799999999999, "end": 1128.52, "text": "Do you see that we have 6.1 on the Z axis, 2.9 and 1.46?"}, {"start": 1128.8799999999999, "end": 1131.94, "text": "So we've got significantly more vibration from that motor,"}, {"start": 1132.3, "end": 1135.04, "text": "and it's got visible damage, so I'm not surprised to see that."}, {"start": 1135.3999999999999, "end": 1137.4199999999998, "text": "That's what that gyro scale is for."}, {"start": 1137.42, "end": 1141.5600000000002, "text": "Lastly, let's come down to the motor direction and the reorder motors wizards."}, {"start": 1141.66, "end": 1145.18, "text": "These are new in Betaflight 4.3, and they are so, so helpful."}, {"start": 1145.54, "end": 1147.4, "text": "We're going to start with reorder motors."}, {"start": 1147.64, "end": 1151.1200000000001, "text": "And the reason we might do this would be if the flight controller"}, {"start": 1151.1200000000001, "end": 1155.26, "text": "was not mounted facing forward or the ESC was rotated."}, {"start": 1156.5800000000002, "end": 1160.24, "text": "If I hit reorder motors, the first thing I need to do is acknowledge the risk"}, {"start": 1160.24, "end": 1163.6000000000001, "text": "and then start the motor remapping wizard."}, {"start": 1164.18, "end": 1166.98, "text": "The flight controller is going to spin one of the motors,"}, {"start": 1166.98, "end": 1169.76, "text": "and I'm going to click on whichever motor is spinning."}, {"start": 1170.56, "end": 1175.6, "text": "Now, in this case, it's all correct because this quadcopter has been set up correctly."}, {"start": 1175.96, "end": 1178.92, "text": "But if you had a case where an ESC was mounted,"}, {"start": 1179.22, "end": 1183.28, "text": "not mounted facing the expected direction or something like that,"}, {"start": 1183.44, "end": 1186.64, "text": "then this reorder motors wizard would sort it all out for you."}, {"start": 1186.72, "end": 1188.34, "text": "And when you're done, you just hit save."}, {"start": 1188.34, "end": 1191.06, "text": "The motor direction wizard does the same thing,"}, {"start": 1191.4199999999998, "end": 1195.24, "text": "but it checks for the motor spinning the correct direction."}, {"start": 1195.76, "end": 1196.9199999999998, "text": "And there's two ways to do this."}, {"start": 1197.0, "end": 1200.62, "text": "One is with the wizard, which will reset all of the motor spin directions"}, {"start": 1200.62, "end": 1202.56, "text": "and let you pick which one to reverse,"}, {"start": 1202.9199999999998, "end": 1206.62, "text": "or individually where it leaves the setting as it is"}, {"start": 1206.62, "end": 1208.3, "text": "and you check each motor individually."}, {"start": 1208.3, "end": 1212.3, "text": "The key thing is that if you have previously set a quad up and you run the wizard,"}, {"start": 1212.58, "end": 1216.3799999999999, "text": "it will wipe your previous motor directions and set them all back to normal."}, {"start": 1216.7, "end": 1220.04, "text": "So I normally do individually, and I just pick one motor,"}, {"start": 1220.72, "end": 1222.4199999999998, "text": "and I look at the direction it's spinning."}, {"start": 1222.94, "end": 1226.1, "text": "Or sometimes if I can't tell, I'll just put my finger against it"}, {"start": 1226.1, "end": 1229.8, "text": "and see which way it's dragging."}, {"start": 1230.02, "end": 1231.58, "text": "Okay, so that's dragging that way."}, {"start": 1231.58, "end": 1236.8999999999999, "text": "So this one is spinning counterclockwise, counterclockwise, and that is correct."}, {"start": 1237.24, "end": 1240.26, "text": "If we need to reverse it, we can just hit reverse here,"}, {"start": 1240.5, "end": 1241.82, "text": "and it will change the direction."}, {"start": 1242.46, "end": 1244.1599999999999, "text": "And we can do that for all four of the motors"}, {"start": 1244.1599999999999, "end": 1248.3999999999999, "text": "to make sure they match the direction that we see here in the diagram."}, {"start": 1248.6599999999999, "end": 1253.04, "text": "By the way, that motor reverse setting is stored in the ESC."}, {"start": 1253.6399999999999, "end": 1256.4399999999998, "text": "So if you swap a flight controller,"}, {"start": 1256.86, "end": 1260.08, "text": "you do not need to redo that setting."}, {"start": 1260.22, "end": 1261.3, "text": "It will be preserved."}, {"start": 1261.3, "end": 1263.68, "text": "The motor direction will be preserved in the ESC."}, {"start": 1263.84, "end": 1266.8, "text": "But if you swap an ESC, you would need to rerun that wizard."}, {"start": 1267.1599999999999, "end": 1270.9199999999998, "text": "So to sum up, the general way that I go through this tab is,"}, {"start": 1271.24, "end": 1272.34, "text": "number one, set the mixer."}, {"start": 1272.52, "end": 1274.48, "text": "Obviously, it's usually going to be quad X."}, {"start": 1275.0, "end": 1277.6599999999999, "text": "Decide whether you want props in or props out rotation."}, {"start": 1277.9199999999998, "end": 1279.08, "text": "Set your motor protocol."}, {"start": 1279.4199999999998, "end": 1281.82, "text": "Enable bidirectional D-shot if at all possible."}, {"start": 1282.08, "end": 1283.46, "text": "Check your motor poles are correct."}, {"start": 1283.6599999999999, "end": 1285.96, "text": "Leave the motor idle alone because we're going to set that"}, {"start": 1285.96, "end": 1287.34, "text": "when we get to the PID tuning tab."}, {"start": 1287.62, "end": 1288.52, "text": "We're not going to mess with that."}, {"start": 1288.52, "end": 1292.18, "text": "And then run the reorder motors wizard to check the motor order."}, {"start": 1292.48, "end": 1295.34, "text": "And then run the motor direction wizard to check the motor direction."}, {"start": 1295.84, "end": 1296.56, "text": "And you're good."}, {"start": 1296.7, "end": 1299.94, "text": "Next up, I think it's time to go to the configuration tab."}, {"start": 1300.04, "end": 1301.28, "text": "We've waited long enough."}, {"start": 1301.74, "end": 1304.46, "text": "I'm going to put a card on screen with a link to that video,"}, {"start": 1304.46, "end": 1308.26, "text": "as well as a card on screen with a link to the whole playlist for this series."}, {"start": 1308.26, "end": 1312.18, "text": "If you want to start from the beginning and learn about all this stuff."}, {"start": 1312.5, "end": 1313.44, "text": "Thanks so much for watching."}, {"start": 1313.56, "end": 1314.08, "text": "I'll see you there."}]}