{"video_id": "3xe-g35SmEY", "url": "https://www.youtube.com/watch?v=3xe-g35SmEY", "title": "3xe-g35SmEY", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 4.94, "text": "The last video where I tested the different materials you would use for a panel and a speaker"}, {"start": 4.94, "end": 8.82, "text": "did well, so I thought I would take it a little bit further and test the stuffing"}, {"start": 8.82, "end": 14.620000000000001, "text": "that you will put inside the box, typically, when you're building a speaker. And I should say up"}, {"start": 14.620000000000001, "end": 20.1, "text": "front that there's a little bit of confusion surrounding these videos. I'm talking from a"}, {"start": 20.1, "end": 24.78, "text": "do-it-yourself standpoint here. I'm talking directly to people that build their own speakers"}, {"start": 24.78, "end": 30.880000000000003, "text": "and treat their own rooms or do stuff like that. Not go out and buy a certain product or"}, {"start": 30.880000000000003, "end": 39.480000000000004, "text": "a certain piece of gear or equipment. This is almost entirely 100% for the DIY type person."}, {"start": 40.6, "end": 48.0, "text": "The stuffing that I'm going to be testing is the ever-popular polyfill. That's a mouthful. And you"}, {"start": 48.0, "end": 52.5, "text": "can see that I'm weighing it, and that's because this is exactly how much polyfill I have on hand."}, {"start": 52.5, "end": 59.7, "text": "So I want the other two materials to match that, which is 58 grams. Now I'm not a big fan of polyfill."}, {"start": 60.28, "end": 67.82, "text": "I always thought it was not effective. It was just kind of a placebo. You put it in a box,"}, {"start": 67.98, "end": 73.76, "text": "you say it's stuffed, but it's not really. Because the stuff is kind of too light, in my opinion."}, {"start": 74.24000000000001, "end": 82.42, "text": "I've always preferred fiberglass as a stuffing. Okay, even invented boxes. Okay, so the next one is"}, {"start": 82.5, "end": 87.34, "text": "the fiberglass I talked about. And I'm using the scale to get the right amount of that because I"}, {"start": 87.34, "end": 92.04, "text": "definitely have a lot of that on hand. And the last one is rockwool. And once again,"}, {"start": 92.04, "end": 96.22, "text": "I'll be weighing that to get the right amount to put in the box so that they're all equal in weight."}, {"start": 97.0, "end": 102.74000000000001, "text": "Okay, not in the space that they take up because rockwool is definitely heavier, denser,"}, {"start": 102.74, "end": 106.46, "text": "takes up less space. Also, I changed my test."}, {"start": 112.28, "end": 115.56, "text": "This isolates it from the workbench and cleans up the bottom end a lot."}, {"start": 116.08, "end": 121.36, "text": "But it doesn't in any way invalidate what I found in the last set of measurements,"}, {"start": 121.69999999999999, "end": 126.17999999999999, "text": "because everything came through clearly in that. You can see the differences in the panels."}, {"start": 126.18, "end": 131.84, "text": "And we really weren't seeing very much happening down low anyway. So the first set of measurements"}, {"start": 131.84, "end": 137.84, "text": "is with the box empty, like before. And this will be the baseline, you could say, the one that"}, {"start": 137.84, "end": 146.26000000000002, "text": "we'll compare everything else with. And because there was also a little bit of confusion about this"}, {"start": 146.26000000000002, "end": 152.54000000000002, "text": "last time, I'm going to talk about the test setup I have here. How I'm doing these measurements is"}, {"start": 152.54, "end": 159.72, "text": "with this accelerometer, which is taped to the top of the box. This measures how much the panel vibrates"}, {"start": 159.72, "end": 168.66, "text": "in and out when the speaker is moving. So that energy from the speaker is transferred to the panel"}, {"start": 168.66, "end": 175.66, "text": "and the panel vibrates and the accelerometer measures that and then it plots it on the computer"}, {"start": 175.66, "end": 182.44, "text": "for every frequency from 30 hertz right up to 2000 hertz. You see the magnitude of that"}, {"start": 182.44, "end": 188.16, "text": "movement. The higher the peaks are, the more that panel is moving. With the empty box measurement done,"}, {"start": 188.57999999999998, "end": 195.2, "text": "I can put in the first stuffing sample. And I'm going with polyfill for the first one. And I'm"}, {"start": 195.2, "end": 199.96, "text": "putting it in half the speaker, the side that doesn't have the driver. And I'm also making sure that the"}, {"start": 199.96, "end": 206.5, "text": "stuffing actually touches the panel when I put the panel back on. I had a few comments in the last"}, {"start": 206.5, "end": 213.2, "text": "video about, you know, why would the stuffing actually, you know, damp the panel. And what happens"}, {"start": 213.2, "end": 219.6, "text": "with the stuffing being in the box, whether it's touching the panel or not, is it absorbs some of"}, {"start": 219.6, "end": 227.06, "text": "the energy from the driver as the driver is operating. And therefore, it can't reach the panel."}, {"start": 227.06, "end": 234.8, "text": "So the more energy that the stuffing absorbs, the less will reach the panels."}, {"start": 234.8, "end": 246.76, "text": "The results from the polyfill come as no surprise to me. It kind of confirms what I was thinking all"}, {"start": 246.76, "end": 252.26, "text": "along. There's a little bit of a change up higher. And overall, there's a little bit of a drop in"}, {"start": 252.26, "end": 263.06, "text": "output from the panel, but not a huge amount. So I took that out and I put the fiberglass in and I"}, {"start": 263.06, "end": 266.82, "text": "ran the test again. And here are the results from that."}, {"start": 271.28, "end": 277.08, "text": "Once again, not a huge change, but obviously better than the polyfill, especially up higher."}, {"start": 277.71999999999997, "end": 281.96, "text": "And across the board, there was a, you know, a better reduction in output from the panel."}, {"start": 282.26, "end": 297.5, "text": "Then I took out the fiberglass and I put in the rock wool and I tested it again."}, {"start": 304.5, "end": 311.44, "text": "And I'm looking at that right here. And there's really not a huge difference between this"}, {"start": 311.44, "end": 319.21999999999997, "text": "and the fiberglass. So I'm going to call it a tie between the two. So that takes care of the three"}, {"start": 319.21999999999997, "end": 324.88, "text": "stuffings. And there are other options for that, of course, but I don't have any. But I do have"}, {"start": 324.88, "end": 332.76, "text": "something to damp the panel directly. And that is one eighth inch thick rubber that I can glue right"}, {"start": 332.76, "end": 340.36, "text": "onto the panel in two places. So it avoids that brace in the middle. And I use spray adhesive to put"}, {"start": 340.36, "end": 345.84000000000003, "text": "these on. And I also clamped on a piece of plywood for about an hour to make sure that it was well"}, {"start": 345.84000000000003, "end": 351.08000000000004, "text": "stuck on there. It wasn't going to come loose. And then I tested it. And here you can see the results."}, {"start": 353.58000000000004, "end": 360.84000000000003, "text": "This actually had less of an effect than I thought it would. In reality, it doesn't look any better than"}, {"start": 360.84, "end": 367.21999999999997, "text": "the original measurement, not overall. I mean, we still have some pretty big peats up higher."}, {"start": 367.78, "end": 371.4, "text": "And there was no overall reduction in the output down lower."}, {"start": 371.4, "end": 385.23999999999995, "text": "So I peeled that off again. And I put a shim on top of the brace so that when I put the panel back in"}, {"start": 385.23999999999995, "end": 390.32, "text": "place, it will be making contact with that brace and effectively cut the panel size in half so that"}, {"start": 390.32, "end": 395.03999999999996, "text": "it's well braced and tested it again. And here are the results from that."}, {"start": 395.04, "end": 407.46000000000004, "text": "This shows some significant reduction down low. Also, there's a big dip at 650 that certainly can't"}, {"start": 407.46000000000004, "end": 415.14000000000004, "text": "hurt. But there are still some higher peaks. So overall, I can't say that that is much of an"}, {"start": 415.14000000000004, "end": 422.88, "text": "improvement over the original. Got major peaks around 900 and 1800 hertz. And those are potentially"}, {"start": 422.88, "end": 429.64, "text": "more audible than anything you'd find down low. So going from that, I decided to try something else."}, {"start": 429.84, "end": 435.74, "text": "And that would be doubling up the panel. So I put the layer of MDF that I had on the side,"}, {"start": 435.9, "end": 443.5, "text": "on top of the oak plywood layer, and tested it again. And here you can see the results from that."}, {"start": 443.5, "end": 457.6, "text": "That shows significant reduction down low, around 200 to 300. Same, got a bit of a dip between 300 and"}, {"start": 457.6, "end": 466.16, "text": "800. But our 900 hertz resonance is still there. And we're still seeing something around 1800. But"}, {"start": 466.16, "end": 472.1, "text": "there is quite a valley in between those two. So that is an improvement overall."}, {"start": 473.0, "end": 479.28000000000003, "text": "I've got one more thing to try though. And that's what's known as CLD, constrained layer damping."}, {"start": 479.8, "end": 485.70000000000005, "text": "That's where you take a panel and you glue it to another panel with a flexible adhesive in between."}, {"start": 486.12, "end": 492.04, "text": "In my case, I'm using silicone. I'll spread that on liberally. And then I'll sandwich the other panel"}, {"start": 492.04, "end": 497.18, "text": "on top. I'm staying with the MDF. And there's no harm in testing it while it's wet. So I'll do that"}, {"start": 497.18, "end": 499.52000000000004, "text": "right away. And we can look at the results here."}, {"start": 508.52000000000004, "end": 515.1800000000001, "text": "Even though you're not reducing as much down low, the response is flatter overall, as in you're losing"}, {"start": 515.18, "end": 523.16, "text": "more up in the high end, which is, I think is better overall. So that was yesterday when I ran all those"}, {"start": 523.16, "end": 530.76, "text": "tests and the silicone wasn't dry. I've left it to dry overnight. And now I can test it again"}, {"start": 530.76, "end": 533.6999999999999, "text": "with the dry. And we'll look at those results."}, {"start": 533.7, "end": 546.7800000000001, "text": "Okay, well, I got them right in front of me. So I can talk about them right here right now. And you can"}, {"start": 546.7800000000001, "end": 555.88, "text": "see them as I'm talking. And when I compare them directly to how it looked when it was wet, there's"}, {"start": 555.88, "end": 563.2800000000001, "text": "not a significant difference. But there's a definite improvement overall. So if you're looking for the"}, {"start": 563.28, "end": 571.48, "text": "ultimate way to build your speakers, so that you're going to reduce the amount of output from the"}, {"start": 571.48, "end": 581.18, "text": "panels, I would say that it would be a combination of the correct stuffing on the inside. I would avoid"}, {"start": 581.18, "end": 588.9599999999999, "text": "polyfill unless you can pack it in there to make up for the, you know, the lightness of it. Also use"}, {"start": 588.96, "end": 595.1, "text": "bracing. I wouldn't say as much as you can, because what happens when you use too much bracing is you,"}, {"start": 595.44, "end": 602.0600000000001, "text": "you can actually make separate boxes inside boxes, and you get different resonances inside the box,"}, {"start": 602.0600000000001, "end": 608.2, "text": "which can be a problem. You have to be very careful about that. I would say, you know, use bracing where"}, {"start": 608.2, "end": 614.2800000000001, "text": "it's needed to cut panels down to size. Like when you put a brace in the middle of a panel,"}, {"start": 614.28, "end": 619.42, "text": "you're cutting the panel in half. You're making two smaller panels instead of one larger one."}, {"start": 620.0799999999999, "end": 626.4, "text": "And then to put the icing on the cake, you could do this CLD technique, which seems to be quite"}, {"start": 626.4, "end": 631.6, "text": "effective at reducing the magnitude of the vibrations right across the board."}]}