{"video_id": "4dmrahCJonM", "url": "https://www.youtube.com/watch?v=4dmrahCJonM", "title": "4dmrahCJonM", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 6.96, "text": "Hello and welcome to the video. This is a video all about flight controllers and it's aimed at"}, {"start": 6.96, "end": 11.82, "text": "those of you that have had nothing to do with flight controllers but have been trying to watch"}, {"start": 11.82, "end": 16.56, "text": "some of my other series and may be getting lost very quickly. Now this was really brought home"}, {"start": 16.56, "end": 22.080000000000002, "text": "the need for this video over the past week or so with two incidents. First of all I've been working"}, {"start": 22.080000000000002, "end": 28.2, "text": "here in my man cave with a friend of mine and we're building him an autonomous wing. He's just"}, {"start": 28.2, "end": 34.08, "text": "recently learnt to fly FPV and now he wants to have all that iNav goodness so he can do GPS return"}, {"start": 34.08, "end": 40.92, "text": "to home. He wants an on-screen display but we didn't have a model for him that would work like that."}, {"start": 41.16, "end": 46.2, "text": "So what he asked was when you're building it can I kind of come and sit with you and you can explain"}, {"start": 46.2, "end": 50.120000000000005, "text": "what you're doing and how it all works. I thought you know what that's really interesting because I"}, {"start": 50.120000000000005, "end": 55.260000000000005, "text": "don't have a video for that and that was followed up only the other day by a patron of mine kind of"}, {"start": 55.26, "end": 60.239999999999995, "text": "getting in touch just saying look I love all the videos and stuff but the build videos I get"}, {"start": 60.239999999999995, "end": 66.3, "text": "completely lost. So if you know anything about flight controllers or have done any flight controller"}, {"start": 66.3, "end": 71.56, "text": "setups and you've followed along and done any builds then you know what this video isn't for you go and"}, {"start": 71.56, "end": 78.66, "text": "do something else and watch something more useful. If however you are one of those pilots that watch a lot"}, {"start": 78.66, "end": 86.7, "text": "are videos on things like flight controllers, iNav, Betaflight, ArduPilot with planes, quadcopters,"}, {"start": 86.84, "end": 92.52, "text": "multi-rotors and you're desperately trying to follow along but it's all not making a lot of sense"}, {"start": 92.52, "end": 97.1, "text": "then stay with me. This video is exactly aimed at you."}, {"start": 98.8, "end": 104.56, "text": "Now let's first of all talk about what a flight controller does. Now normally in let's take an example"}, {"start": 104.56, "end": 110.7, "text": "of a radio controlled plane. The way it works is that we have the receiver and then all the servos"}, {"start": 110.7, "end": 116.14, "text": "and the speed controller for the motor if it's electric plug into the receiver directly. Now with"}, {"start": 116.14, "end": 120.38, "text": "a flight controller that is a little bit of electronics that sits between the receiver"}, {"start": 120.38, "end": 126.06, "text": "and everything else on the model and the flight controller is pretty clever. It actually controls"}, {"start": 126.06, "end": 133.08, "text": "all of the servos and ESCs and makes the model fly and what it's doing is it's listening to what you"}, {"start": 133.08, "end": 138.16000000000003, "text": "want the model to do from the signals coming in from the radio receiver so it knows where all your"}, {"start": 138.16000000000003, "end": 144.68, "text": "throttle, aileron, elevator, rudder and bits and pieces are and then it's feeling through its own"}, {"start": 144.68, "end": 151.28, "text": "onboard sensors how the model is moving and then translating that into what needs to happen with"}, {"start": 151.28, "end": 157.08, "text": "either the control surfaces or the speed controllers to actually give you what you're asking for on the"}, {"start": 157.08, "end": 163.06, "text": "controls. Now simple stabilizers for fixed wing kind of do a mini light version of that but flight"}, {"start": 163.08, "end": 168.66000000000003, "text": "controllers modern flight controllers in particular are much more capable of doing some pretty"}, {"start": 168.66000000000003, "end": 173.78, "text": "impressive stuff as well as basic flight stabilization. Some of the most advanced flight"}, {"start": 173.78, "end": 179.82000000000002, "text": "controllers out there so things that are running iNav flight and things that are running RD pilot"}, {"start": 179.82000000000002, "end": 187.28, "text": "can be set up to fly completely autonomously so you can upload a mission to it and then it'll just fly"}, {"start": 187.28, "end": 193.64000000000001, "text": "it all itself and do everything. So there's a broad range of stuff here and again don't worry about the"}, {"start": 193.64000000000001, "end": 199.02, "text": "jargon too much I'm going to try and keep it to a minimum as we go through the slides. So the flight"}, {"start": 199.02, "end": 204.52, "text": "controller itself is a little bit of hardware it looks like a little circuit board normally but if"}, {"start": 204.52, "end": 209.7, "text": "you're looking at the latest Pixhawk family it can look like a little black cube stuck on top of a board"}, {"start": 209.7, "end": 217.61999999999998, "text": "full of connections. Now this is actually a little computer it has a CPU it has memory it has IO ports"}, {"start": 217.61999999999998, "end": 223.38, "text": "so it is like a little computer that you would use every day to do your email or access the web or"}, {"start": 223.38, "end": 232.7, "text": "whatever but this hardware this little PCB board needs some firmware to run on it a program if you want"}, {"start": 232.7, "end": 239.39999999999998, "text": "to think of it like that that actually does all of the work. So the the flight controller has all of the"}, {"start": 239.4, "end": 244.34, "text": "pieces of a computer and you're loading the software on it that software because it kind of lives on the"}, {"start": 244.34, "end": 250.92000000000002, "text": "board is called firmware and that's what things like iNav, Betaflight, RD pilot are actually that's"}, {"start": 250.92000000000002, "end": 256.66, "text": "actually the firmware that you have to flash or load onto the flight controller. Very few flight"}, {"start": 256.66, "end": 261.64, "text": "controllers come with that stuff already on or if they do it's typically an older version that you need"}, {"start": 261.64, "end": 267.42, "text": "to update anyway and that's commonly what I do in my build videos in the very early part I kind of update"}, {"start": 267.42, "end": 273.52000000000004, "text": "the firmware or the software bit onto the hardware flight controller so that those two bits go together."}, {"start": 273.96000000000004, "end": 280.94, "text": "The third part in this trinity is usually a program that goes onto your computer and that program is"}, {"start": 280.94, "end": 287.64, "text": "used to flash or upload the firmware onto the hardware flight controller but then is also used to set"}, {"start": 287.64, "end": 293.42, "text": "everything up and calibrate things like the radio and other pieces so when with those three things"}, {"start": 293.42, "end": 299.76, "text": "together the hardware the firmware that's loaded onto the hardware and the pc application that you"}, {"start": 299.76, "end": 304.84000000000003, "text": "run on your computer those three things work together to make the flight control system."}, {"start": 305.56, "end": 311.22, "text": "Now there are loads and loads of flight controller options I started out in the very early days on this"}, {"start": 311.22, "end": 316.38, "text": "channel with something called multi-Wii which sound rude but it isn't. So things like the multi-Wii,"}, {"start": 316.38, "end": 325.32, "text": "APM, CC3D, NAZI32 they were stuff that was in vogue five six years ago you don't want to be using any of"}, {"start": 325.32, "end": 330.32, "text": "those don't touch them with a barge pole. These days you want to be looking at flight controllers that"}, {"start": 330.32, "end": 337.44, "text": "have a relatively modern CPU so that's an F4 based flight controller and that's what the F4, F7 is"}, {"start": 337.44, "end": 344.3, "text": "actually referring to it's how powerful the flight controller CPU is that's actually on the little"}, {"start": 344.3, "end": 351.64, "text": "PCB board and with modern flight control firmware it needs more and more processing power in order to"}, {"start": 351.64, "end": 358.04, "text": "run so these days an F4 board is kind of the minimum F7 and H7 which is even more powerful"}, {"start": 358.04, "end": 363.54, "text": "are becoming the norm so those are the kind of things that you need to look at. With the explosion of the"}, {"start": 363.54, "end": 368.34000000000003, "text": "multicopter revolution lots and lots of flight controllers these days are built so that you can"}, {"start": 368.34000000000003, "end": 375.82000000000005, "text": "attach the four ESCs on the corners and build a quadcopter and I've used quite a lot of them on the"}, {"start": 375.82000000000005, "end": 383.12, "text": "channel and some flight controllers need a separate power distribution board or PDB that you connect all"}, {"start": 383.12, "end": 387.90000000000003, "text": "the power into that's where the battery connects to and the ESCs connect to as well and it maybe"}, {"start": 387.90000000000003, "end": 393.14000000000004, "text": "passes the voltage around and also typically that board then plugs into the flight controller"}, {"start": 393.14, "end": 399.21999999999997, "text": "and the flight controller then can monitor the voltage and currents that are being used to keep"}, {"start": 399.21999999999997, "end": 403.62, "text": "track of how much battery is left so that's the other part of the system that you might come across"}, {"start": 403.62, "end": 410.84, "text": "but most modern flight controllers these days are what are called all-in-one or AIO boards they have"}, {"start": 410.84, "end": 416.41999999999996, "text": "that power distribution board they have all the flight controller bits all the pads that you need"}, {"start": 416.42, "end": 423.38, "text": "actually on board and some flight controllers are what are called all-in-one or AIO flight controllers"}, {"start": 423.38, "end": 429.58000000000004, "text": "and they have all the pieces on one little circuit board everywhere where you connect your servos or"}, {"start": 429.58000000000004, "end": 435.04, "text": "your speed controllers or things like the battery power and the power connections for the ESCs inside"}, {"start": 435.04, "end": 441.78000000000003, "text": "the model as well all-in-one boards make for really clean simple installations and I'm a big fan of those"}, {"start": 441.78, "end": 445.71999999999997, "text": "because it means you have one board that does everything rather than two or three boards that"}, {"start": 445.71999999999997, "end": 451.64, "text": "you have to try and fit inside your model there are different kinds of flight controllers and some"}, {"start": 451.64, "end": 457.71999999999997, "text": "of them are suited as I've just mentioned to some applications rather than others some of them are"}, {"start": 457.71999999999997, "end": 463.38, "text": "multi-purpose so if they've got lots of connections for outputs for things like servos and speed controllers"}, {"start": 463.38, "end": 468.55999999999995, "text": "then they could be used in pretty much anything but you tend to find that they tend to be specialized"}, {"start": 468.56, "end": 475.62, "text": "so the all-in-one boards typically tend to be aimed at multi-rotors but some of the matek boards are"}, {"start": 475.62, "end": 482.62, "text": "built specifically for wings so do watch the build videos on the channel for the ones that I'm using"}, {"start": 482.62, "end": 486.76, "text": "because I'm always trying to use the latest and greatest and use flight controllers that I haven't"}, {"start": 486.76, "end": 492.9, "text": "done before to show how they all go together some of the larger flight controllers that are designed for"}, {"start": 492.9, "end": 497.8, "text": "more complex installations where you're going to have things like GPS external compasses"}, {"start": 497.8, "end": 504.6, "text": "airspeed sensors lidar sonar sensors those kind of things will have lots of what are called UARTs"}, {"start": 504.6, "end": 510.6, "text": "I'm going to talk about some of the three and four letter acronyms on a slide in a minute and those are"}, {"start": 510.6, "end": 517.0600000000001, "text": "just places where you can plug stuff in typically the smaller boards will only have pads or pins for a"}, {"start": 517.0600000000001, "end": 524.64, "text": "very small number of those kind of UARTs or I squared C ports I squared C is a is another system again we'll talk"}, {"start": 524.64, "end": 530.1, "text": "about this in a minute but it's just the way that you connect all these external parts onto it it may"}, {"start": 530.1, "end": 535.1999999999999, "text": "be for a simple quadcopter you don't need any of that you just need to install the receiver on one"}, {"start": 535.1999999999999, "end": 541.8199999999999, "text": "side and then you can connect the four ESC motor connections on the corner of an all-in-one flight"}, {"start": 541.8199999999999, "end": 548.1999999999999, "text": "controller and you're done but typically you're going to add some FPV stuff and I'll talk about that"}, {"start": 548.2, "end": 554.6800000000001, "text": "towards the end let me talk a little bit about what flight controllers actually do so we've talked"}, {"start": 554.6800000000001, "end": 558.86, "text": "about the fact that the flight controller sits in the middle of the radio receiver and all of the"}, {"start": 558.86, "end": 564.96, "text": "flight control systems on the plane so speed controllers servos or whatever now the flight"}, {"start": 564.96, "end": 569.5200000000001, "text": "controller can do almost nothing and typically the way it works is the flight controller does all the"}, {"start": 569.5200000000001, "end": 576.5400000000001, "text": "mixing for you so if you have a V-tail plane or you have a quadcopter you're only sending"}, {"start": 576.54, "end": 582.1999999999999, "text": "that you want to maybe roll to the right via the radio the flight controller is then figuring out"}, {"start": 582.1999999999999, "end": 589.0, "text": "which motors need to slow down which ones need to speed up and feeling with its accelerometers and"}, {"start": 589.0, "end": 595.8, "text": "gyroscopes on board how that movement is happening and comparing it to how you said you want it happening"}, {"start": 595.8, "end": 600.6999999999999, "text": "in the software and all that comes together and it kind of does it now there are some common modes that"}, {"start": 600.6999999999999, "end": 604.74, "text": "you're going to come across when you're talking about flight controllers so let me talk about four of the"}, {"start": 604.74, "end": 612.78, "text": "basic ones first one is what's called angle mode now angle mode is like a self-stabilization mode if"}, {"start": 612.78, "end": 618.66, "text": "you want to think of it like that it usually has a limit on the pitch and roll of the aircraft so you"}, {"start": 618.66, "end": 624.46, "text": "can't turn it over you can't get into too much trouble and with angle mode if you take your hands"}, {"start": 624.46, "end": 630.4, "text": "off the sticks it will normally auto level the vehicle whether that's a fixed wing model or it's a"}, {"start": 630.4, "end": 637.5, "text": "multi-motor horizon is angle mode with extras so horizon will act like angle mode if you're just"}, {"start": 637.5, "end": 643.18, "text": "flying gently but if you push the sticks right to the edge of their travel on your radio then it will"}, {"start": 643.18, "end": 650.22, "text": "overcome that limit that you've got of pitch and roll and you're and it will actually then start to"}, {"start": 650.22, "end": 655.4399999999999, "text": "be able to flip and roll so angle is very much for beginners and for learning to fly I would suggest"}, {"start": 655.44, "end": 662.7, "text": "or I still use it sometimes these days for gentle cruising horizon is when you want to start being a"}, {"start": 662.7, "end": 667.5400000000001, "text": "little bit more aggressive maybe you want to do loops and rolls and flips in the model that you're"}, {"start": 667.5400000000001, "end": 673.6800000000001, "text": "doing next one is sometimes called manual mode or rate mode that's where you don't want any real"}, {"start": 673.6800000000001, "end": 679.4200000000001, "text": "help from the flight controller apart from the mixing that it's doing again you know you're only using one"}, {"start": 679.4200000000001, "end": 685.0, "text": "stick on the radio but it might be affecting several motors and a multi-rotor in fact it almost certainly"}, {"start": 685.0, "end": 691.96, "text": "will be or it will be moving particular controls on the on the fixed wing model and in rate and"}, {"start": 691.96, "end": 699.86, "text": "manual mode is doing the absolute basic for you so it's like the very basic stuff that a stabilizer"}, {"start": 699.86, "end": 706.88, "text": "would do in a traditional fixed wing model and then finally if you are adding things like a gps and"}, {"start": 706.88, "end": 713.66, "text": "using stuff like iNav or iDoPilot then you can do some really cool stuff you can do things like gps loiter"}, {"start": 713.66, "end": 719.42, "text": "where you can kind of park the vehicle in the sky with a plane it will just circle around a particular"}, {"start": 719.42, "end": 726.8199999999999, "text": "point it was at when you initiated gps hold or loiter you can also do gps return to home so in the"}, {"start": 726.8199999999999, "end": 733.26, "text": "event of a problem or fail safe it'll actually fly back to you and with a multi-rotor with iNav or"}, {"start": 733.26, "end": 740.8, "text": "iDoPilot it'll actually then land automatically and disarm itself as well so again you don't have to"}, {"start": 740.8, "end": 746.3599999999999, "text": "have really complicated systems with lots of things added onto it and plugged in you can be very basic"}, {"start": 746.3599999999999, "end": 751.8199999999999, "text": "the builds that i tend to do i tend to like to show how you add all those extra things and then if you"}, {"start": 751.8199999999999, "end": 756.5, "text": "wanted to you could and we'll talk a little bit more about the differences between things like"}, {"start": 756.5, "end": 763.28, "text": "Betaflight iNav and iDoPilot in a minute so let me cover some more of these three and four letter"}, {"start": 763.28, "end": 771.1, "text": "acronyms first one we'll talk about what called uarts these uarts are usually four pads on a flight"}, {"start": 771.1, "end": 775.78, "text": "controller these are the plus five volts of ground a transmitter receive typically you're going to plug"}, {"start": 775.78, "end": 782.76, "text": "things like gps or telemetry radios into them they are universal so you can have them running at"}, {"start": 782.76, "end": 788.02, "text": "different speeds with different protocols they are fantastic so some of the really big modern flight"}, {"start": 788.02, "end": 796.0, "text": "controllers have lots of uart ports available and you can plug lots of things into it the next one"}, {"start": 796.0, "end": 803.5, "text": "that you'll see me talk about is i squared c or iic it's a bus architecture that you can plug lots of"}, {"start": 803.5, "end": 811.02, "text": "different things in now external compasses tend to run on i squared c but other sensors can now you can"}, {"start": 811.02, "end": 817.1999999999999, "text": "have multiple things connected into one i squared c connection because it's like a little computer network"}, {"start": 817.2, "end": 823.5600000000001, "text": "with a uart that we've just talked about it tends to be a uart is dedicated for one specific peripheral"}, {"start": 823.5600000000001, "end": 829.48, "text": "whether that's a telemetry radio or a gps or something else but they're just both of them"}, {"start": 829.48, "end": 834.96, "text": "just ways that you can connect other devices to your flight controller and get them to work"}, {"start": 834.96, "end": 840.48, "text": "s bus is the most common protocol you're going to come across these days it's the protocol or the way"}, {"start": 840.48, "end": 845.1800000000001, "text": "that the receiver talks to the flight controller and sends the information about where all the controls"}, {"start": 845.18, "end": 853.88, "text": "are on the radio that's in your hand there are lots of other options available there's fpaw i bus crsf"}, {"start": 853.88, "end": 859.8399999999999, "text": "loads of other different ways that people can use but s bus is probably going to be the most common"}, {"start": 859.8399999999999, "end": 865.92, "text": "and s bus is really only used in these days to just get the signals from your receiver"}, {"start": 865.92, "end": 872.2199999999999, "text": "into the flight controller s bus is really good because it's a digital signal and that digital signal"}, {"start": 872.22, "end": 877.88, "text": "means you can error check and there's also extra things around all the channel positions so the flight"}, {"start": 877.88, "end": 883.88, "text": "controller can see when there's a problem an error or a fail safe condition and take appropriate action"}, {"start": 883.88, "end": 889.3000000000001, "text": "and that fail safe condition might be return to home fly back to you and land at your feet if you've got"}, {"start": 889.3000000000001, "end": 895.5, "text": "things like a gps connected so let me talk a little bit now about the different firmwares that you're probably"}, {"start": 895.5, "end": 900.24, "text": "going to come across if you watch any of the builds on the series let me talk about the three most common"}, {"start": 900.24, "end": 905.1800000000001, "text": "ones that you're going to bump into watching stuff on youtube the first one and probably this one's"}, {"start": 905.1800000000001, "end": 910.44, "text": "got the most video by far and away is going to be beta flight now beta flights been around for a while"}, {"start": 910.44, "end": 916.84, "text": "and it tends to be focused on multi-rotor racing so it's really aimed at that it's all about giving"}, {"start": 916.84, "end": 924.8, "text": "the most locked in feel and the fastest responses for flying a quadcopter typically very quickly"}, {"start": 924.8, "end": 930.6999999999999, "text": "it's not very good and lots of things outside of that so it doesn't really care about fixed wing"}, {"start": 930.6999999999999, "end": 938.14, "text": "it has very limited gps functionality but if you are looking for a quadcopter and you want to fly it"}, {"start": 938.14, "end": 945.62, "text": "without lots of extra sensors on it then beta flight with a little all-in-one flight controller is going to"}, {"start": 945.62, "end": 954.24, "text": "be a great choice next one is iNav flight commonly referred to as iNav now iNav and beta flight had a common"}, {"start": 954.24, "end": 962.0600000000001, "text": "ancestor and iNav rather than just focus on the quadcopter side went away to focus initially on"}, {"start": 962.0600000000001, "end": 969.9, "text": "all the gps flight modes so in iNav if you want gps functionality it has an awful lot of that stuff"}, {"start": 969.9, "end": 975.36, "text": "sorted out it's great for loitering return to home it'll even fly autonomous missions you can program"}, {"start": 975.36, "end": 980.08, "text": "that upload it into the flight controller and the flight controller will just take off and do its own"}, {"start": 980.08, "end": 988.1600000000001, "text": "flight it is probably not as polished as beta flight in terms of the high-end performance for"}, {"start": 988.1600000000001, "end": 995.36, "text": "things like quadcopter racing but it is absolutely great also at fixed wing and i tend to if i'm"}, {"start": 995.36, "end": 1002.4000000000001, "text": "building a fixed wing these days use iNav if if i just want a nice clean simple installation that"}, {"start": 1002.4000000000001, "end": 1008.32, "text": "supports all the modern protocols the last one that you'll see on my channel is something called"}, {"start": 1008.32, "end": 1014.96, "text": "ardupilot now ardupilot originally was just for things like the apm hardware and pixfork and the"}, {"start": 1014.96, "end": 1022.5600000000001, "text": "ardupilot family consists of things like arducopter ardurover arduplane ardusub so there's lots of"}, {"start": 1022.5600000000001, "end": 1028.64, "text": "different versions of it depending on what you want to fly so whereas with beta flight it's really just"}, {"start": 1028.64, "end": 1036.8, "text": "quad well multi rotors with iNav it's fixed wing and multi rotors with ardupilot it is all kinds of"}, {"start": 1036.8, "end": 1041.44, "text": "stuff now iNav at the moment are developing also for things like rovers and other platforms as"}, {"start": 1041.44, "end": 1049.04, "text": "well which is exciting but ardupilot has been doing it for a very long time now in terms of bulletproof"}, {"start": 1049.04, "end": 1056.1599999999999, "text": "code ardupilot is right up there and i did a couple of builds last year putting ardupilot onto non-pixfork"}, {"start": 1056.1599999999999, "end": 1061.44, "text": "technology because they support third-party boards now things like the omnibus and the matek flight"}, {"start": 1061.44, "end": 1069.76, "text": "controllers and adding things like the uh telemetry radials adding things like the gps using things"}, {"start": 1069.76, "end": 1077.1200000000001, "text": "like uarts and i squared c ports have been a fantastic experience for me here i'm a big fan of ardupilot"}, {"start": 1077.1200000000001, "end": 1083.8400000000001, "text": "but it hasn't got the support for all the modern protocols and isn't as slick on things like fpv"}, {"start": 1083.8400000000001, "end": 1088.4, "text": "where you're adding some kind of contextual information over the view from the camera in"}, {"start": 1088.4, "end": 1094.96, "text": "your goggles all that stuff is relatively new and if you want to control your video transmitter using"}, {"start": 1094.96, "end": 1101.6000000000001, "text": "smartport or tramp or you want to support lots of the new technologies like crsf which is a low latency"}, {"start": 1101.6000000000001, "end": 1108.72, "text": "connection that team black sheep developed the other two support that stuff ardupilot doesn't yet"}, {"start": 1109.2800000000002, "end": 1113.0400000000002, "text": "if you're interested in knowing more about that hopefully that gives you a bit of context and you"}, {"start": 1113.04, "end": 1118.3999999999999, "text": "can go and watch the series on the channel go and have a look in the playlist and there's lots and"}, {"start": 1118.3999999999999, "end": 1124.08, "text": "lots of builds using all this technology to show you the differences last thing i'll talk about which"}, {"start": 1124.08, "end": 1131.28, "text": "i've touched on a little bit is fpv now fpv is where you are going to fly by looking out live through a"}, {"start": 1131.28, "end": 1138.08, "text": "little camera mounted at the front of the model now in planes or multi rotors you can just have the"}, {"start": 1138.08, "end": 1142.56, "text": "camera connected to a video transmitter that sends the signal to your goggles and you can watch it and"}, {"start": 1142.56, "end": 1148.72, "text": "fly it first person view which is fpv stands for most modern flight controllers though are smarter than"}, {"start": 1148.72, "end": 1156.24, "text": "that you connect the video from the camera into the flight controller and then you connect a video out"}, {"start": 1156.24, "end": 1162.1599999999999, "text": "from the flight controller into the video transmitter that then sends it to the goggles and what the"}, {"start": 1162.1599999999999, "end": 1168.0, "text": "flight controller does very cleverly is overlays key flight information so flight time battery voltage"}, {"start": 1168.0, "end": 1174.24, "text": "distance from home if you have things like gps ground speed all the the flight mode that you're in"}, {"start": 1174.24, "end": 1180.32, "text": "all that goodness can be popped around the outside of the image and it's great for keeping an eye on how"}, {"start": 1180.32, "end": 1187.2, "text": "much time you've got left or whereabouts you are related to way to cough some flight controllers are more"}, {"start": 1187.2, "end": 1192.4, "text": "advanced with this than others so one of the flight controllers that i really like for example is the"}, {"start": 1192.4, "end": 1198.72, "text": "brain fpv flight controller that has a graphical on-screen display but flight controllers from"}, {"start": 1198.72, "end": 1205.3600000000001, "text": "people like matek holibro all those guys actually have an on-screen display and again it's the on-screen"}, {"start": 1205.3600000000001, "end": 1212.4, "text": "display supported by all three of the firmwares i've just talked about that's inav beta flight and"}, {"start": 1212.4, "end": 1218.48, "text": "ardupilot as well couple last things to think about the dji air unit doesn't work in exactly that way it"}, {"start": 1218.48, "end": 1224.24, "text": "works slightly differently at the moment the only support is really for beta flight for the dji air"}, {"start": 1224.24, "end": 1229.28, "text": "unit i'll link to the video that talks about that and the last point in this video is there are some"}, {"start": 1229.28, "end": 1234.0, "text": "flight controllers that have been around for a long time things like the pixhawk family don't have in"}, {"start": 1234.0, "end": 1240.72, "text": "built support for an on-screen display for fpv so unfortunately if you want that kind of stuff with fpv you"}, {"start": 1240.72, "end": 1247.1200000000001, "text": "have to use additional boards again see my builds with pixhawk where i show you how to do that"}, {"start": 1247.12, "end": 1252.3999999999999, "text": "so i'm going to stop there hopefully that's enough information for those of you new pilots who are"}, {"start": 1252.3999999999999, "end": 1256.7199999999998, "text": "interested in flight controllers but we're just getting lost in the build series and enough context"}, {"start": 1256.7199999999998, "end": 1261.36, "text": "so that you can go and watch them and it will make more sense a flight controller is just a little"}, {"start": 1261.36, "end": 1268.2399999999998, "text": "computer running some firmware on there that is then doing a lot of the flying for you how much of that"}, {"start": 1268.2399999999998, "end": 1275.4399999999998, "text": "you can decide by flicking a switch on your radio that selects the flight mode it can be very basic"}, {"start": 1275.44, "end": 1281.8400000000001, "text": "and just do the essentially what a stabilizer would do if you use that in a fixed wing or it can be"}, {"start": 1281.8400000000001, "end": 1287.8400000000001, "text": "super duper complex with gps airspeed sensors lidar and all those kind of other things and fly"}, {"start": 1287.8400000000001, "end": 1293.8400000000001, "text": "everything autonomously and you can get stuff that will do everything in between so if you have any"}, {"start": 1293.8400000000001, "end": 1299.04, "text": "questions or comments please pop them down below and i'll put links down below to some of my most recent"}, {"start": 1299.04, "end": 1304.16, "text": "build series so now hopefully armed with that understanding you can watch them and they'll make more sense"}, {"start": 1305.44, "end": 1310.96, "text": "thank you for watching my video and watching right to the very end if you want to find out what i'm"}, {"start": 1310.96, "end": 1315.8400000000001, "text": "currently working on you can follow me on social media by searching for painless 360 in the usual"}, {"start": 1315.8400000000001, "end": 1320.88, "text": "places if you'd like to become part of the inner circle then you can become a patreon details are in"}, {"start": 1320.88, "end": 1326.16, "text": "the description and you get lots of additional benefits check out the playlist section on the channel"}, {"start": 1326.16, "end": 1331.28, "text": "too i organize all of my videos into playlists and it's called something like introduction to or for"}, {"start": 1331.28, "end": 1336.16, "text": "beginners all of the content is aimed so that you can start the very beginning and it teaches you that"}, {"start": 1336.16, "end": 1349.68, "text": "subject starting with simple principles and moving up to teach you everything you need to know"}, {"start": 1349.68, "end": 1350.24, "text": "you"}]}