{"video_id": "4ObzEft2R_g", "url": "https://www.youtube.com/watch?v=4ObzEft2R_g", "title": "4ObzEft2R_g", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.2, "end": 4.5, "text": "In this video I'm going to show you how to build a simple audio amplifier that can power"}, {"start": 4.5, "end": 10.48, "text": "nearly any speaker. For less than $3 in parts it gets surprisingly loud. This tutorial was"}, {"start": 10.48, "end": 15.72, "text": "supported by The Great Courses Plus. In my previous videos about amplifiers I showed"}, {"start": 15.72, "end": 20.080000000000002, "text": "you how to make a simple op amp circuit that can power headphones and another one where"}, {"start": 20.080000000000002, "end": 24.72, "text": "I showed you how to make a powerful class D design. But what if you just want a simple"}, {"start": 24.72, "end": 29.68, "text": "amplifier that can drive a speaker without all the fancy switch mode circuitry? The LM"}, {"start": 29.68, "end": 35.44, "text": "386 is an all-in-one class AB audio amplifier chip and it's the easiest way to power a"}, {"start": 35.44, "end": 40.64, "text": "speaker. This chip has been around for decades and it's still used to this day in products"}, {"start": 40.64, "end": 45.4, "text": "like computer speakers and portable stereos. So everyone who works with electronics needs"}, {"start": 45.4, "end": 50.620000000000005, "text": "to know about this chip. The maximum power output is roughly 1 watt, which doesn't sound like"}, {"start": 50.620000000000005, "end": 55.379999999999995, "text": "much in a world full of deceptive marketing, but trust me, 1 watt going into a speaker is"}, {"start": 55.379999999999995, "end": 59.3, "text": "more than enough power to fill an entire living room full of sound."}, {"start": 59.3, "end": 64.38, "text": "The first thing you're going to need is a 3.5mm audio plug attached to a cable. There"}, {"start": 64.38, "end": 69.66, "text": "are many ways to get this. You could solder wires onto a plug, or cut up an extension cable,"}, {"start": 69.66, "end": 74.36, "text": "but I think the cheapest way to do this is to just cut up headphones from the dollar store."}, {"start": 74.36, "end": 78.92, "text": "After I was done being a stripper, I used some sandpaper to remove the insulation on the left"}, {"start": 78.92, "end": 83.58, "text": "and right signal wires. And I soldered on some thicker wire to make it easier to connect"}, {"start": 83.58, "end": 88.1, "text": "the cable to a breadboard. I also twisted the two ground wires together."}, {"start": 88.1, "end": 93.17999999999999, "text": "Next, we're going to implement the simplest possible stereo to mono conversion circuit."}, {"start": 93.17999999999999, "end": 97.89999999999999, "text": "It's just putting 1kohm resistors in series with the audio channels, then joining the"}, {"start": 97.89999999999999, "end": 103.08, "text": "ends together. Now, this is definitely not the best way to do stereo to mono, as we're"}, {"start": 103.08, "end": 107.91999999999999, "text": "just averaging the signals here, but the point of this project is to create the simplest amplifier"}, {"start": 107.91999999999999, "end": 114.17999999999999, "text": "possible, and this trick works surprisingly well. Next, you're going to need an LM386 chip."}, {"start": 114.18, "end": 118.68, "text": "They are so popular that you can get them from anywhere that sells electronic components."}, {"start": 118.68, "end": 122.88000000000001, "text": "If you want, you could get them from Amazon for less than a dollar apiece. Just make sure"}, {"start": 122.88000000000001, "end": 128.22, "text": "you get the DIP-8 version that's suitable for breadboarding, not the surface mount version."}, {"start": 128.22, "end": 132.76000000000002, "text": "I want you to be aware that there are a couple of versions of the LM386 out there that have"}, {"start": 132.76000000000002, "end": 140.58, "text": "different input voltage and output power ratings. For example, the LM386N-1 works from 4 to 12 volts,"}, {"start": 140.58, "end": 147.58, "text": "and the dash 4 works from 5 to 18 volts. For this project, I'm going to be using the LM386N-4."}, {"start": 147.58, "end": 152.58, "text": "It'll give you the flexibility to crank up the supply voltage for the full watt of power."}, {"start": 152.58, "end": 158.58, "text": "Ok, here's the partial schematic. For the power, I'm going to use a 9 volt battery, but I really"}, {"start": 158.58, "end": 164.58, "text": "recommend using something like a 12 volt lead acid battery, or a 12 volt wall adapter, because that'll let you turn up the volume"}, {"start": 164.58, "end": 169.58, "text": "louder without distortion, and this circuit can drain a 9 volt battery very quickly."}, {"start": 169.58, "end": 175.58, "text": "I also recommend putting a 100 microfarad capacitor in parallel with the power supply, reasonably close to the chip,"}, {"start": 175.58, "end": 180.58, "text": "so that the amplifier can instantly get the power it'll need for loud bass notes."}, {"start": 180.58, "end": 187.58, "text": "This capacitor is also used for filtering, and it'll help make sure that noise from the power supply doesn't get passed into the audio amplification circuitry."}, {"start": 187.58, "end": 195.58, "text": "47 microfarads or higher will work just fine, and I used 100 microfarads just because that's what I had available."}, {"start": 195.58, "end": 200.58, "text": "On the output of the LM386, you should put a 1000 microfarad capacitor or higher."}, {"start": 200.58, "end": 206.58, "text": "This will ensure that no DC voltage could possibly get passed into your speaker, which would damage it."}, {"start": 206.58, "end": 211.58, "text": "Don't be misled by crappy schematics that you find on the internet with low values like 100 microfarads."}, {"start": 211.58, "end": 217.58, "text": "You want to use at least 1000 microfarads to guarantee good bass with a wide variety of speakers."}, {"start": 217.58, "end": 222.58, "text": "If you want to know more about why, make sure you've watched my video on RC highpass filters."}, {"start": 222.58, "end": 224.58, "text": "Alright, let's power this thing up!"}, {"start": 232.58, "end": 234.58, "text": "Ugh, this metal sounds like Bieber."}, {"start": 234.58, "end": 237.58, "text": "Okay, so what's going on here?"}, {"start": 237.58, "end": 244.58, "text": "The schematic I'm showing you is very similar to other schematics on the internet, but as you know, you can't trust everything you see on the internet."}, {"start": 244.58, "end": 248.58, "text": "Let's look at the output on an oscilloscope to figure out what's going on."}, {"start": 248.58, "end": 257.58000000000004, "text": "Okay, so we have what looks like a normal audio waveform, but on top of it there's a large amount of noise."}, {"start": 257.58000000000004, "end": 260.58000000000004, "text": "And that's what's causing this horrible sound."}, {"start": 260.58000000000004, "end": 264.58000000000004, "text": "Zooming in on the noise, you can see that it's about 2.2 MHz."}, {"start": 264.58, "end": 270.58, "text": "That's literally 100 times higher than any frequency we should be seeing out of an audio amplifier."}, {"start": 270.58, "end": 277.58, "text": "It turns out that our amplifier is oscillating, and we need to get all of this high frequency garbage out of our feedback loop,"}, {"start": 277.58, "end": 280.58, "text": "so it's only amplifying audio frequencies."}, {"start": 280.58, "end": 286.58, "text": "Now, normally what you do here is add an RC highpass filter that'll send all the high frequency current to ground,"}, {"start": 286.58, "end": 289.58, "text": "so it can't interfere with the audio."}, {"start": 289.58, "end": 293.58, "text": "But I found an even simpler solution, and it works for all the speakers I tried it with."}, {"start": 293.58, "end": 300.58, "text": "You can just put a 0.1uF capacitor in parallel with the output, and it'll stop all the unwanted oscillation."}, {"start": 300.58, "end": 307.58, "text": "Now the amplifier sounds exactly as it should, and you can see that the high frequency oscillation is gone."}, {"start": 307.58, "end": 313.58, "text": "Now, to give you an idea of how loud this thing can go, I'm standing right next to the camera."}, {"start": 313.58, "end": 318.58, "text": "And this is what you can just pop in with my piano, you can do it."}, {"start": 318.58, "end": 321.58, "text": "And that's what you can do everywhere, you can do it now."}, {"start": 321.58, "end": 327.58, "text": "Next, I'd like to give you a couple of close-up shots of the breadboard, to give you some ideas of how you can build this thing."}, {"start": 327.58, "end": 332.58, "text": "Keeping the wires as short as possible is the best way to keep unwanted noise out of your circuit."}, {"start": 332.58, "end": 334.58, "text": "So yeah, that's it!"}, {"start": 334.58, "end": 341.58, "text": "For less than $3 in parts and a few minutes of your time, you can build an amplifier that'll work with any line-level audio source,"}, {"start": 341.58, "end": 344.58, "text": "like phones, MP3 players, and laptops."}, {"start": 344.58, "end": 347.58, "text": "Now, are you interested in learning more about electronics?"}, {"start": 347.58, "end": 349.58, "text": "Check out the Great Courses Plus."}, {"start": 349.58, "end": 354.58, "text": "It's a video streaming service with thousands of tutorial videos on every subject imaginable."}, {"start": 354.58, "end": 362.58, "text": "Science, cooking, photography, investing, programming, they've got courses that teach pretty much anything you'd ever want to know."}, {"start": 362.58, "end": 365.58, "text": "And most importantly, they have videos about electronics!"}, {"start": 365.58, "end": 368.58, "text": "I've checked out the lectures and it's good stuff."}, {"start": 368.58, "end": 374.58, "text": "All the animations are really helpful for understanding things, and it's way better than the old-school chalk-on-a-blackboard approach."}, {"start": 374.58, "end": 377.58, "text": "It's kind of like university without all the homework."}, {"start": 377.58, "end": 383.58, "text": "It's all original content, not just stuff that you can find on YouTube, and they add new videos every month."}, {"start": 383.58, "end": 390.58, "text": "I've worked out a deal where you can get a free month of unlimited video streaming by visiting thegreatcoursesplus.com slash afrotechmods,"}, {"start": 390.58, "end": 395.58, "text": "or just click on the link in the video description section to start your free trial."}, {"start": 395.58, "end": 396.58, "text": "Thanks everyone!"}]}