{"video_id": "AOf-i2vLd2o", "url": "https://www.youtube.com/watch?v=AOf-i2vLd2o", "title": "AOf-i2vLd2o", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 17.88, "text": "Welcome! The subject of this video is connecting power MOSFETs in parallel. I got an email from"}, {"start": 17.88, "end": 24.240000000000002, "text": "a visitor who was having all kinds of problems using one of my circuits when he connected"}, {"start": 24.24, "end": 40.379999999999995, "text": "MOSFETs in parallel. The question became with RG. RG is used with these MOSFETs to bleed off any static"}, {"start": 40.379999999999995, "end": 52.44, "text": "charge and thus enabling the MOSFET to cut completely off. Using them for one MOSFET is fine. I was using"}, {"start": 52.44, "end": 60.059999999999995, "text": "a value of 10k. That could of course be lowered. Here I'm going to explain the problems you're going"}, {"start": 60.059999999999995, "end": 69.24, "text": "to run into when you connect MOSFETs in parallel. Let's look at a value here. This is RG. But we"}, {"start": 69.24, "end": 75.06, "text": "have something else in here that's hidden that most people don't think of much. But it's in"}, {"start": 75.06, "end": 84.24000000000001, "text": "the spec sheets. It's called CGS or Capacitance Gate Source. We'll look a little closer at the"}, {"start": 84.24000000000001, "end": 97.5, "text": "structure of a MOSFET in a minute. But if you go to the IRF 630 spec sheet, CGS is 600 PF. On an IRF 520,"}, {"start": 97.5, "end": 112.92, "text": "CGS is 350 PF. Now, when you connect these MOSFETs in parallel, you've also connected this capacitance or this"}, {"start": 112.92, "end": 121.58, "text": "de facto capacitor that exists within these devices. You've connected all of those in parallel. And if you"}, {"start": 121.58, "end": 131.5, "text": "remember your circuit theory, parallel connected capacitors add. Why is this like that? Let's take a look."}, {"start": 133.57999999999998, "end": 140.7, "text": "This I got from International Rectifier. And you can see it on the website. This shows an"}, {"start": 140.7, "end": 149.57999999999998, "text": "in-channel MOSFET. You have an input resistance of some kind. You have a drive pulse or whatever they're"}, {"start": 149.58, "end": 158.22000000000003, "text": "using. And you notice something here. You have capacitance from the gate to the drain and gate"}, {"start": 158.22000000000003, "end": 165.18, "text": "to the source. And this creates all kinds of problems when you're putting in switching signals."}, {"start": 166.54000000000002, "end": 175.74, "text": "If you parallel these MOSFETs, well, you've multiplied your problem. Four of them in parallel. You've got four"}, {"start": 175.74, "end": 184.46, "text": "four times the capacitance. This interferes and distorts your drive signal. How did we get to this?"}, {"start": 187.10000000000002, "end": 196.70000000000002, "text": "Look at this drawing of a MOSFET from a silicon wafer point of view. The gate electrode is separated from"}, {"start": 196.7, "end": 207.33999999999997, "text": "the rest of the MOSFET by a very, very thin layer of silicon dioxide. It's a non-conductor. By definition,"}, {"start": 207.33999999999997, "end": 217.5, "text": "what is a capacitor? Two conductors separated by an insulator. So here you've got a capacitor formed from"}, {"start": 217.5, "end": 233.1, "text": "gate to source. When you turn it on and you create a region, a conductive region from source to drain."}, {"start": 234.14, "end": 241.34, "text": "Now you've got a gate separated by an insulator, which they even come out and call a dielectric,"}, {"start": 241.34, "end": 251.74, "text": "a conductive region. So there's what forms your capacitor. And that doesn't count stray inductance and"}, {"start": 251.74, "end": 252.62, "text": "other problems."}, {"start": 257.58, "end": 264.46, "text": "All right, before we get into the rest of this, I need to give you a brief review on how an I.O. pin"}, {"start": 264.46, "end": 274.94, "text": "in a typical microcontroller, such as Arduino or microchip pick, whatever you're using. I'm going to use a"}, {"start": 274.94, "end": 284.53999999999996, "text": "7414 to illustrate this. What we're interested in is the two output transistors. They're connected between"}, {"start": 284.53999999999996, "end": 294.38, "text": "VCC and ground. And how an I.O. pin works. If I want a high out, I'm going to switch on this."}, {"start": 294.62, "end": 300.06, "text": "upper transistor. And of course, there's going to be some kind of resistance through"}, {"start": 301.65999999999997, "end": 307.9, "text": "through the circuit, including the transistor itself. And the output's going to go high,"}, {"start": 307.9, "end": 317.17999999999995, "text": "and it should be near VCC. If I want to switch the output low, I'm going to switch on this lower"}, {"start": 317.18, "end": 325.02, "text": "transistor. And it's going to tie and it's going to connect this to ground. Of course, there's going"}, {"start": 325.02, "end": 335.18, "text": "to be some resistance through the transistor junctions, both high and low. And so this is not"}, {"start": 336.38, "end": 344.7, "text": "perfectly zero. This is not a zero path either to ground or to VCC. There is going to be some"}, {"start": 344.7, "end": 353.82, "text": "resistance. That's how a typical I.O. pin works, or transistor switch in general. So keep that in mind"}, {"start": 353.82, "end": 363.41999999999996, "text": "as I explain the next part of this. When you switch that I.O. pin on and off, and you're feeding the"}, {"start": 363.42, "end": 373.1, "text": "gate circuits of a bunch of MOSFETs, what you thought started out as a square wave due to capacitive"}, {"start": 373.1, "end": 380.06, "text": "charge and discharge is going to look like this. It's not going to turn on in a linear fashion. It's"}, {"start": 380.06, "end": 389.02, "text": "going to have a charge curve. This charge curve depends on the internal resistance of the transistors used in the"}, {"start": 389.98, "end": 398.7, "text": "drive source times the value of the input capacitance. Well, the more input capacitance you got,"}, {"start": 399.82, "end": 408.38, "text": "the longer and drawn out this charge curve is going to be. When you go to zero and switch on that lower"}, {"start": 408.38, "end": 415.1, "text": "transistor that we discussed, it's also going to have some kind of resistance and the capacitors that"}, {"start": 415.1, "end": 424.78, "text": "were charged up when it went high are going to also discharge, but not in a linear fashion. So due to all"}, {"start": 424.78, "end": 434.7, "text": "this input capacitance and other issues within the microcontroller I.O. pin, you're going to produce a"}, {"start": 434.7, "end": 441.5, "text": "charge curve which is going to play games with switching on the MOSFETs. Then you're going to have"}, {"start": 441.5, "end": 448.3, "text": "a discharge curve that's going to play games again with the MOSFETs, and the faster you try to switch"}, {"start": 448.3, "end": 456.78, "text": "it, the more problems you will have. Let's look at the chart that we're looking at now, and this is"}, {"start": 456.78, "end": 472.05999999999995, "text": "RC charge and discharge curves on how this works. You have a time period, we call it T, and that's based on the resistance times the capacitance."}, {"start": 472.85999999999996, "end": 479.58, "text": "The red line shows a charge curve, and a green line shows the discharge curve."}, {"start": 479.58, "end": 491.18, "text": "And you notice here on the bottom it goes from zero to five. Because this is a non-linear curve,"}, {"start": 492.7, "end": 498.86, "text": "this occurs, what you're doing is charging a capacitor essentially through a resistance,"}, {"start": 498.86, "end": 506.06, "text": "and discharging a capacitor through a resistance. What happens is your greatest current flow,"}, {"start": 506.06, "end": 513.34, "text": "zero, in fact about 62 percent of it, is going to be occurring during the first time period."}, {"start": 514.06, "end": 521.1, "text": "Because why? There's the greatest difference in voltage between the capacitor that started as zero,"}, {"start": 522.06, "end": 525.74, "text": "and the charging voltage which started at say VCC."}, {"start": 525.74, "end": 535.5, "text": "And one time period, R times C, you're going to charge up about 62, 63 percent of the way."}, {"start": 536.7, "end": 549.26, "text": "But now the charging rate drops steeply. By the time you get into 2T, that's two time periods,"}, {"start": 549.26, "end": 559.34, "text": "you've only charged up to about 80 something percent. In most electronics they teach you that it takes 5T,"}, {"start": 560.46, "end": 571.02, "text": "which is 90 something 98, 99 percent, is considered fully charged. So it isn't as simple as R times C."}, {"start": 571.02, "end": 583.26, "text": "So the more T's you have the slower the charge rate. What does this mean when we're trying to turn on a collection of MOSFETs"}, {"start": 583.26, "end": 599.26, "text": "that accumulated a lot of input capacitance? Let's look at what people normally use. Some Arduinos and Raspberry Pi put out, what, 3.3 volts? I'm going to call it 3 volts."}, {"start": 599.26, "end": 617.26, "text": "So in a time period of 1T, and I don't know exactly what the R and C values for a Raspberry Pi versus how many MOSFETs you are, but this is what you're dealing with."}, {"start": 617.26, "end": 643.26, "text": "For R times C to get to 3 volts. From 0 to 1T, you're going to go to 63 percent, 63.2 percent."}, {"start": 643.26, "end": 658.76, "text": "But 63.2 percent of 3 volts is 1.9 volts. When we go to 2T, that's 86.5 volts, and I've come up to 2.6 volts."}, {"start": 659.76, "end": 667.26, "text": "Are most MOSFETs really going to turn on at 1.9 or 2.6 volts? Probably not."}, {"start": 667.26, "end": 677.12, "text": "You're going to have to wait for a minimum of three time periods to get up just to 2.85 volts or 3 volts or so."}, {"start": 679.92, "end": 689.8, "text": "What is the additional problem? Maybe you have some really good MOSFETs, and they cut on somewhere around 2T right here."}, {"start": 689.8, "end": 697.66, "text": "But what if you had four MOSFETs in parallel like I showed earlier?"}, {"start": 698.24, "end": 704.76, "text": "MOSFET 1 fires here. MOSFET 2 fires there. MOSFET 3 fires here."}, {"start": 705.3199999999999, "end": 709.8399999999999, "text": "And finally, they're all firing when we reach here. What's happened?"}, {"start": 709.84, "end": 720.58, "text": "I've got some super heavy load on those four parallel MOSFETs, and they're not firing off close enough at the same time."}, {"start": 720.6600000000001, "end": 724.5, "text": "You might overload one or two of the MOSFETs."}, {"start": 724.5600000000001, "end": 731.58, "text": "One of the MOSFETs is conducting like crazy by the time the other three could cut in."}, {"start": 731.9200000000001, "end": 734.0600000000001, "text": "See the problem I'm talking about?"}, {"start": 734.06, "end": 737.52, "text": "Let's look at this problem again."}, {"start": 738.42, "end": 741.4, "text": "But now we're going to go to 5 volts."}, {"start": 742.5799999999999, "end": 748.5999999999999, "text": "1T, 63% of 5 volts, is 3.16 volts."}, {"start": 749.26, "end": 751.8599999999999, "text": "Aha! Big difference."}, {"start": 752.78, "end": 762.9599999999999, "text": "So most of your MOSFETs, if they're designed to fire right at 3 volts, should have turned on pretty well."}, {"start": 762.96, "end": 769.46, "text": "But a lot of MOSFETs take a little higher voltage to turn completely on."}, {"start": 769.5600000000001, "end": 776.4000000000001, "text": "You could still have the danger of cutting on 2 or 3, and maybe number 4 cuts on out here."}, {"start": 777.2, "end": 779.4200000000001, "text": "See the problems? You've got noise."}, {"start": 779.5400000000001, "end": 780.8000000000001, "text": "They're not firing together."}, {"start": 781.48, "end": 785.12, "text": "Some of them might be taking more of a load than the rest of them."}, {"start": 785.58, "end": 787.1600000000001, "text": "But let's take a look at this."}, {"start": 787.16, "end": 792.92, "text": "1T, I get 3.16 volts."}, {"start": 793.42, "end": 797.24, "text": "At 2T, or two time periods, it's 4.3."}, {"start": 797.64, "end": 804.86, "text": "For the time you hit 2T, surely all the MOSFETs will be turned on by 4.3."}, {"start": 805.66, "end": 811.9, "text": "But I did find some MOSFETs when I checked them that were cutting on around 4.3."}, {"start": 811.9, "end": 813.8199999999999, "text": "Understand something."}, {"start": 814.0, "end": 817.3199999999999, "text": "You can order a bag of MOSFETs."}, {"start": 817.54, "end": 818.9399999999999, "text": "You can pull them out."}, {"start": 819.34, "end": 825.28, "text": "But that doesn't mean that they have exactly the same specs."}, {"start": 825.38, "end": 830.14, "text": "There might be a couple of tenths of a volt difference in the way they fire."}, {"start": 830.14, "end": 837.04, "text": "Of course, by three time periods, I'm up to 3.75 volts."}, {"start": 837.84, "end": 841.96, "text": "So, this is beginning to suggest a solution."}, {"start": 843.36, "end": 850.06, "text": "If you're going to do this kind of switching with parallel MOSFETs, you need to go to a higher voltage."}, {"start": 850.06, "end": 861.04, "text": "But even 5 volts on stuff that fires between 3 and 4.3 volts is still an iffy proposition."}, {"start": 861.54, "end": 864.1199999999999, "text": "And look how much time I was strung over."}, {"start": 865.2199999999999, "end": 874.6999999999999, "text": "I was strung over, even if they all fired from the end of 1T to the beginning of 2T,"}, {"start": 874.8, "end": 877.8599999999999, "text": "that's still stringing it out over this time period, is it?"}, {"start": 877.8599999999999, "end": 878.9399999999999, "text": "One time period."}, {"start": 878.94, "end": 883.5600000000001, "text": "Let's take another look at this problem."}, {"start": 884.98, "end": 888.58, "text": "Now, I'm driving them with 12 volts."}, {"start": 890.32, "end": 896.48, "text": "1T, that's 12 volts times 63.2% is 7.6 volts."}, {"start": 898.0200000000001, "end": 898.6600000000001, "text": "All right."}, {"start": 898.84, "end": 900.44, "text": "I have switched off."}, {"start": 900.8000000000001, "end": 903.12, "text": "They're all surely going to be switched on."}, {"start": 903.12, "end": 915.02, "text": "But the important part is, if you look here at 1T at 12 volts, they all switched on somewhere in this little steep curve here."}, {"start": 915.02, "end": 917.68, "text": "So, that's your best bet."}, {"start": 917.68, "end": 919.42, "text": "Drive these things."}, {"start": 919.64, "end": 921.02, "text": "Remember VGS."}, {"start": 921.24, "end": 923.0799999999999, "text": "Do not exceed VGS."}, {"start": 923.96, "end": 930.56, "text": "But with a higher voltage, you will switch on all of those MOSFETs very close together."}, {"start": 930.56, "end": 933.5999999999999, "text": "And they'll be switched on fully and hard."}, {"start": 934.02, "end": 936.4799999999999, "text": "Down in here at a fraction of T."}, {"start": 936.48, "end": 945.1, "text": "Or you can sit here at 3 volts and take up to 3T, three time periods, to try to switch it on."}, {"start": 945.1, "end": 949.52, "text": "It's up to you on that."}, {"start": 951.72, "end": 953.48, "text": "What about a drive circuit?"}, {"start": 953.48, "end": 960.28, "text": "When you put MOSFETs in parallel, of course, the capacitance is going to add."}, {"start": 960.4, "end": 962.0600000000001, "text": "You cannot change that."}, {"start": 962.66, "end": 965.5, "text": "But you might be able to change R."}, {"start": 965.88, "end": 968.34, "text": "Go back into your drive circuit."}, {"start": 969.0, "end": 975.76, "text": "If you're wondering what this circuit is, it's half of one of my H-bridge circuits that I've had around for years."}, {"start": 976.08, "end": 979.86, "text": "But it would be excellent for this application."}, {"start": 981.28, "end": 982.82, "text": "Let's look at it this way."}, {"start": 982.82, "end": 985.6400000000001, "text": "This goes to your MOSFETs."}, {"start": 986.38, "end": 988.74, "text": "Your gates that are all connected together."}, {"start": 990.74, "end": 996.7800000000001, "text": "When there's no input on Q5, the gates of the transistors are high."}, {"start": 996.94, "end": 998.22, "text": "Q2 is turned off."}, {"start": 998.58, "end": 1001.1600000000001, "text": "But Q1 is turned on hard."}, {"start": 1002.1, "end": 1002.46, "text": "Okay."}, {"start": 1003.24, "end": 1012.8000000000001, "text": "When Q2, in this case an IRF630, has a turn-on resistance of 0.4 ohm."}, {"start": 1012.82, "end": 1024.88, "text": "So whatever capacitance I had on those parallel gates is quickly discharged through that very, very low turn-on resistance."}, {"start": 1024.88, "end": 1028.7, "text": "I put a high in E."}, {"start": 1028.7, "end": 1030.8000000000002, "text": "I turn on Q5."}, {"start": 1030.8000000000002, "end": 1033.38, "text": "The gate voltage drops to 0."}, {"start": 1034.16, "end": 1036.5, "text": "And Q2 will switch on."}, {"start": 1036.5800000000002, "end": 1039.0, "text": "And it switches on hard and fast."}, {"start": 1039.44, "end": 1042.0200000000002, "text": "It has very little."}, {"start": 1042.02, "end": 1048.76, "text": "It has 0.8 ohm drain source resistance."}, {"start": 1048.76, "end": 1052.32, "text": "So by reducing R again."}, {"start": 1052.32, "end": 1066.34, "text": "By having a very low conduction resistance on Q2, I have really massively reduced T to something back here."}, {"start": 1066.34, "end": 1075.6999999999998, "text": "That's how I reduce T is because my turn-on and turn-off resistance are so much lower than a regular bipolar transistor."}, {"start": 1075.8999999999999, "end": 1077.08, "text": "So keep this in mind."}, {"start": 1077.62, "end": 1079.34, "text": "You can use MOSFETs."}, {"start": 1079.34, "end": 1084.1399999999999, "text": "RG, make it about 1 or 2K."}, {"start": 1084.78, "end": 1093.3999999999999, "text": "And the 1N914 serves to clean up any noise generated by RG charging and discharging."}, {"start": 1093.4, "end": 1102.38, "text": "Here is another variation of connecting the MOSFETs in parallel."}, {"start": 1103.1200000000001, "end": 1106.2800000000002, "text": "You can put this resistor in the gate circuit."}, {"start": 1106.6000000000001, "end": 1109.5400000000002, "text": "This would slow down the discharge surge."}, {"start": 1109.54, "end": 1116.3, "text": "You might even reduce it to a lower value such as 10 ohms, 22 ohms, whatever you want to."}, {"start": 1116.3999999999999, "end": 1123.06, "text": "You can do that to connect it to a gate or whatever."}, {"start": 1124.48, "end": 1131.04, "text": "The 1N914 serves the purpose again as current rushes through the 47 ohm."}, {"start": 1131.1399999999999, "end": 1137.36, "text": "The induced, the generated voltage spike is taken care of by the 1N914."}, {"start": 1137.36, "end": 1141.32, "text": "Here is another variation."}, {"start": 1141.62, "end": 1150.34, "text": "You can connect an individual resistor to each gate and then connect them to common."}, {"start": 1151.76, "end": 1154.4399999999998, "text": "You'll still have the CGS problem."}, {"start": 1154.58, "end": 1156.54, "text": "27 ohms might be a bit high."}, {"start": 1156.6399999999999, "end": 1158.6999999999998, "text": "You might want to go to 10 ohms each."}, {"start": 1159.8799999999999, "end": 1165.76, "text": "That serves to slow down the huge rush of discharge current."}, {"start": 1165.76, "end": 1172.9, "text": "On the preceding frame and this one, I highly recommend keeping in RG."}, {"start": 1173.44, "end": 1180.94, "text": "The reason I say do this is because when you power up, if you happen to have this,"}, {"start": 1181.68, "end": 1186.36, "text": "for some reason, connected to a microcontroller gate or whatever,"}, {"start": 1186.9, "end": 1193.22, "text": "and the gate is floating, you could have these turn on when they're not supposed to."}, {"start": 1193.22, "end": 1200.26, "text": "So with the preceding circuits, it does not hurt to leave the RG resistor in."}, {"start": 1200.3600000000001, "end": 1204.14, "text": "It helps assure on power up that they are turned off."}, {"start": 1204.14, "end": 1212.5400000000002, "text": "So these are possible solutions to look at when you are dealing with parallel MOSFETs."}, {"start": 1213.5800000000002, "end": 1215.24, "text": "I hope this was useful."}, {"start": 1215.8000000000002, "end": 1216.94, "text": "Give it a try."}, {"start": 1217.0600000000002, "end": 1218.5800000000002, "text": "Let me know how it works out."}, {"start": 1219.24, "end": 1221.22, "text": "This is your host, Lewis Laughlin."}, {"start": 1221.38, "end": 1226.42, "text": "Visit my website at www.bristolwatch.com."}, {"start": 1226.92, "end": 1228.22, "text": "Thanks for listening."}, {"start": 1234.3600000000001, "end": 1241.38, "text": "Thank you."}]}