{"video_id": "IiilGiJZDsI", "url": "https://www.youtube.com/watch?v=IiilGiJZDsI", "title": "IiilGiJZDsI", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 10.8, "text": "The classes that we are going to talk about in this course are not only used in power amplifiers,"}, {"start": 10.8, "end": 17.28, "text": "but also used in audio amplifier circuits. The first class that we are going to examine is"}, {"start": 17.28, "end": 22.8, "text": "Class A Amplifier. This amplifier circuit must look familiar to you because this configuration"}, {"start": 22.8, "end": 27.240000000000002, "text": "is nothing else but the common emitter circuit amplifier. So we already talked about this"}, {"start": 27.24, "end": 34.199999999999996, "text": "circuit and we have also seen how to design one. So let's just point out some facts about this configuration."}, {"start": 35.08, "end": 41.64, "text": "Okay, so Class A Amplifier is a high gain amplifier with high linearity. In case of Class A Amplifier,"}, {"start": 41.64, "end": 50.12, "text": "the conduction angle is 360 degree. As I explained in the previous course, a 360 degree conduction angle"}, {"start": 50.12, "end": 56.519999999999996, "text": "means that the amplifier device remains active for the entire time and use complete input signal."}, {"start": 57.480000000000004, "end": 62.92, "text": "As we can see in this image, there is only one active element which is nothing else but the transistor."}, {"start": 62.92, "end": 69.16, "text": "So the bias of the transistor remains on all the time, right? Due to this never turn off feature,"}, {"start": 69.16, "end": 74.12, "text": "Class A Amplifier provides better high frequency and feedback loop stability."}, {"start": 75.16, "end": 81.48, "text": "Other than disadvantages, Class A Amplifier is easy to construct with a single device component"}, {"start": 81.48, "end": 90.04, "text": "and minimum parts count. Despite the advantages and high linearity, certainly it has many limitations."}, {"start": 90.04, "end": 95.80000000000001, "text": "Due to continuous conduction nature, the Class A Amplifier introduce high power loss."}, {"start": 96.52000000000001, "end": 104.52000000000001, "text": "Also due to high linearity, Class A Amplifier provides distortion and noises. The power supply and the BIOS"}, {"start": 104.52, "end": 111.39999999999999, "text": "construction needs careful component selection to avoid unwanted noise and to minimize the distortion."}, {"start": 112.67999999999999, "end": 117.56, "text": "So we mentioned that Class A Amplifier has high power loss, right? This means that it emits"}, {"start": 117.56, "end": 122.28, "text": "heat and requires heat sink space, which sometimes is not available."}, {"start": 123.24000000000001, "end": 130.12, "text": "The efficiency is very poor in Class A Amplifiers. Theoretically, the efficiency varies between 25%"}, {"start": 130.12, "end": 137.88, "text": "to 30% if used with the usual configuration. The efficiency can be improved using inductively coupled"}, {"start": 137.88, "end": 145.8, "text": "configuration but the efficiency in such case is not more than 40% or 50% due to it is only suitable for"}, {"start": 145.8, "end": 153.32, "text": "low signal or low power level amplification purposes. Now that we highlighted some important facts about"}, {"start": 153.32, "end": 155.96, "text": "this class, let's move to Class B."}, {"start": 155.96, "end": 164.28, "text": "The Class B Amplifier is a bit different from the Class A as you can see here. It is created using two"}, {"start": 164.28, "end": 171.72, "text": "active devices which conduct half of the actual cycle, in other words they conduct 180 degree of the cycle."}, {"start": 172.84, "end": 179.0, "text": "So two devices provide combined current drive for the load. If the circuit is used to provide audio"}, {"start": 179.0, "end": 185.24, "text": "signal amplification, then the load is nothing else but a speaker, right? You might wonder how are these"}, {"start": 185.24, "end": 191.08, "text": "transistors biased? Well, the bias is provided by the input signal, which means that the input signal"}, {"start": 191.08, "end": 199.08, "text": "has to be higher than 0.6V and also the input signal has to go negative in order to bias the PMP"}, {"start": 199.08, "end": 204.52, "text": "transistor. Don't worry if you don't understand how this circuit works because in the next course we"}, {"start": 204.52, "end": 211.8, "text": "try to simulate some of the classes so that you get a better understanding of how they work. Now let's just"}, {"start": 211.8, "end": 217.24, "text": "concentrate on theory a little bit and don't bother yourself if you don't understand exactly how the"}, {"start": 217.24, "end": 225.32000000000002, "text": "circuit works. So this Class B amplifier consists of two active devices which get biased one by one"}, {"start": 225.32000000000002, "end": 232.28, "text": "during the positive and negative half cycle of the sinusoidal wave and thus the signal gets pushed or"}, {"start": 232.28, "end": 239.56, "text": "pulled to the amplified level from both positive and negative side. And by combining the result we get"}, {"start": 239.56, "end": 247.4, "text": "complete cycle across the output. Because these two active devices are turned on one after another and"}, {"start": 247.4, "end": 254.04, "text": "because they conduct only half cycle the efficiency gets improved. Compared to the efficiency of a Class A"}, {"start": 254.04, "end": 263.24, "text": "amplifier which is 25 to 30 percent, the Class B amplifier can have an efficiency more than 60 percent. Also,"}, {"start": 263.24, "end": 270.04, "text": "the heat dissipation is minimized in this class providing a low heat sink space. But this Class also"}, {"start": 270.04, "end": 277.32, "text": "have limitations. A very profound limitation of this Class is the crossover distortion. As two devices"}, {"start": 277.32, "end": 283.8, "text": "provides each half of the sinusoidal waves which are combined and joined across the output, there's a"}, {"start": 283.8, "end": 291.24, "text": "mismatch, in other words crossover in the region where two halves are combined. This is because when one"}, {"start": 291.24, "end": 297.32, "text": "device completes the half cycle, the other one needs to provide the same power almost at the same time"}, {"start": 297.32, "end": 304.12, "text": "when other one finishes the job. It is difficult to fix this error in a Class B amplifier as during the"}, {"start": 304.12, "end": 310.68, "text": "active device the other device remains completely inactive. The error provides a distortion in the"}, {"start": 310.68, "end": 317.96000000000004, "text": "output signal and due to this limitation it is a major fail for precision audio amplifier applications."}, {"start": 317.96, "end": 329.47999999999996, "text": "An alternate approach to overcome the crossover distortion is to use the AB amplifier. Class AB"}, {"start": 329.47999999999996, "end": 336.44, "text": "amplifier uses intermediate conduction angle of both Classes A and B, thus we can see the property of"}, {"start": 336.44, "end": 344.2, "text": "both Class A and Class B amplifier in this AB class of amplifier topology. Same as Class B, it has the same"}, {"start": 344.2, "end": 351.24, "text": "configuration with two active devices which conducts during half of the cycles individually, but each"}, {"start": 351.24, "end": 359.0, "text": "device bias differently so they do not get completely off during the unusable moment or the crossover moment."}, {"start": 359.96, "end": 366.68, "text": "Each device does not leave the conduction immediately after completing the half of the sinusoidal waveform,"}, {"start": 366.68, "end": 372.84, "text": "instead they conduct a small amount of input on another half cycle. Using this biasing technique,"}, {"start": 372.84, "end": 380.2, "text": "the crossover mismatch during the dead zone is dramatically reduced. But in this configuration,"}, {"start": 380.2, "end": 386.84, "text": "efficiency is reduced as the linearity of the devices is compromised. The efficiency remains more"}, {"start": 386.84, "end": 392.2, "text": "than the efficiency of typical Class A amplifier, but it is less than the Class B amplifier system."}, {"start": 393.08, "end": 399.79999999999995, "text": "Also, the diodes need to be carefully chosen with the exact same rating and need to be placed as close"}, {"start": 399.8, "end": 406.44, "text": "as possible to the output device. In some circuit construction, designers tend to add small value"}, {"start": 406.44, "end": 412.76, "text": "resistors to provide stable quiescent current across the device to minimize the distortion across the output."}, {"start": 414.84000000000003, "end": 423.72, "text": "Apart from the Class A, B and AB amplifier, there is another amplifier called Class C. It's a traditional"}, {"start": 423.72, "end": 427.64, "text": "amplifier which works differently than the other amplifier's classes."}, {"start": 427.64, "end": 434.59999999999997, "text": "Class C amplifier is a tuned amplifier which works in two different operation modes, tuned or untuned."}, {"start": 435.56, "end": 445.32, "text": "The efficiency of Class C amplifier is much more than the A, B and AB, so a maximum 80% efficiency can be achieved in"}, {"start": 445.32, "end": 453.8, "text": "radio-frequency related operations. The interesting thing here is that Class C amplifier uses less than 180 degree"}, {"start": 453.8, "end": 463.32, "text": "conduction angle. And during the untuned mode, the Class C amplifier unfortunately gives huge distortion across the output."}, {"start": 464.44, "end": 471.08000000000004, "text": "But in typical uses, Class C amplifier gives 60 to 70% efficiency."}, {"start": 471.08, "end": 481.71999999999997, "text": "The output amplitude is a non-linear function of the input, so Class C amplifier is not used for linear amplification."}, {"start": 481.71999999999997, "end": 490.91999999999996, "text": "They are generally used in radio-frequency applications including circuits such as oscillators that have a constant output amplitude"}, {"start": 490.92, "end": 496.2, "text": "and modulators where a high-frequency signal is controlled by a low-frequency signal."}, {"start": 497.24, "end": 504.92, "text": "So, it works fine with a simple sinusoidal waveform, but may have unacceptable distortion with complex waveform,"}, {"start": 504.92, "end": 511.56, "text": "as the Class C amplifier the transistor conducts for less than 180 degree of the input signal."}, {"start": 511.56, "end": 518.76, "text": "So, on the other hand, Class D amplifiers are way more popular and wider spread as Class C amplifiers."}, {"start": 518.76, "end": 525.96, "text": "It's one of my favorite in terms of functionality, and we will also try to simulate this circuit in our simulator in the next course."}, {"start": 526.6, "end": 535.88, "text": "While Class A, B and AB are classified as analog designs, Class D amplifiers are classified as switching designs."}, {"start": 535.88, "end": 539.08, "text": "As you can see, the circuit is very different from the others."}, {"start": 539.08, "end": 546.84, "text": "This is just a semi-block diagram of a Class D amplifier, but in the next course we will see a full functional circuit."}, {"start": 547.88, "end": 553.08, "text": "So, Class D amplifier is a switching amplifier which uses pulse-width modulation."}, {"start": 553.8000000000001, "end": 558.6, "text": "If you are wondering what pulse-width modulation is, I advise you to look that up on the internet"}, {"start": 558.6, "end": 561.24, "text": "because it's a very important technique used in electronics."}, {"start": 561.8000000000001, "end": 569.0, "text": "Basically, pulse-width modulation, or PVM, is a technique for getting analog results with digital"}, {"start": 569.0, "end": 569.72, "text": "signal means."}, {"start": 569.72, "end": 576.76, "text": "So, digital control is used to create a square wave, which is a signal switched between ON and OFF, right?"}, {"start": 577.24, "end": 585.8, "text": "As the name implies, the width of the square waves are modified in order to vary the amount of current that flows to a device."}, {"start": 587.0, "end": 595.16, "text": "Alright, so the conduction angle is not a factor in such case as the direct input signal is changed with a variable pulse-width."}, {"start": 595.88, "end": 602.4399999999999, "text": "In this class D amplifier system, the linear gain is not accepted as they work just like a typical switch,"}, {"start": 602.4399999999999, "end": 605.7199999999999, "text": "which have only two operations, ON or OFF."}, {"start": 606.8399999999999, "end": 613.0, "text": "Before processing the input signal, the analog signal is converted into a pulse stream by various modulation"}, {"start": 613.0, "end": 617.0799999999999, "text": "techniques, and then it is applied to the amplifier system."}, {"start": 617.08, "end": 626.36, "text": "As the pulse's duration is related with the analog signal, it is again reconstructed using low-pass filter across the output."}, {"start": 627.08, "end": 631.64, "text": "Remember that class D amplifier is the highest power-efficient amplifier class."}, {"start": 632.2, "end": 637.08, "text": "So, it has smaller heat dissipation, so small heat sink is needed."}, {"start": 637.08, "end": 643.88, "text": "The circuit requires various switching components like MOSFETs, which has low ON resistance."}, {"start": 644.6, "end": 650.12, "text": "It is widely used apology in digital audio players or controlling the motors as well."}, {"start": 650.6800000000001, "end": 654.9200000000001, "text": "But we should keep in mind that it is not a digital converter."}, {"start": 654.92, "end": 657.64, "text": "Mix in impeachment."}, {"start": 657.64, "end": 660.92, "text": "I would say that it is not only about 100% of its product, but there are two- cheer cases still"}, {"start": 661.64, "end": 664.36, "text": "in the past, you can easily control it too!"}, {"start": 665.04, "end": 668.5999999999999, "text": "That theieron powders will not occur"}, {"start": 668.5999999999999, "end": 672.0999999999999, "text": "So over time Pharaoh is verified, that as theず quasi-dرب of the associate and trabal parades of the"}, {"start": 672.0999999999999, "end": 673.7199999999999, "text": "ature, etmude the other than the level."}, {"start": 673.7199999999999, "end": 675.7199999999999, "text": "Then because the definitivian describes a different has to be destroyed."}, {"start": 675.7199999999999, "end": 677.8399999999999, "text": "But then they do have a good sense of the pressure of the clairement track track."}, {"start": 677.8399999999999, "end": 678.9, "text": "And while we learn so that the faktor, let's go back and further colonize from everywhere I wouldn't"}, {"start": 678.9, "end": 679.9599999999999, "text": "happen."}, {"start": 679.9599999999999, "end": 680.4, "text": "And while they approach this pewter, this thing that pops up"}]}