{"video_id": "lBC1nEq0_nk", "url": "https://www.youtube.com/watch?v=lBC1nEq0_nk", "title": "lBC1nEq0_nk", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 7.46, "text": "An important question that has to be answered when you're designing an autonomous system is how do you get that system to do what you want?"}, {"start": 8.18, "end": 10.5, "text": "I mean, how do you get a car to drive on its own?"}, {"start": 11.0, "end": 13.48, "text": "How do you manage the temperature of a building?"}, {"start": 13.98, "end": 19.400000000000002, "text": "Or how do you separate liquids into their component parts efficiently with a distillation column?"}, {"start": 20.0, "end": 23.900000000000002, "text": "And to answer those questions, we need control theory."}, {"start": 23.9, "end": 30.7, "text": "Control theory is a mathematical framework that gives us the tools to develop autonomous systems."}, {"start": 31.099999999999998, "end": 35.379999999999995, "text": "And in this video, I want to walk through everything you need to know about control theory."}, {"start": 35.76, "end": 37.12, "text": "So I hope you stick around for it."}, {"start": 37.58, "end": 39.86, "text": "I'm Brian, and welcome to a MATLAB Tech Talk."}, {"start": 42.08, "end": 46.76, "text": "We can understand all of control theory using a simple diagram."}, {"start": 47.239999999999995, "end": 50.980000000000004, "text": "And to begin, let's just start with a single dynamical system."}, {"start": 50.98, "end": 58.559999999999995, "text": "This system is the thing that we want to automatically control, like a building or a distillation column or a car."}, {"start": 58.94, "end": 60.379999999999995, "text": "It can really be anything."}, {"start": 60.839999999999996, "end": 65.38, "text": "But the important thing is that the system can be affected by external inputs."}, {"start": 65.94, "end": 69.32, "text": "And in general, we can think of the inputs as coming from two different sources."}, {"start": 69.86, "end": 75.25999999999999, "text": "There are the control inputs, U, that we intentionally use to affect the system."}, {"start": 75.5, "end": 80.88, "text": "For a car, these are things like moving the steering wheel and hitting the brake and pressing on the accelerator pedal."}, {"start": 81.46000000000001, "end": 83.72, "text": "And then there are unintentional inputs."}, {"start": 84.2, "end": 90.86, "text": "These are the disturbances, D, and they are forces that we don't want affecting the system, but they do anyway."}, {"start": 91.44, "end": 93.80000000000001, "text": "These are things like wind and bumps in the road."}, {"start": 94.62, "end": 102.10000000000001, "text": "Now, the inputs into the system interact with the internal dynamics, and then the system state X changes over time."}, {"start": 102.1, "end": 110.94, "text": "So, for a car, we move the steering wheel and we press the pedals, which turn the wheels and revs the engine, producing forces and torques on that vehicle."}, {"start": 111.39999999999999, "end": 117.75999999999999, "text": "And then combined with the forces and torques from the disturbances, the car changes its speed, position, and direction."}, {"start": 117.76, "end": 128.28, "text": "Now, if we want to automate this process, that is, we want the car to drive without a person determining the inputs, where do we go from here?"}, {"start": 129.06, "end": 137.16, "text": "And the first question is, can an algorithm determine the necessary control inputs without constantly having to know the current state of the system?"}, {"start": 137.16, "end": 148.04, "text": "Or maybe a better way of putting it is, do you need to measure where the car is and how fast it's going in order to successfully drive the car with good control inputs?"}, {"start": 148.42, "end": 150.78, "text": "And the answer is actually no."}, {"start": 150.78, "end": 156.6, "text": "Now, we can control a system with an open loop controller, also known as a feedforward controller."}, {"start": 157.52, "end": 167.78, "text": "A feedforward controller takes in what you want the system to do, called the reference R, and it generates the control signal without ever needing to measure the actual state."}, {"start": 168.48, "end": 175.82, "text": "In this way, the signal from the reference is fed forward through the controller and then forward through the system, never looping back."}, {"start": 176.24, "end": 177.8, "text": "Hence the name feedforward."}, {"start": 177.8, "end": 185.8, "text": "For example, let's say that we want the car to autonomously drive in a straight line and at some arbitrary constant speed."}, {"start": 186.34, "end": 192.56, "text": "If the car is controllable, which means that we have the ability to actually affect the speed and direction of the car,"}, {"start": 192.92000000000002, "end": 196.4, "text": "then we could design a feedforward controller that accomplishes this."}, {"start": 197.08, "end": 202.82000000000002, "text": "The reference, drive straight, means that the steering wheel should be held at a fixed zero degrees."}, {"start": 202.82, "end": 208.73999999999998, "text": "And drive at a constant speed means that we depress the accelerator pedal some non-zero amount."}, {"start": 209.45999999999998, "end": 214.22, "text": "The car would then accelerate to a constant speed and drive straight, exactly as we want."}, {"start": 215.18, "end": 219.92, "text": "However, let's say that we want the car to reach a specific speed, like 30 miles an hour."}, {"start": 219.92, "end": 229.29999999999998, "text": "We can actually still do it with a feedforward controller, but now the controller needs to know how much to depress the accelerator pedal in order to reach that specific speed."}, {"start": 229.61999999999998, "end": 233.39999999999998, "text": "And this requires knowledge about the dynamics of the system."}, {"start": 233.98, "end": 238.0, "text": "And this knowledge can be captured in the form of a mathematical model."}, {"start": 238.0, "end": 247.9, "text": "Now, developing a model can be done using physics and first principles, where the mathematical equations are written out based on your understanding of the system dynamics."}, {"start": 248.52, "end": 254.4, "text": "Or it can be done by using data and fitting a model to that data with a process called system identification."}, {"start": 255.16, "end": 264.74, "text": "Both of these modeling techniques are important concepts to understand because, as we'll get into, models are required for almost all aspects of control theory."}, {"start": 264.74, "end": 274.86, "text": "Now, as an example of system identification, we could test the real car and record the speed it reaches given different pedal positions."}, {"start": 275.46000000000004, "end": 279.06, "text": "And then we could just fit a mathematical model to that data."}, {"start": 279.74, "end": 283.64, "text": "Basically, speed is some function of the pedal position."}, {"start": 284.94, "end": 292.5, "text": "Now, for the feedforward controller itself, we could just use the inverse of that model to get pedal position as a function of speed."}, {"start": 292.5, "end": 299.74, "text": "So, given a reference speed, the feedforward controller would be able to calculate the necessary control input."}, {"start": 300.94, "end": 304.72, "text": "So, feedforward controllers are a pretty straightforward way to control a system."}, {"start": 305.18, "end": 311.7, "text": "However, as we can see, it requires a really good understanding of the system dynamics, since you have to invert them in the controller."}, {"start": 312.16, "end": 316.74, "text": "And any error in that inversion process will result in error in the system state."}, {"start": 316.74, "end": 325.5, "text": "Also, even if you know your system really well, the environment the system is operating in should have predictable behavior as well."}, {"start": 326.0, "end": 332.3, "text": "You know, so that there's not a lot of unknown disturbances entering the system that you're not accounting for in the controller."}, {"start": 332.3, "end": 341.48, "text": "Of course, it doesn't take much imagination to see that feedforward control breaks down for systems that aren't robust to disturbances and uncertainty."}, {"start": 342.18, "end": 347.08000000000004, "text": "I mean, imagine wanting to autonomously drive a car across a city with feedforward control."}, {"start": 348.12, "end": 356.92, "text": "Theoretically, you could map the city well enough and know your car well enough that you could essentially pre-program in all of the steering wheel and pedal commands."}, {"start": 357.24, "end": 358.54, "text": "And just let it go."}, {"start": 358.54, "end": 366.36, "text": "And if you had perfect knowledge ahead of time, then the car would execute those commands and then make its way across the city unharmed."}, {"start": 367.20000000000005, "end": 369.90000000000003, "text": "Obviously, though, this is unrealistic."}, {"start": 370.54, "end": 374.22, "text": "I mean, not only are other cars and pedestrians impossible to predict perfectly,"}, {"start": 374.72, "end": 384.6, "text": "but even the smallest errors in the position and speed of your car will build over time and eventually deviate much too far from the intended path."}, {"start": 384.6, "end": 390.94, "text": "So this is where feedback control or closed loop control comes to the rescue."}, {"start": 391.76000000000005, "end": 399.54, "text": "In feedback control, the controller uses both the reference and the current state of the system to determine the appropriate control inputs."}, {"start": 400.14000000000004, "end": 405.56, "text": "That is, the output is fed back, making a closed loop."}, {"start": 406.02000000000004, "end": 406.90000000000003, "text": "Hence the name."}, {"start": 406.9, "end": 416.02, "text": "And in this way, if the system state starts to deviate from the reference, either because of disturbances or because of errors in our understanding of the system,"}, {"start": 416.32, "end": 423.32, "text": "then the controller can recognize those deviations, those errors, and adjust the control inputs accordingly."}, {"start": 423.88, "end": 427.94, "text": "So feedback control is a self-correcting mechanism."}, {"start": 427.94, "end": 436.66, "text": "And I like to think of feedback as a hack that we have to employ due to our inability to perfectly understand the system and its environment."}, {"start": 437.24, "end": 440.98, "text": "We don't want to use feedback control, but we have to."}, {"start": 442.1, "end": 442.58, "text": "All right."}, {"start": 442.68, "end": 448.4, "text": "So feedback control is powerful, but it's also a lot more dangerous than feed forward control."}, {"start": 448.4, "end": 457.0, "text": "And the reason for this is that feed forward changes the way we operate a system, but feedback changes the dynamics of the system."}, {"start": 457.35999999999996, "end": 459.5, "text": "It changes its underlying behavior."}, {"start": 459.9, "end": 467.4, "text": "And this is because with feedback, the controller changes the system state as a function of the current state."}, {"start": 467.78, "end": 471.78, "text": "And that relationship is producing new dynamics."}, {"start": 472.4, "end": 477.4, "text": "And changing dynamics means that we have the ability to change the stability of the system."}, {"start": 477.4, "end": 483.97999999999996, "text": "And on the plus side, we can take an unstable or marginally stable system and make it more stable with feedback control."}, {"start": 484.26, "end": 490.52, "text": "But on the negative side, we can also make a system less stable and even unstable."}, {"start": 490.94, "end": 497.65999999999997, "text": "And this is why a lot of control theory is focused on designing and, importantly, analyzing feedback controllers."}, {"start": 497.84, "end": 501.23999999999995, "text": "Because if you do it wrong, you can cause more harm than good."}, {"start": 501.24, "end": 511.84000000000003, "text": "And since feedback control exists in many different types of systems, the control community over the years have developed many different types of feedback controllers."}, {"start": 511.84, "end": 521.78, "text": "There are linear controllers like PID and full state feedback that assume the general behavior of the system being controlled is linear in nature."}, {"start": 522.62, "end": 529.64, "text": "And if that's not the case, there are nonlinear controllers like on-off controllers and sliding mode controllers and gain scheduling."}, {"start": 529.64, "end": 536.12, "text": "Now, often thinking in terms of linear versus nonlinear isn't the best way to choose a controller."}, {"start": 536.36, "end": 538.9, "text": "So we define them in other ways as well."}, {"start": 539.42, "end": 545.06, "text": "For example, there are robust controllers like mu synthesis and active disturbance rejection control,"}, {"start": 545.22, "end": 550.96, "text": "which focus on meeting requirements even in the face of uncertainty in the plant and in the environment."}, {"start": 550.96, "end": 555.5600000000001, "text": "So we can guarantee that they are robust to a certain amount of uncertainty."}, {"start": 556.52, "end": 564.72, "text": "There are adaptive controllers like extremum seeking and model reference adaptive control that adapt to changes in the system over time."}, {"start": 565.1800000000001, "end": 570.22, "text": "There are optimal controllers like LQR where a cost function is created,"}, {"start": 570.64, "end": 576.7800000000001, "text": "and then the controller tries to balance performance and effort by minimizing the total cost."}, {"start": 576.78, "end": 585.8199999999999, "text": "There are predictive controllers like model predictive control that use a model of the system inside the controller to simulate what the future state will be,"}, {"start": 586.24, "end": 592.14, "text": "and therefore what the optimal control input should be in order to have that future state match the reference."}, {"start": 592.8, "end": 601.52, "text": "There are intelligent controllers like fuzzy controllers or reinforcement learning that rely on data to learn the best controller."}, {"start": 602.0799999999999, "end": 604.0799999999999, "text": "And there are many others."}, {"start": 604.08, "end": 607.34, "text": "And the point here isn't to list every control method."}, {"start": 607.72, "end": 612.26, "text": "I just wanted to highlight the fact that feedback control isn't just a single algorithm,"}, {"start": 612.5400000000001, "end": 614.0400000000001, "text": "but it's a family of algorithms."}, {"start": 614.5, "end": 622.48, "text": "And choosing which controller to use and how to set it up depends largely on what system you are controlling and what you want it to do."}, {"start": 623.62, "end": 626.36, "text": "So what do you want your system to do?"}, {"start": 626.74, "end": 628.7800000000001, "text": "What state do you want the system to be in?"}, {"start": 629.08, "end": 630.9200000000001, "text": "What is the reference that you want it to follow?"}, {"start": 630.92, "end": 635.5999999999999, "text": "And this might seem like a simple question if we're balancing an inverted pendulum,"}, {"start": 635.9, "end": 638.78, "text": "or designing a simple cruise controller for a car."}, {"start": 639.28, "end": 641.66, "text": "The reference for the pendulum is vertical,"}, {"start": 642.0999999999999, "end": 645.3399999999999, "text": "and for the car it's the speed that the driver sets."}, {"start": 646.2199999999999, "end": 651.2199999999999, "text": "However, for many systems, understanding what it should do takes some effort,"}, {"start": 651.56, "end": 654.06, "text": "and this is where planning comes in."}, {"start": 654.06, "end": 658.2199999999999, "text": "The control system can't follow a reference if one doesn't exist,"}, {"start": 658.52, "end": 662.04, "text": "and so planning is a very important aspect of designing a control system."}, {"start": 662.6199999999999, "end": 666.8, "text": "With a self-driving car, for example, planning has to figure out a path to the destination,"}, {"start": 667.06, "end": 670.2399999999999, "text": "while avoiding obstacles, and it has to follow the rules of the road."}, {"start": 670.7199999999999, "end": 674.18, "text": "Plus, it has to come up with a plan that the car is physically able to follow."}, {"start": 674.7199999999999, "end": 678.0999999999999, "text": "You know, it doesn't accelerate too fast, or it doesn't turn too quickly."}, {"start": 678.1, "end": 682.94, "text": "And if there are passengers, then planning has to account for their comfort and safety as well."}, {"start": 683.6800000000001, "end": 689.22, "text": "And only after the plan has been created can the controller then generate the commands to follow it."}, {"start": 689.7, "end": 695.0400000000001, "text": "An example of two different graph-based planning methods are rapidly expanding random trees,"}, {"start": 695.46, "end": 697.72, "text": "RRT and A star."}, {"start": 698.74, "end": 701.62, "text": "Once again, there are too many different algorithms to name,"}, {"start": 701.62, "end": 705.72, "text": "but the important thing is that you understand that you have to develop a plan"}, {"start": 705.72, "end": 708.62, "text": "that your controller will then try to follow."}, {"start": 710.18, "end": 712.66, "text": "All right, so once you know what you want the system to do,"}, {"start": 712.84, "end": 714.9, "text": "and you have a feedback controller to do it,"}, {"start": 715.26, "end": 718.0, "text": "now you need to actually execute this plan."}, {"start": 718.5, "end": 722.72, "text": "And as we know, for feedback controllers, this requires knowledge of the state of the system."}, {"start": 723.16, "end": 725.74, "text": "That is, after all, what we are feeding back."}, {"start": 726.08, "end": 730.2, "text": "And the problem is that we don't actually know the state unless we measure it."}, {"start": 730.2, "end": 733.8000000000001, "text": "And measuring it with a sensor introduces noise."}, {"start": 734.5, "end": 737.88, "text": "So for our car example, we're not feeding back the true speed of the car,"}, {"start": 738.0600000000001, "end": 740.82, "text": "we're feeding back a noisy measurement of the speed."}, {"start": 741.44, "end": 744.2, "text": "And our controller is going to react to that noise."}, {"start": 744.6400000000001, "end": 748.86, "text": "So in this way, noise in a feedback system actually affects the true state of the system."}, {"start": 749.32, "end": 753.4000000000001, "text": "And so this is one additional problem that we're going to have to tackle with feedback control."}, {"start": 754.0600000000001, "end": 756.48, "text": "A second problem is that of observability."}, {"start": 756.48, "end": 759.1, "text": "In order to feed back the state of the system,"}, {"start": 759.4200000000001, "end": 762.46, "text": "we have to be able to observe the state of the system."}, {"start": 762.76, "end": 769.1, "text": "And this requires sensors in enough places that every state that is fed back can be observed."}, {"start": 769.72, "end": 773.28, "text": "Now, it's important to note that we don't have to measure every state directly."}, {"start": 773.38, "end": 775.5, "text": "We just need to be able to observe every state."}, {"start": 775.86, "end": 778.02, "text": "For example, if our car only has a speedometer,"}, {"start": 778.26, "end": 782.32, "text": "we can still observe acceleration by taking the derivative of the speed."}, {"start": 782.32, "end": 785.2600000000001, "text": "So there are two things here."}, {"start": 785.82, "end": 787.7600000000001, "text": "We need to reduce measurement noise."}, {"start": 788.3000000000001, "end": 794.34, "text": "And we need to manipulate the measurements in such a way that allows us to accurately estimate the state of the system."}, {"start": 795.0, "end": 799.44, "text": "State estimation is therefore another important area of control theory."}, {"start": 800.1, "end": 803.4200000000001, "text": "And for this, we can use algorithms like the Kalman filter,"}, {"start": 803.9200000000001, "end": 808.2600000000001, "text": "the particle filter, or even just run a simple running average."}, {"start": 808.26, "end": 812.16, "text": "And choosing an algorithm depends on which states you are directly measuring,"}, {"start": 812.16, "end": 816.72, "text": "and how much noise and what type of noise is present in those measurements."}, {"start": 818.0, "end": 824.66, "text": "Now, the last major part of control theory is responsible for ensuring the system that we just designed works."}, {"start": 824.98, "end": 827.58, "text": "That it meets the requirements that we set for it."}, {"start": 827.76, "end": 830.86, "text": "And this comes down to analysis, simulation, and test."}, {"start": 830.86, "end": 838.42, "text": "For this, we can plot data in different formats, like with a Bode diagram, a Nichols chart, or a Nyquist diagram."}, {"start": 839.04, "end": 842.32, "text": "We could check for stability and performance margins."}, {"start": 842.74, "end": 846.26, "text": "We could simulate the system using MATLAB and Simulink."}, {"start": 846.52, "end": 851.98, "text": "And all of these tools can be used to ensure that the system will function as intended."}, {"start": 852.94, "end": 859.16, "text": "And so this full diagram here, I think, represents everything you need to know about control theory."}, {"start": 859.16, "end": 865.42, "text": "You have to know about different control methods, both feedforward and feedback, depending on the system you're controlling."}, {"start": 865.9599999999999, "end": 869.6999999999999, "text": "You have to know about state estimation so that you can take all of those noisy measurements"}, {"start": 869.6999999999999, "end": 872.7199999999999, "text": "and be able to feed back an estimate of system state."}, {"start": 873.2199999999999, "end": 878.6, "text": "You have to know about planning so that you can create the reference that you want your controller to follow."}, {"start": 879.4, "end": 883.9399999999999, "text": "You have to know how to analyze your system to ensure that it's meeting requirements."}, {"start": 883.94, "end": 890.8000000000001, "text": "And finally, and possibly most importantly, you have to know about building mathematical models of your system."}, {"start": 891.0, "end": 895.1600000000001, "text": "Because models are often used for every part we just covered."}, {"start": 895.3800000000001, "end": 897.4200000000001, "text": "They are used for controller design."}, {"start": 897.7600000000001, "end": 899.5, "text": "They're used for state estimation."}, {"start": 899.96, "end": 901.1800000000001, "text": "They're used for planning."}, {"start": 901.44, "end": 903.6800000000001, "text": "And they are used for analysis."}, {"start": 903.68, "end": 909.5999999999999, "text": "All right, I always leave links below to other resources and references."}, {"start": 909.9399999999999, "end": 911.2399999999999, "text": "And this video is no exception."}, {"start": 911.8599999999999, "end": 915.8199999999999, "text": "And there are a bunch for this video since I mentioned so many different topics."}, {"start": 916.3599999999999, "end": 921.62, "text": "And something I think is nice is that we already have MATLAB Tech Talks for almost every topic I mentioned."}, {"start": 922.0999999999999, "end": 928.54, "text": "We have feedforward and PID and gain scheduling and fuzzy logic and Kalman filters and particle filters"}, {"start": 928.54, "end": 932.5999999999999, "text": "and planning algorithms and system identification and more."}, {"start": 932.6, "end": 939.1800000000001, "text": "So if there's an area of control theory that you want to learn more about, I hope you check out the links below."}, {"start": 940.14, "end": 945.24, "text": "And to make it easier to browse through all of them, I put together a journey at resorcium.org"}, {"start": 945.24, "end": 948.64, "text": "that organizes all of the references in this video."}, {"start": 949.14, "end": 952.0400000000001, "text": "Again, link to that is below as well."}, {"start": 952.8000000000001, "end": 954.7, "text": "So this is where I'm going to leave this video."}, {"start": 954.9, "end": 958.86, "text": "If you don't want to miss any other future Tech Talk videos, don't forget to subscribe to this channel."}, {"start": 959.24, "end": 961.58, "text": "And if you want to check out my channel, Control System Lectures,"}, {"start": 961.58, "end": 964.48, "text": "I cover more control theory topics there as well."}, {"start": 964.98, "end": 967.0200000000001, "text": "Thanks for watching, and I'll see you next time."}]}