{"video_id": "n3TeLpbw_jk", "url": "https://www.youtube.com/watch?v=n3TeLpbw_jk", "title": "n3TeLpbw_jk", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 4.68, "text": "Maybe this has happened to you. You have a nice, fresh build. You just got done building it. Maybe you bought it."}, {"start": 4.86, "end": 9.32, "text": "But you just put props on it. You got your first pack on it. It's time to go maiden flight this thing."}, {"start": 9.6, "end": 19.0, "text": "So, you set it down, and, uh, yeah. You get out your radio, you flick your switch, you arm the quad, you raise the throttle, and..."}, {"start": 19.68, "end": 23.7, "text": "Well, s***."}, {"start": 23.7, "end": 37.519999999999996, "text": "Hey, everybody. I'm BaconNinja, and today we are going to cover six of the most common reasons why your new build or new quad in general is doing something stupid and looks like this whenever it takes off for the first time."}, {"start": 37.78, "end": 46.239999999999995, "text": "Because it happens a lot. A lot of people fall into this trap. They arm their quad after putting their props on. They have a fresh lipo on the thing."}, {"start": 46.46, "end": 52.1, "text": "They raise the throttle, and bam, just like that. It does a death roll immediately."}, {"start": 52.1, "end": 56.18, "text": "Now, there are a couple variations on this. Most of the time, it is the death roll."}, {"start": 56.620000000000005, "end": 59.980000000000004, "text": "Sometimes, the quad just won't get off the ground. It looks a little something like this."}, {"start": 67.38, "end": 74.34, "text": "But before we get into what causes those two things in particular, because those are really the point of this video here,"}, {"start": 74.56, "end": 79.22, "text": "I'm going to talk to you about two incredibly common ones that I see all the time on beginner forums."}, {"start": 79.22, "end": 83.52, "text": "Just because they are out there, and I think it'll be easy to get these questions out of the way."}, {"start": 83.9, "end": 91.74, "text": "The first one is, why does my quad just shut down completely whenever I go to arm it with my radio?"}, {"start": 92.18, "end": 94.86, "text": "Well, the chances are that you're testing it on the bench."}, {"start": 94.98, "end": 96.3, "text": "It's probably a new build."}, {"start": 96.66, "end": 99.32, "text": "And you're going to test it with one of these."}, {"start": 99.56, "end": 100.34, "text": "A smoke stopper."}, {"start": 100.34, "end": 105.14, "text": "Well, if you've got the smoke stopper plugged in between your lipo and the quad,"}, {"start": 105.26, "end": 111.82000000000001, "text": "you're going to have a problem, because these things are made to limit the number of amps that come out of your battery into the quad."}, {"start": 111.9, "end": 118.96000000000001, "text": "Just in case you have a short in there, it basically keeps you from frying everything inside your quad with too many amps"}, {"start": 118.96, "end": 122.46, "text": "and burning it entirely down, which is a good thing, yes."}, {"start": 122.78, "end": 127.1, "text": "But it does mean that as soon as you arm it and the spinny boys start to their spinning,"}, {"start": 127.6, "end": 130.57999999999998, "text": "it's going to pull too many amps, and it's just going to shut down."}, {"start": 130.7, "end": 134.28, "text": "Now, if you have a smoke stopper like mine, that means you've ruined your smoke stopper."}, {"start": 134.51999999999998, "end": 139.56, "text": "But most modern smoke stoppers are actually switch protected, and it'll just kick the thing off."}, {"start": 139.85999999999999, "end": 140.82, "text": "You'll unplug the lipo."}, {"start": 140.98, "end": 141.82, "text": "You'll plug it back in."}, {"start": 141.9, "end": 143.01999999999998, "text": "It'll act just fine again."}, {"start": 143.2, "end": 144.85999999999999, "text": "It's a real mystery for some people."}, {"start": 144.86, "end": 148.86, "text": "So just know that if you're testing it on the bench, don't plan on spinning your motors."}, {"start": 149.06, "end": 153.66000000000003, "text": "There's just enough amps to boot up the flight controller and maybe get the beta flight tones."}, {"start": 153.98000000000002, "end": 156.54000000000002, "text": "Sometimes your quad will even die in the middle of making the tones."}, {"start": 156.82000000000002, "end": 158.86, "text": "It just pulls too many amps."}, {"start": 159.4, "end": 165.5, "text": "And number two is why do my motors not throttle down when I throttle my quad down?"}, {"start": 165.8, "end": 168.16000000000003, "text": "Again, this is most commonly a bench issue."}, {"start": 168.48000000000002, "end": 173.9, "text": "And most of the time, what you'll find is that when you are testing your quad for the first time,"}, {"start": 173.9, "end": 179.64000000000001, "text": "you haven't put props on yet, you go to arm the thing, you just want to make sure it responds correctly."}, {"start": 179.96, "end": 181.46, "text": "Perfectly fine thought process."}, {"start": 182.16, "end": 188.06, "text": "But what you aren't understanding is that the PID controller is active as soon as you lift the throttle on the quad."}, {"start": 188.32, "end": 193.52, "text": "And because there's no props on the quad, because in this scenario, you don't have your props on yet,"}, {"start": 194.04000000000002, "end": 196.42000000000002, "text": "the PID controller says, hey man, what's up, bro?"}, {"start": 196.46, "end": 197.36, "text": "You ain't lifting off."}, {"start": 197.46, "end": 199.5, "text": "I'm telling you to get the heck off the table."}, {"start": 199.62, "end": 200.92000000000002, "text": "Why aren't you getting off the table?"}, {"start": 200.92, "end": 204.72, "text": "And it says, I'm spinning my spinny boys, but I'm not going nowhere."}, {"start": 204.82, "end": 205.92, "text": "What do you want me to do, bro?"}, {"start": 206.07999999999998, "end": 208.88, "text": "So then the PID controller says, hey, spinny boys, kick it up a notch."}, {"start": 209.17999999999998, "end": 214.23999999999998, "text": "And then by the time you catch on to what's going on here, no matter what you do with the throttle,"}, {"start": 214.44, "end": 216.1, "text": "it'll just keep throttling up."}, {"start": 216.5, "end": 221.2, "text": "So those are the first two really common things that go wrong with new builds."}, {"start": 222.32, "end": 226.29999999999998, "text": "One is tripping your smoke stopper when you're testing and then thinking something's wrong with your quad."}, {"start": 226.3, "end": 228.18, "text": "It probably isn't just your smoke stopper."}, {"start": 228.4, "end": 235.82000000000002, "text": "And number two is your motors will not throttle down after you arm the quad and throttle up unless you have props on."}, {"start": 236.02, "end": 241.54000000000002, "text": "So if you're in those two positions, just go ahead and either don't use your smoke stopper, go outside and test it,"}, {"start": 241.78, "end": 246.14000000000001, "text": "or put your props on and then subsequently go outside and test it."}, {"start": 246.26000000000002, "end": 251.82000000000002, "text": "Now let's get into the real meat and potatoes of the things that make this stuff happen."}, {"start": 251.82, "end": 257.15999999999997, "text": "And the one we're going to start with is that second scenario that I showed you where the quad just doesn't lift off the ground."}, {"start": 257.36, "end": 259.04, "text": "Let me show you what that looks like again."}, {"start": 265.28, "end": 267.9, "text": "And there are normally two reasons for this one."}, {"start": 267.98, "end": 271.2, "text": "And I'm going to roll it all into point number three because I told you there were only six,"}, {"start": 271.26, "end": 273.65999999999997, "text": "but I'm going to give you both reasons for this one up front."}, {"start": 273.78, "end": 275.9, "text": "The first one's actually really easy."}, {"start": 275.9, "end": 281.52, "text": "If your quad appears to be stuck to the table, it might not be your props."}, {"start": 281.84, "end": 287.14, "text": "You might have the thing on turtle mode or flip over after crash."}, {"start": 287.26, "end": 294.67999999999995, "text": "So what you're going to want to do is go into beta flight with your quad powered on and with your radio powered on."}, {"start": 294.79999999999995, "end": 296.94, "text": "And you're going to want to see what modes are active."}, {"start": 297.03999999999996, "end": 298.34, "text": "Now let me show you what that looks like."}, {"start": 298.71999999999997, "end": 302.5, "text": "And we're going to want to go to the modes tab here and just check out what's on."}, {"start": 302.5, "end": 306.04, "text": "Now you might see that your arm mode is enabled when you arm the quad."}, {"start": 306.18, "end": 308.64, "text": "So try your arming switch and make sure the arm mode is enabled."}, {"start": 309.12, "end": 313.16, "text": "But we're looking for one called flip over after crash, which is this one right here."}, {"start": 313.36, "end": 317.02, "text": "And what you want to do is make sure that it is not lit up as if it was active."}, {"start": 317.28, "end": 322.52, "text": "You want to make sure the range that it's in is not being activated by something going on on your radio."}, {"start": 323.02, "end": 324.38, "text": "Because sometimes that does happen."}, {"start": 324.56, "end": 329.54, "text": "And what flip over after crash is made for is to spin two props at a time, really."}, {"start": 329.54, "end": 334.90000000000003, "text": "And it might cause your quad to act like it doesn't want to lift off the ground or push down."}, {"start": 335.18, "end": 337.40000000000003, "text": "But that's only reason one and that's the simple one."}, {"start": 337.5, "end": 343.46000000000004, "text": "So if you find that flip over after crash is enabled when you're not expecting it to be enabled on your radio,"}, {"start": 343.98, "end": 349.72, "text": "either you need to make sure the switches on your radio where flip over after crash is assigned are in the proper position."}, {"start": 349.96000000000004, "end": 356.22, "text": "Or you need to reassign that mode to a proper switch that you intend to have in the off position during normal flight."}, {"start": 356.22, "end": 359.6, "text": "But that's actually not the most common thing."}, {"start": 359.70000000000005, "end": 363.40000000000003, "text": "A lot of people know what modes are going on and if it's active or not."}, {"start": 363.52000000000004, "end": 367.96000000000004, "text": "And actually a lot of pilots probably forget to set that up before they take their first flight anyway."}, {"start": 368.18, "end": 370.54, "text": "So I'm going to say that's not the most common thing."}, {"start": 370.78000000000003, "end": 376.62, "text": "But what is the most common thing and what causes that to happen more often than not is the props being on wrong."}, {"start": 377.08000000000004, "end": 379.70000000000005, "text": "So there are two ways to put your props on that will cause this."}, {"start": 379.7, "end": 384.08, "text": "If you'll notice on my quad, I have both leading edges."}, {"start": 384.21999999999997, "end": 386.59999999999997, "text": "So you see this rounded bit of my prop here."}, {"start": 386.76, "end": 389.42, "text": "I have both of those facing out from my camera."}, {"start": 389.59999999999997, "end": 391.71999999999997, "text": "This is what's called a props out configuration."}, {"start": 392.09999999999997, "end": 397.64, "text": "Now if I were to take this prop and put it in this spot and take this prop and put it in that spot,"}, {"start": 397.8, "end": 402.48, "text": "that would mean that I would have one facing out and one facing in."}, {"start": 402.86, "end": 404.86, "text": "So that would be the wrong configuration."}, {"start": 405.14, "end": 407.59999999999997, "text": "They have to be matched between the front and the back."}, {"start": 407.6, "end": 409.94, "text": "You'll see my back ones are the same way."}, {"start": 410.36, "end": 415.02000000000004, "text": "And the way you tell the direction of a prop is you look at the leading edge of the top of the prop."}, {"start": 415.38, "end": 419.48, "text": "So a prop looks kind of like a wing and it swoops down."}, {"start": 419.70000000000005, "end": 421.94, "text": "It makes this downward swoop through the air."}, {"start": 422.16, "end": 427.28000000000003, "text": "And that means the part at the top of the swoop is the leading edge of the prop."}, {"start": 427.28000000000003, "end": 433.40000000000003, "text": "So you want to make sure that you are using the leading edge of the prop to determine the prop orientation on these."}, {"start": 433.4, "end": 439.15999999999997, "text": "Now another way you can do this incorrectly other than just putting the props on in the wrong direction"}, {"start": 439.15999999999997, "end": 444.59999999999997, "text": "is putting them on upside down, which will actually cause the thrust to just push the quad directly into the ground."}, {"start": 445.26, "end": 446.79999999999995, "text": "Normally it'll just pin it there."}, {"start": 447.02, "end": 448.91999999999996, "text": "It'll just straight up pin it there."}, {"start": 448.92, "end": 451.58000000000004, "text": "And you might have a hard time getting it to stop."}, {"start": 452.0, "end": 454.66, "text": "Hopefully your pit controller recognizes it and shuts it down."}, {"start": 455.0, "end": 456.16, "text": "If not, you may have to disarm."}, {"start": 456.24, "end": 461.04, "text": "But if your quad is just not lifting off the ground or doing this weird fluttering on the ground thing"}, {"start": 461.04, "end": 465.58000000000004, "text": "where it's kind of pushing itself around, it's not flipping, it's just pushing itself around,"}, {"start": 465.68, "end": 469.16, "text": "or it's pinned to the ground, there's a really good chance your props are on incorrectly."}, {"start": 469.40000000000003, "end": 473.46000000000004, "text": "So the first thing you'll want to do is A, make sure your props are not on upside down."}, {"start": 473.46, "end": 478.56, "text": "By looking for that leading edge that I was telling you about, making sure that is on the top of the prop."}, {"start": 479.06, "end": 485.53999999999996, "text": "Then you want to go determine what the motor direction your flight controller expects is set to in Betaflight."}, {"start": 486.26, "end": 492.67999999999995, "text": "And inside the motors tab of Betaflight, you can see that mine, if you look at these little spinny boy diagrams here,"}, {"start": 492.82, "end": 495.44, "text": "are meant to be going outward rotation."}, {"start": 495.71999999999997, "end": 499.82, "text": "Because my checkbox here for motor direction is reversed, is checked."}, {"start": 499.82, "end": 505.86, "text": "Now, if yours are not, if yours are not the same as the diagram on your quad,"}, {"start": 506.18, "end": 508.14, "text": "make them the same as the diagram on your quad."}, {"start": 508.59999999999997, "end": 514.3199999999999, "text": "If for some reason you wanted to reverse it, don't just think that that checkbox in the motors tab that I showed you,"}, {"start": 514.34, "end": 517.28, "text": "the little toggle slider, will reverse your motor directions."}, {"start": 517.42, "end": 519.68, "text": "It actually doesn't do anything for the motor direction."}, {"start": 520.16, "end": 522.46, "text": "It just tells the flight controller what to expect."}, {"start": 522.6, "end": 524.98, "text": "So don't go messing with that, just make your props match."}, {"start": 524.98, "end": 530.96, "text": "Now, once you have made your props match, there's still a potential that it doesn't work."}, {"start": 531.52, "end": 533.86, "text": "And that might be because of something called motor direction,"}, {"start": 534.0600000000001, "end": 537.0, "text": "which, if you built the quad, hopefully you know what the motor direction is."}, {"start": 537.16, "end": 538.44, "text": "Hopefully you've already set it."}, {"start": 538.48, "end": 541.7, "text": "But now is the time to go back through the motor direction wizard in Betaflight."}, {"start": 542.34, "end": 545.5, "text": "If changing the props around didn't get the thing to lift off the ground,"}, {"start": 545.5, "end": 548.1800000000001, "text": "and you're not for some reason in flip over after crash mode,"}, {"start": 548.24, "end": 550.62, "text": "and you've made sure that your props aren't on upside down,"}, {"start": 550.9, "end": 553.0600000000001, "text": "but the quad is just not coming up off the ground,"}, {"start": 553.06, "end": 557.4599999999999, "text": "it's time to check the motor direction and see what that does."}, {"start": 557.8599999999999, "end": 559.4399999999999, "text": "And the first part of checking your motor direction,"}, {"start": 559.9399999999999, "end": 562.38, "text": "take the freaking props off your quad,"}, {"start": 562.9599999999999, "end": 564.7399999999999, "text": "because you want to keep your fingers, don't you?"}, {"start": 565.0999999999999, "end": 566.8199999999999, "text": "You like your little meat tube sticks?"}, {"start": 567.2199999999999, "end": 568.2399999999999, "text": "You want to keep them."}, {"start": 568.3599999999999, "end": 572.18, "text": "So let's take them off there, because there will be a pack plugged in for this."}, {"start": 572.5, "end": 574.76, "text": "And back in the motors tab with the LiPo plugged into our quad,"}, {"start": 574.8199999999999, "end": 575.76, "text": "as well as the USB,"}, {"start": 576.26, "end": 579.06, "text": "we can go to this motor direction button here."}, {"start": 579.06, "end": 580.64, "text": "And that's going to pop up this thing."}, {"start": 581.14, "end": 582.42, "text": "Yes, I understand the wrist."}, {"start": 582.42, "end": 583.74, "text": "All propellers are removed,"}, {"start": 583.74, "end": 591.42, "text": "because you listened to me a minute ago about keeping your sausage tubies intact, correct?"}, {"start": 592.14, "end": 593.16, "text": "So we're going to check that."}, {"start": 593.36, "end": 594.86, "text": "And then I like to do individually."}, {"start": 595.0999999999999, "end": 596.16, "text": "So I'm going to go individually."}, {"start": 596.36, "end": 599.8199999999999, "text": "And what this will let me do is basically just pick a motor number,"}, {"start": 599.8199999999999, "end": 601.64, "text": "and it'll spin on the quad."}, {"start": 602.16, "end": 605.12, "text": "And so when I press 1 in Betaflight, you can see that motor spins."}, {"start": 605.4599999999999, "end": 606.8399999999999, "text": "And this is a really small quad."}, {"start": 606.98, "end": 608.78, "text": "So what I'm actually going to do to check the direction"}, {"start": 608.78, "end": 611.92, "text": "is press that and then feel the direction it's spinning."}, {"start": 611.92, "end": 614.9399999999999, "text": "And mine feels it's pulling my finger outward."}, {"start": 615.26, "end": 617.3199999999999, "text": "That means my motor direction is correct."}, {"start": 617.78, "end": 620.16, "text": "And if the motor direction is correct, you don't have to do anything."}, {"start": 620.16, "end": 621.9599999999999, "text": "You can just move on to the next motor."}, {"start": 621.96, "end": 627.4000000000001, "text": "But if the motor direction is not correct, you can either set it to normal or reverse."}, {"start": 627.6, "end": 631.82, "text": "And when you press those buttons, it will actually reverse it in real time."}, {"start": 631.82, "end": 635.6600000000001, "text": "So that is reversed for this motor, which is actually the wrong direction."}, {"start": 635.6600000000001, "end": 637.4000000000001, "text": "So I'm going to go back and hit the normal button."}, {"start": 637.6, "end": 639.7800000000001, "text": "And now I can feel it pulling to the outside again."}, {"start": 640.0, "end": 641.9000000000001, "text": "And that is the correct motor direction."}, {"start": 642.1600000000001, "end": 644.82, "text": "And once you have all them done, you just have to hit close."}, {"start": 644.82, "end": 646.86, "text": "And it actually saves it all for you right there."}, {"start": 647.5, "end": 648.0200000000001, "text": "And that's it."}, {"start": 648.08, "end": 650.9200000000001, "text": "There's a very good likelihood that you have now fixed the problem."}, {"start": 651.2800000000001, "end": 656.48, "text": "So now you can put your props back on in the correct direction and go see if it did."}, {"start": 656.74, "end": 660.08, "text": "Now, if you were doing this whole thing and you went around the motors"}, {"start": 660.08, "end": 664.1, "text": "with the motor direction wizard or individually like I did,"}, {"start": 664.34, "end": 668.2800000000001, "text": "and you noticed that one of the motors was not spinning, that's a bad sign."}, {"start": 668.46, "end": 672.0600000000001, "text": "That could be a problem with either your ESC or the harness"}, {"start": 672.06, "end": 675.7199999999999, "text": "from your flight controller to the ESC or if it's an all-in-one board,"}, {"start": 676.0999999999999, "end": 678.3199999999999, "text": "either the all-in-one board or the motor."}, {"start": 678.5799999999999, "end": 681.3399999999999, "text": "So then it's time to dive off into some other troubleshooting"}, {"start": 681.3399999999999, "end": 682.9799999999999, "text": "that we're not going to get into in this video."}, {"start": 682.9799999999999, "end": 686.3399999999999, "text": "But that is a great time to notice when you have a problem"}, {"start": 686.3399999999999, "end": 690.66, "text": "with the actual spinny boys because they should all be able to spin."}, {"start": 690.9799999999999, "end": 693.8, "text": "But now you should be able to go put the props on"}, {"start": 693.8, "end": 695.68, "text": "and at least get the thing off the ground."}, {"start": 697.1199999999999, "end": 699.9, "text": "Thanks, problem number four."}, {"start": 700.04, "end": 701.5999999999999, "text": "That was incredibly helpful, right?"}, {"start": 701.6, "end": 704.34, "text": "Well, if it was helpful, be sure to give this video a thumbs up."}, {"start": 704.7, "end": 706.6, "text": "And yeah, subscribe if you feel like it."}, {"start": 706.64, "end": 710.22, "text": "If not, I'll keep it greasy anyway and maybe someday you'll feel like it."}, {"start": 710.22, "end": 713.6, "text": "But let's roll right on to item number five,"}, {"start": 713.7, "end": 717.4, "text": "which causes the actual freak out flip out thing"}, {"start": 717.4, "end": 718.86, "text": "that I showed you at the very beginning."}, {"start": 720.84, "end": 723.34, "text": "And that is board orientation because yes,"}, {"start": 723.5, "end": 725.26, "text": "flight controllers do have a direction."}, {"start": 725.82, "end": 728.64, "text": "The gyros on the flight controllers are oriented in a way"}, {"start": 728.64, "end": 731.36, "text": "which it basically knows where forward is."}, {"start": 731.36, "end": 735.28, "text": "And all flight controllers have this handy dandy little arrow somewhere."}, {"start": 735.58, "end": 736.84, "text": "It doesn't always look the same."}, {"start": 736.96, "end": 738.22, "text": "Depends on the manufacturer."}, {"start": 739.46, "end": 743.06, "text": "As long as it isn't like, you know, phallic, you're all good."}, {"start": 743.14, "end": 747.4399999999999, "text": "Hopefully it looks like an arrow and not that thing."}, {"start": 747.64, "end": 748.86, "text": "Anyway, find it."}, {"start": 749.02, "end": 750.68, "text": "Make sure it's facing the front of the quad."}, {"start": 750.84, "end": 752.64, "text": "If it's not facing the front of the quad,"}, {"start": 752.84, "end": 756.02, "text": "then that means you probably have the wrong board orientation."}, {"start": 756.02, "end": 759.66, "text": "Another way to get the wrong board orientation is to flash your quad"}, {"start": 759.66, "end": 761.9, "text": "because sometimes when you flash your quad,"}, {"start": 762.3199999999999, "end": 763.68, "text": "things don't get applied properly."}, {"start": 763.9399999999999, "end": 769.52, "text": "And you'll be surprised that not all manufacturers point the gyro directly at the front"}, {"start": 769.52, "end": 773.22, "text": "the same direction of the arrow as you would think."}, {"start": 773.36, "end": 775.92, "text": "For instance, this is a Darwin 15 amp AIO."}, {"start": 776.48, "end": 778.86, "text": "And although I have the arrow facing forward,"}, {"start": 779.02, "end": 781.22, "text": "I haven't done anything funny with this board."}, {"start": 781.22, "end": 786.82, "text": "It's actually set in the tab I'm going to show you in a second as a 90 degree offset."}, {"start": 787.48, "end": 792.52, "text": "That just means that the manufacturer expects it's already 90 degrees in the wrong direction"}, {"start": 792.52, "end": 793.9, "text": "when they made it."}, {"start": 794.1, "end": 798.46, "text": "So if it doesn't say the right thing, you'll get a flipping quad."}, {"start": 798.7, "end": 802.38, "text": "So let's go over to the configuration tab and I'll show you where to find this setting."}, {"start": 802.38, "end": 807.68, "text": "And here in the configuration tab, you can see the first gyro and the pulldown."}, {"start": 807.8, "end": 812.68, "text": "Mine is set to clockwise 90, which means the gyro is set 90 degrees."}, {"start": 812.82, "end": 817.8, "text": "That's 90 degrees to the clockwise direction off from center."}, {"start": 818.06, "end": 819.96, "text": "There's also a counterclockwise 90."}, {"start": 820.14, "end": 821.86, "text": "There's flip orientations."}, {"start": 822.08, "end": 824.4, "text": "There's all kinds of orientations in here."}, {"start": 824.48, "end": 827.32, "text": "But how do you know which one is correct?"}, {"start": 827.74, "end": 830.36, "text": "Well, you got to turn this thing on."}, {"start": 830.36, "end": 833.64, "text": "And that would be the accelerometer because the only way to validate this,"}, {"start": 833.74, "end": 836.34, "text": "the way I'm going to show you is to use your accelerometer."}, {"start": 836.6800000000001, "end": 838.32, "text": "So if that's already on, you're good."}, {"start": 838.42, "end": 839.54, "text": "I always turn mine off."}, {"start": 839.64, "end": 840.8000000000001, "text": "So I just turned mine on."}, {"start": 840.98, "end": 841.5600000000001, "text": "I saved it."}, {"start": 841.66, "end": 842.42, "text": "I rebooted it."}, {"start": 842.5, "end": 843.5, "text": "And let's get back in."}, {"start": 843.5600000000001, "end": 848.1800000000001, "text": "And I will show you where to go to determine if your board orientation is correct or not."}, {"start": 848.72, "end": 851.5600000000001, "text": "And that will be the setup tab where we get this handy dandy little graph."}, {"start": 851.82, "end": 855.88, "text": "And what we're going to be looking for is when we turn the quad on its yaw axis,"}, {"start": 856.26, "end": 859.74, "text": "the little picture turns appropriately with the yaw axis."}, {"start": 859.74, "end": 864.5600000000001, "text": "When we turn on the pitch axis, the picture turns appropriately on the pitch axis."}, {"start": 865.02, "end": 867.6, "text": "When we turn on the roll axis, the same thing."}, {"start": 867.6800000000001, "end": 868.5600000000001, "text": "It turns appropriately."}, {"start": 868.92, "end": 871.32, "text": "Now, you'll notice that mine turned appropriately."}, {"start": 871.54, "end": 873.14, "text": "That's because mine is set correctly."}, {"start": 873.22, "end": 876.48, "text": "But if yours isn't set correctly, it may look something like this."}, {"start": 876.9, "end": 878.4, "text": "So this is actually me pitching up."}, {"start": 878.46, "end": 880.5, "text": "And you can see how it's actually using the roll axis."}, {"start": 881.0, "end": 882.04, "text": "And I'm yawing."}, {"start": 882.12, "end": 884.02, "text": "And it's not getting that axis at all."}, {"start": 884.12, "end": 885.42, "text": "It is super weird."}, {"start": 885.42, "end": 886.64, "text": "I'm doing this."}, {"start": 886.8399999999999, "end": 889.16, "text": "And the quad basically isn't doing anything appropriate."}, {"start": 889.5999999999999, "end": 891.42, "text": "And that's because my board orientation is wrong."}, {"start": 891.64, "end": 895.9, "text": "And the flight controller has no idea which direction the gyro is actually turning."}, {"start": 896.0999999999999, "end": 900.5999999999999, "text": "Because, I mean, the gyro is not saying left, right, forward, backward."}, {"start": 900.76, "end": 905.16, "text": "It's saying so many degrees per second in whatever axis."}, {"start": 905.52, "end": 907.54, "text": "So we have to deem the axis."}, {"start": 907.6999999999999, "end": 909.48, "text": "And the only way to do that is with board orientation."}, {"start": 909.48, "end": 915.54, "text": "So what you'll want to do is go into the board orientation, kind of get a feel for it in this setup tab."}, {"start": 915.62, "end": 917.08, "text": "Get a feel for what's wrong."}, {"start": 917.1800000000001, "end": 920.84, "text": "Maybe you realize that roll is exactly backwards."}, {"start": 921.12, "end": 924.44, "text": "Well, then you'll kind of have an idea of what you need to do."}, {"start": 924.52, "end": 932.46, "text": "It might be if you're at a CW0 or clockwise zero, meaning it's no offset at all, you need to go to a clockwise 180."}, {"start": 932.74, "end": 934.64, "text": "And it will be exactly backwards."}, {"start": 935.02, "end": 937.7, "text": "If the board is upside down, you may need to add a flip."}, {"start": 937.7, "end": 942.2800000000001, "text": "You just need to mess with it and try some settings until it responds correctly."}, {"start": 942.9200000000001, "end": 948.96, "text": "Or you can go find a config dump from the manufacturer and try to see what the field looks like for this."}, {"start": 949.4200000000001, "end": 950.58, "text": "It's completely up to you."}, {"start": 951.0600000000001, "end": 952.36, "text": "I've had to do it both ways."}, {"start": 952.84, "end": 957.12, "text": "In fact, with this quad, when I first built it, the board didn't have it at all."}, {"start": 957.3000000000001, "end": 964.0400000000001, "text": "Which was weird, even though I had flashed it with the presets and defaults, it didn't have an orientation at all."}, {"start": 964.08, "end": 966.34, "text": "So this quad freaked out when I first built it."}, {"start": 966.34, "end": 968.46, "text": "But sometimes it's just some trial and error."}, {"start": 968.84, "end": 971.48, "text": "Use the picture in the accelerometer to get you to the right place."}, {"start": 972.1, "end": 974.7800000000001, "text": "Just poke around at it until you can get the right thing."}, {"start": 974.88, "end": 982.6600000000001, "text": "Or try to make sense of what exactly is wrong and determine clockwise, counterclockwise, 90, 180, what you need to do to correct it."}, {"start": 983.22, "end": 984.58, "text": "And now for the last problem."}, {"start": 985.0400000000001, "end": 986.96, "text": "The news you absolutely never want to hear."}, {"start": 986.96, "end": 989.5600000000001, "text": "Or you did something wrong when you built it."}, {"start": 990.46, "end": 991.86, "text": "Because it's entirely possible."}, {"start": 992.08, "end": 994.1, "text": "But let me put some concessions around this."}, {"start": 994.36, "end": 999.84, "text": "The whole thing where it flips over, that's usually a board orientation problem or a motor direction problem."}, {"start": 1000.0600000000001, "end": 1005.9200000000001, "text": "The whole thing where it doesn't take off from the ground, that's usually a prop orientation problem."}, {"start": 1006.1600000000001, "end": 1007.4200000000001, "text": "Or a mode problem."}, {"start": 1007.82, "end": 1009.38, "text": "Sometimes a motor direction problem."}, {"start": 1009.38, "end": 1013.74, "text": "The things that I talked about on the bench when you're testing where it shuts down or it doesn't throttle down."}, {"start": 1014.5, "end": 1016.66, "text": "That's completely normal operation."}, {"start": 1017.02, "end": 1019.74, "text": "This last one is when it tries to take off."}, {"start": 1020.06, "end": 1022.0, "text": "So you get the quad, right?"}, {"start": 1022.26, "end": 1024.52, "text": "Your happy little brand new built quad."}, {"start": 1024.64, "end": 1026.64, "text": "It's so fresh, ungreased."}, {"start": 1027.4, "end": 1028.28, "text": "You get it."}, {"start": 1028.46, "end": 1029.3, "text": "You take off."}, {"start": 1029.38, "end": 1030.02, "text": "It hovers."}, {"start": 1030.64, "end": 1032.14, "text": "Maybe it sounds a little funny."}, {"start": 1032.38, "end": 1034.72, "text": "Normally this is preceded by sound a little funny."}, {"start": 1035.24, "end": 1037.82, "text": "You might be too new to the hobby to know what the sound sounds like."}, {"start": 1037.82, "end": 1042.8, "text": "If your quad sounds like a swarm of pissed off bees, there's something wrong."}, {"start": 1043.1, "end": 1050.26, "text": "If it's surging up and down, if the motor is surging up and down, if you can audibly hear the surging, there's something wrong."}, {"start": 1050.58, "end": 1053.6399999999999, "text": "And usually what's wrong is mechanical failure."}, {"start": 1053.8999999999999, "end": 1058.6599999999999, "text": "So either the frame has some kind of crack in it or it's not properly assembled and things aren't tight."}, {"start": 1059.04, "end": 1060.3, "text": "That's entirely possible."}, {"start": 1060.98, "end": 1065.06, "text": "So as you throttle up higher, it takes off to the moon."}, {"start": 1065.06, "end": 1066.7, "text": "And then you may never see your quad again."}, {"start": 1067.82, "end": 1069.3, "text": "Yay, brand new quad."}, {"start": 1069.78, "end": 1071.48, "text": "Just flew 400 feet in the air."}, {"start": 1071.6, "end": 1073.34, "text": "Yes, FAA, just 400 feet."}, {"start": 1073.6, "end": 1075.6399999999999, "text": "And you will no longer see it ever again."}, {"start": 1075.86, "end": 1076.28, "text": "Maybe."}, {"start": 1076.74, "end": 1081.0, "text": "Hopefully, Betaflight catches it and shuts it down or you hit that disarm switch fast enough."}, {"start": 1081.12, "end": 1083.0, "text": "But that is what we call a flyaway."}, {"start": 1083.5, "end": 1087.4399999999998, "text": "And usually a flyaway is because the quad is under filtered."}, {"start": 1087.6599999999999, "end": 1088.62, "text": "What do I mean by that?"}, {"start": 1088.62, "end": 1093.9399999999998, "text": "Well, noise getting back to the gyro is causing this feedback loop of oscillation and it goes crazy."}, {"start": 1094.4599999999998, "end": 1100.8799999999999, "text": "And then it has no choice but to just throttle the motors up because it is in a complete freakout mode and it shoots off to nowhere."}, {"start": 1101.52, "end": 1102.36, "text": "That does happen."}, {"start": 1102.36, "end": 1112.1999999999998, "text": "But usually that is because of a frame problem, a build problem, or just a really terrible tune that has too much gain or not enough filtering."}, {"start": 1112.9199999999998, "end": 1117.86, "text": "And none of those things I can help you with on this video because those are things you have to kind of do with a fine tooth comb."}, {"start": 1117.86, "end": 1122.6, "text": "What I would recommend you do is take a really, really good look at your frame."}, {"start": 1123.1, "end": 1125.08, "text": "Sometimes you don't see the damage."}, {"start": 1125.24, "end": 1129.9799999999998, "text": "Sometimes it's what's called a delamination, which means there's no actually visible crack."}, {"start": 1130.3, "end": 1138.6, "text": "You just kind of have to wiggle it around and pay a lot of attention and do a lot of looking and tightening and everything you can do to make sure it's buttoned up."}, {"start": 1138.9799999999998, "end": 1141.2199999999998, "text": "And then maybe it's a tune problem."}, {"start": 1141.4599999999998, "end": 1143.74, "text": "And you might be running Betaflight defaults."}, {"start": 1143.74, "end": 1150.78, "text": "There's a good chance if you're running Betaflight defaults that it won't do this because of the tune because it's a little over filtered out of the box anyway."}, {"start": 1151.02, "end": 1154.32, "text": "And Betaflight defaults are fairly conservative, although they fly pretty well."}, {"start": 1154.82, "end": 1159.82, "text": "Now, if you flashed a preset to it, it might be a little too hot for your build there, buddy."}, {"start": 1160.18, "end": 1160.94, "text": "It might be."}, {"start": 1161.1, "end": 1162.68, "text": "And it might be what's causing your fly away."}, {"start": 1162.8, "end": 1165.58, "text": "So what I'd recommend is go back to the Betaflight defaults."}, {"start": 1165.88, "end": 1173.52, "text": "Your maiden flight should probably always be on the Betaflight defaults so that you can nearly guarantee you're going to keep your quad after your maiden flight."}, {"start": 1174.14, "end": 1177.56, "text": "But if it tries to fly away on you, that is the most likely cause."}, {"start": 1177.76, "end": 1186.52, "text": "Either mechanical problems with the build or damage to the build or filtering problems that are causing the pit gains to go crazy."}, {"start": 1187.16, "end": 1189.02, "text": "Maybe you have too much pit gain as well."}, {"start": 1189.22, "end": 1190.0, "text": "That can do it too."}, {"start": 1190.1200000000001, "end": 1191.48, "text": "Normally, it's a D-gain problem."}, {"start": 1192.02, "end": 1196.16, "text": "You'll have very hot motors when you do find your quad and it won't be very happy."}, {"start": 1196.76, "end": 1202.5600000000002, "text": "But hopefully you find it because it's your new, now more greasy than it was, baby."}, {"start": 1202.9, "end": 1203.1000000000001, "text": "Right?"}, {"start": 1203.8200000000002, "end": 1204.0800000000002, "text": "Yeah."}, {"start": 1204.42, "end": 1209.68, "text": "Anyway, that's the six reasons that this normally happens to people and I see it all the time."}, {"start": 1209.8400000000001, "end": 1214.18, "text": "If it's happened to you, go down to the comments below and let me know what you found yours out to be."}, {"start": 1214.66, "end": 1216.1000000000001, "text": "Did you just put the props on wrong?"}, {"start": 1216.2, "end": 1217.3000000000002, "text": "There's no shame in that."}, {"start": 1217.3, "end": 1221.58, "text": "We aren't going to shame you for it."}, {"start": 1221.78, "end": 1222.3999999999999, "text": "I promise."}, {"start": 1223.12, "end": 1223.6, "text": "We won't."}, {"start": 1224.1, "end": 1224.8799999999999, "text": "I've done it too."}, {"start": 1225.7, "end": 1233.4199999999998, "text": "I actually, that seven inch back there, did nothing but flip over on itself for the first week after I flashed new version of Metaflight on it."}, {"start": 1233.54, "end": 1234.84, "text": "So, yeah."}, {"start": 1234.98, "end": 1235.76, "text": "It does happen."}, {"start": 1235.76, "end": 1238.08, "text": "So, go down there and tell me how yours went."}, {"start": 1238.16, "end": 1239.26, "text": "Did it fly away on you?"}, {"start": 1239.58, "end": 1241.12, "text": "Did it flip over and go crazy?"}, {"start": 1241.26, "end": 1243.02, "text": "And what did you find the issue to be?"}, {"start": 1243.5, "end": 1248.86, "text": "I'd really be interested to know because I see this literally all the time, especially in beginner forums."}, {"start": 1249.4, "end": 1250.72, "text": "And I hope it was helpful."}, {"start": 1250.94, "end": 1252.8, "text": "I hope that your quad stops doing that."}, {"start": 1252.9, "end": 1257.16, "text": "And I hope that you don't feel like a crazy person that doesn't know what they're doing."}, {"start": 1257.18, "end": 1260.32, "text": "Because it's perfectly fine and common to have these issues happen."}, {"start": 1260.5, "end": 1261.48, "text": "We are all human beings."}, {"start": 1261.8799999999999, "end": 1262.66, "text": "Quads are crazy."}, {"start": 1262.86, "end": 1264.26, "text": "And they're going to do what they're going to do."}, {"start": 1264.3799999999999, "end": 1265.54, "text": "Quads going to quad, man."}, {"start": 1265.9, "end": 1266.66, "text": "Quads going to quad."}, {"start": 1266.74, "end": 1269.12, "text": "And that means sometimes that's going to happen."}, {"start": 1269.4, "end": 1272.12, "text": "That's just the way the prop crumbles."}, {"start": 1273.0, "end": 1274.12, "text": "Hopefully yours don't."}, {"start": 1274.78, "end": 1277.28, "text": "Because that will be an even bigger problem what we're talking about here."}, {"start": 1277.6, "end": 1279.98, "text": "Anyway, until next time, stay greasy."}, {"start": 1281.32, "end": 1282.24, "text": "Flip your quads over."}, {"start": 1282.62, "end": 1283.54, "text": "And I'll catch you later."}, {"start": 1284.9, "end": 1286.46, "text": "Hello, I'm Vick and Ninja."}, {"start": 1287.22, "end": 1288.64, "text": "My teeth feel a little funny today."}, {"start": 1289.28, "end": 1291.5, "text": "They're a little bit brighter than usual."}, {"start": 1291.94, "end": 1294.4, "text": "And, oh, god, they're scratching my gums."}, {"start": 1294.4, "end": 1295.8200000000002, "text": "I can't do it."}, {"start": 1295.9, "end": 1296.52, "text": "Scratching my gums."}, {"start": 1297.42, "end": 1297.8200000000002, "text": "Gross."}, {"start": 1298.3200000000002, "end": 1298.5, "text": "Ugh."}, {"start": 1299.3600000000001, "end": 1301.52, "text": "Tasted like grass and shame."}, {"start": 1301.8600000000001, "end": 1302.1200000000001, "text": "Ugh."}, {"start": 1303.0, "end": 1303.14, "text": "Ugh."}, {"start": 1303.14, "end": 1303.7, "text": "You're at seaery."}, {"start": 1303.94, "end": 1303.96, "text": "Shh."}, {"start": 1304.0600000000002, "end": 1304.66, "text": "Winds."}]}