{"video_id": "OBM5T5_kgdI", "url": "https://www.youtube.com/watch?v=OBM5T5_kgdI", "title": "OBM5T5_kgdI", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 5.0, "text": "In this tutorial I'm going to talk about passive low-pass RC filter circuits."}, {"start": 5.0, "end": 8.0, "text": "So at a very basic level, what are filters?"}, {"start": 8.0, "end": 12.0, "text": "Filters are used to change the frequency content of signals."}, {"start": 12.0, "end": 17.0, "text": "You can experiment with this in software by playing with the graphical equalizer settings in your MP3 player."}, {"start": 17.0, "end": 20.0, "text": "Here's a normal unfiltered sound clip."}, {"start": 30.0, "end": 37.0, "text": "Now if you decrease the low frequencies and allow the higher frequencies to pass through unchanged, you create a high-pass filter."}, {"start": 37.0, "end": 39.0, "text": "It sounds like this."}, {"start": 49.0, "end": 54.0, "text": "You can hear that there is much less bass and only the higher frequencies remain untouched."}, {"start": 54.0, "end": 60.0, "text": "Now if you decrease the high frequencies and allow the low frequencies to pass through unchanged, you get a low-pass filter."}, {"start": 60.0, "end": 62.0, "text": "And that sounds like this."}, {"start": 73.0, "end": 76.0, "text": "You can hear all the bass, but the high-frequency sounds are much quieter."}, {"start": 76.0, "end": 83.0, "text": "Now I'm going to show you how to do this in hardware, and you'll be able to do this with any signal, whether it be audio, video signals, radio frequencies, etc."}, {"start": 84.0, "end": 88.0, "text": "Let's start with RC low-pass filters because they're easy."}, {"start": 88.0, "end": 92.0, "text": "An RC filter is just a filter made out of a resistor and a capacitor."}, {"start": 92.0, "end": 95.0, "text": "The original signal goes in and the filtered signal comes out."}, {"start": 95.0, "end": 100.0, "text": "The reason why this works is that the voltage on a capacitor cannot instantaneously change."}, {"start": 100.0, "end": 108.0, "text": "When you have a resistor that slows the charging of the capacitor, your output voltage might not be able to follow the sudden changes in the input voltage."}, {"start": 108.0, "end": 111.0, "text": "As a result, higher frequencies get filtered out."}, {"start": 111.0, "end": 119.0, "text": "I'm going to build a low-pass filter with a 10 nF capacitor and a 10 kOhm resistor, and show you how it affects different frequency signals."}, {"start": 119.0, "end": 122.0, "text": "There's no particular reason why I'm using these values."}, {"start": 122.0, "end": 126.0, "text": "It's just for the sake of an example, and I'll do more examples later."}, {"start": 126.0, "end": 128.0, "text": "So this is a very important equation."}, {"start": 128.0, "end": 132.0, "text": "This is the equation that is used to determine the cutoff frequency of the filter."}, {"start": 132.0, "end": 141.0, "text": "If I plug in my chosen values of 10 kOhms and 10 nF, I get a cutoff frequency of 1592 Hz."}, {"start": 141.0, "end": 144.0, "text": "And I'm going to round that up to 1600 Hz."}, {"start": 144.0, "end": 148.0, "text": "Okay, so this low-pass filter has a cutoff frequency of 1600 Hz."}, {"start": 148.0, "end": 150.0, "text": "But what does that mean?"}, {"start": 150.0, "end": 155.0, "text": "This means that at frequencies below 1600 Hz, the signal passes through unchanged."}, {"start": 155.0, "end": 162.0, "text": "If I feed in sine waves of different frequencies, you can see that from 45 to 200 Hz, the output is the same as the input."}, {"start": 162.0, "end": 168.0, "text": "10 volts peak to peak."}, {"start": 168.0, "end": 180.0, "text": "Now at frequencies approaching 1600 Hz, the amplitude is slowly dropping on the output."}, {"start": 180.0, "end": 186.0, "text": "By the time we reach the 1600 Hz cutoff frequency, we've got a reduction of about 30%."}, {"start": 186.0, "end": 190.0, "text": "The cutoff frequency is the point where the filtering effect really starts kicking in."}, {"start": 190.0, "end": 194.0, "text": "And another thing you'll notice is that the two sine waves no longer line up."}, {"start": 194.0, "end": 196.0, "text": "There's been a shift in phase."}, {"start": 196.0, "end": 200.0, "text": "That's because the filter is introducing a small delay in the signal."}, {"start": 200.0, "end": 204.0, "text": "Most of the time you won't care, but it is something you should be aware of."}, {"start": 204.0, "end": 207.0, "text": "Now let's increase the frequency way beyond the cutoff point."}, {"start": 207.0, "end": 211.0, "text": "At 15 kHz, there's a massive reduction in amplitude."}, {"start": 211.0, "end": 217.0, "text": "And as we get into higher frequencies like 50 kHz and beyond, there's almost nothing left of the signal."}, {"start": 217.0, "end": 225.0, "text": "Now the oscilloscope example was just a visual introduction to the concept of a low-pass filter,"}, {"start": 225.0, "end": 228.0, "text": "and how it affects voltages in your circuits."}, {"start": 228.0, "end": 233.0, "text": "Normally what engineers do is describe the filter characteristics with a graph called a Bode plot."}, {"start": 233.0, "end": 238.0, "text": "Earlier I mentioned that the cutoff frequency is the point at which the filter starts kicking in."}, {"start": 238.0, "end": 242.0, "text": "Well you should know that in the real world, you will never get a filter like this,"}, {"start": 242.0, "end": 246.0, "text": "where as soon as you hit the cutoff frequency, all the higher frequencies get reduced to zero."}, {"start": 246.0, "end": 249.0, "text": "Here's a more realistic Bode plot."}, {"start": 249.0, "end": 255.0, "text": "In realistic filters, what happens is that for low frequencies, you get this flat response where the amplitude doesn't change."}, {"start": 255.0, "end": 260.0, "text": "Then as you slowly approach the cutoff frequency, things start to decay a little."}, {"start": 260.0, "end": 266.0, "text": "At the exact cutoff frequency, the amplitude is reduced by 3 decibels, or even simpler than that,"}, {"start": 266.0, "end": 271.0, "text": "at the cutoff frequency, the amplitude is reduced by 29%."}, {"start": 271.0, "end": 278.0, "text": "Now a little bit after you've hit the cutoff point, the filter keeps reducing the amplitude by 20 decibels per decade."}, {"start": 278.0, "end": 285.0, "text": "That means that for every time the frequency increases by a factor of 10, the amplitude decays by a factor of 10."}, {"start": 285.0, "end": 291.0, "text": "Bode plots like this are great ways to predict how your filter will perform at a wide range of frequencies,"}, {"start": 291.0, "end": 294.0, "text": "and in a future video I'll show you how to make them."}, {"start": 294.0, "end": 297.0, "text": "For now, let's get some practice creating some more low pass filters."}, {"start": 297.0, "end": 302.0, "text": "Let's say I want a low pass filter that goes before a subwoofer's amplifier,"}, {"start": 302.0, "end": 306.0, "text": "to make sure that the woofer is only outputting really low bass frequencies."}, {"start": 306.0, "end": 310.0, "text": "Let's say I want a cutoff frequency of about 150 Hz."}, {"start": 310.0, "end": 313.0, "text": "Here's the equation again to calculate the cutoff frequency."}, {"start": 313.0, "end": 319.0, "text": "Now, I can play around with random values of R and C to get the cutoff value of 150 Hz,"}, {"start": 319.0, "end": 325.0, "text": "but from experience I know that I should choose R and then let the equation determine the value of C."}, {"start": 325.0, "end": 330.0, "text": "I'm going to choose a 1 kOhm resistor because I don't want to overload the audio source."}, {"start": 330.0, "end": 332.0, "text": "In this case it's an MP3 player."}, {"start": 332.0, "end": 337.0, "text": "So here I've rearranged the equation to give me a way of calculating the capacitance needed for the filter"}, {"start": 337.0, "end": 339.0, "text": "based on a chosen resistance value."}, {"start": 339.0, "end": 343.0, "text": "And it turns out that the value I need is 1.06 microfarads."}, {"start": 343.0, "end": 346.0, "text": "Let's round that down to 1 microfarad."}, {"start": 346.0, "end": 350.0, "text": "So here's the 150 Hz low pass filter as a schematic."}, {"start": 350.0, "end": 352.0, "text": "And here it is on the breadboard."}, {"start": 352.0, "end": 354.0, "text": "Now I'm going to play two sound clips."}, {"start": 354.0, "end": 356.0, "text": "The first one has no filtering."}, {"start": 356.0, "end": 360.0, "text": "The second one has been filtered by our low pass filter and amplified a little."}, {"start": 360.0, "end": 370.0, "text": "You can hear that the bass is clearly there, but most of the rest of the music is missing."}, {"start": 370.0, "end": 376.0, "text": "Okay, that was an audio example, but I want to show you how low pass filters can be used with much more than just sine waves."}, {"start": 376.0, "end": 380.0, "text": "Let's say you've got a microcontroller that's outputting a pulse width modulated square wave."}, {"start": 380.0, "end": 384.0, "text": "Now let's say you want to convert that to a smooth continuous voltage that is an average of the sine waves."}, {"start": 384.0, "end": 390.0, "text": "Essentially we want to filter out all high frequencies and be left with DC."}, {"start": 390.0, "end": 396.0, "text": "So let's take our handy cutoff equation and make the cutoff a very low value of 1 Hz."}, {"start": 396.0, "end": 400.62, "text": "say you want to convert that to a smooth continuous voltage that is an average of the square wave's"}, {"start": 400.62, "end": 405.54, "text": "voltage. Essentially we want to filter out all high frequencies and be left with DC."}, {"start": 405.54, "end": 411.42, "text": "So let's take our handy cutoff equation and make the cutoff a very low value of 1 Hertz."}, {"start": 411.42, "end": 417.0, "text": "I'm going to choose a resistor value of 100 ohms so that this filter can still power something"}, {"start": 417.0, "end": 422.1, "text": "useful like an LED. You should always think about what resistor value will work best with"}, {"start": 422.1, "end": 428.1, "text": "your source signal and your chosen load. So with R equals 100 ohms and reusing the same equation,"}, {"start": 428.1, "end": 435.90000000000003, "text": "we get a capacitance of 1592 microfarads. Some extra capacitance won't hurt in this case because we"}, {"start": 435.90000000000003, "end": 441.66, "text": "want as much filtering as possible, so let's round that up to 2000 microfarads. Now let's see how this"}, {"start": 441.66, "end": 448.5, "text": "heavy filtering affects the square wave. Okay, here I have a 54 Hertz PWM signal and the average voltage"}, {"start": 448.5, "end": 455.1, "text": "is 4.24 volts. At the output of the filter it looks like we've got almost pure DC with an average voltage"}, {"start": 455.1, "end": 461.58, "text": "of 4.16 volts. That's pretty close. Now I've lowered the duty cycle of the signal and on the input the"}, {"start": 461.58, "end": 468.12, "text": "average voltage is 1.68 volts. After the filter it looks like we're very close to clean DC with an"}, {"start": 468.12, "end": 474.42, "text": "average voltage of 1.44 volts. Again that's pretty close and as you've probably figured out real world"}, {"start": 474.42, "end": 480.42, "text": "filters aren't 100% efficient, so you'll always lose a little energy as heat. Now you might be wondering,"}, {"start": 480.42, "end": 486.42, "text": "can you put filters back to back in series for an even heavier filtering effect? And the answer is yes."}, {"start": 486.42, "end": 492.42, "text": "However, since each filter puts a load on the previous filter, the math behind calculating the cutoff frequencies"}, {"start": 492.42, "end": 498.42, "text": "gets really complicated. That's the point where I bust out a circuit simulator like LTSpice and let it do the hard work"}, {"start": 498.42, "end": 505.42, "text": "for me. I'll make a tutorial on filter simulation with LTSpice in another video. In the meantime, check out my video"}, {"start": 505.42, "end": 511.42, "text": "on passive RC high pass filters. The good news is they're almost exactly the same as low pass filters."}]}