{"video_id": "PlKeFj5teo4", "url": "https://www.youtube.com/watch?v=PlKeFj5teo4", "title": "PlKeFj5teo4", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 6.44, "text": "There's two very critical pieces of hardware on a drone that allows it to fly autonomously."}, {"start": 7.0600000000000005, "end": 11.14, "text": "Today we're going to cover what the difference is between a flight controller and a flight computer"}, {"start": 11.14, "end": 16.46, "text": "in the context of an autonomous drone, and why you might want to keep them separate for your particular project."}, {"start": 17.38, "end": 21.44, "text": "There's two key levels of control that are going on behind the scenes in an autonomous drone."}, {"start": 22.5, "end": 26.34, "text": "Of course, much more complex systems have many levels with specific functionality,"}, {"start": 26.34, "end": 31.44, "text": "but I want to focus on the bare minimum in order to have a drone do something useful entirely on its own."}, {"start": 32.36, "end": 37.9, "text": "The interloop controller is what stabilizes the vehicle either at a specified angle or vehicle body rate."}, {"start": 39.120000000000005, "end": 40.2, "text": "Drones are inherently unstable."}, {"start": 40.58, "end": 43.519999999999996, "text": "They require active stabilization to the motors to keep it in the air at all."}, {"start": 44.379999999999995, "end": 48.32, "text": "Without this, even the most skilled of pilots could not keep them in the air for more than a few seconds."}, {"start": 49.480000000000004, "end": 54.56, "text": "The outerloop controller can be thought of as a simulated pilot that is generating pilot commands."}, {"start": 54.56, "end": 59.72, "text": "It does this in response to various sensor data used to figure out where the drone is in space"}, {"start": 59.72, "end": 62.22, "text": "to get it from point A to B without crashing."}, {"start": 63.040000000000006, "end": 66.24000000000001, "text": "We call the board that handles interloop control the flight controller."}, {"start": 66.94, "end": 71.08, "text": "This is the heart of the drone that allows a pilot to talk to it with a requested vehicle state"}, {"start": 71.08, "end": 74.5, "text": "and output stabilized commands to the motors to achieve that state."}, {"start": 75.4, "end": 78.7, "text": "A flight computer is what is used to conduct all outerloop control"}, {"start": 78.7, "end": 82.46000000000001, "text": "and requests a vehicle state from the flight controller just like a pilot does."}, {"start": 82.46, "end": 87.3, "text": "The flight computer is the decision-making brain of a drone that makes this request"}, {"start": 87.3, "end": 92.83999999999999, "text": "as it is informed by various onboard sensor data combined with what specific task it should be carrying out."}, {"start": 93.66, "end": 97.67999999999999, "text": "For example, GPS data tells the flight computer where it is in space."}, {"start": 98.3, "end": 100.41999999999999, "text": "If the mission is to travel from point A to B,"}, {"start": 100.82, "end": 104.1, "text": "then the flight computer must generate the required commands to the flight controller"}, {"start": 104.1, "end": 105.89999999999999, "text": "to navigate the drone accordingly."}, {"start": 105.9, "end": 110.62, "text": "Let's take a look at what processes are occurring in the flight controller or interloop."}, {"start": 111.28, "end": 115.86000000000001, "text": "First, accelerometer and gyro data is pulled from the flight controller's inertial measurement unit."}, {"start": 116.54, "end": 120.80000000000001, "text": "This data must be processed with some sort of filter in order to estimate the drone's orientation,"}, {"start": 121.16000000000001, "end": 124.64000000000001, "text": "as individual accelerometer or gyro data cannot do this alone."}, {"start": 125.2, "end": 129.24, "text": "The simplest and least accurate filtering technique is called a complementary filter."}, {"start": 129.24, "end": 135.04000000000002, "text": "The most accurate filter may be a Kalman-type filter, though it is very computationally costly."}, {"start": 136.16, "end": 138.62, "text": "A magic filter is a good compromise between the other two."}, {"start": 139.74, "end": 142.70000000000002, "text": "Next, the flight controller needs to know the desired vehicle state,"}, {"start": 143.08, "end": 145.58, "text": "or setpoint, commanded by the pilot or flight computer."}, {"start": 146.38, "end": 151.42000000000002, "text": "This setpoint is used to compute the error in the drone's current orientation from where it is desired to be."}, {"start": 151.42, "end": 155.67999999999998, "text": "A PID controller is used to generate stabilized signals based on this error."}, {"start": 156.44, "end": 160.32, "text": "These signals for each vehicle axis of rotation can be applied to the drone's motors"}, {"start": 160.32, "end": 163.04, "text": "according to the dynamic configuration in the control mixer."}, {"start": 163.79999999999998, "end": 169.54, "text": "For example, to stabilize pitch, the forward motors and rear motors must receive opposite stabilized signals."}, {"start": 170.33999999999997, "end": 174.32, "text": "We then write these signals out to the motors, which in turn generates a vehicle response."}, {"start": 174.82, "end": 178.83999999999997, "text": "This response is again measured by the IMU, and we have created a feedback loop."}, {"start": 178.84, "end": 183.66, "text": "Typically on a flight controller, this process runs at 1000 or more cycles per second."}, {"start": 184.22, "end": 188.52, "text": "So now that we can see all of the challenges that must be solved in order to complete this loop,"}, {"start": 188.94, "end": 190.44, "text": "let's see what this looks like in action."}, {"start": 192.34, "end": 196.42000000000002, "text": "The previous flight controller loop diagram can be supplemented with additional filtering,"}, {"start": 196.72, "end": 198.32, "text": "control techniques, or safety measures."}, {"start": 198.9, "end": 203.26, "text": "With a properly designed and tuned controller, a very fast and accurate response is possible."}, {"start": 204.82, "end": 207.28, "text": "Next, we will look at the operation of the flight computer."}, {"start": 207.28, "end": 211.04, "text": "This is a very broad overview of what could be happening on board,"}, {"start": 211.42, "end": 213.54, "text": "though the specifics vary based on the application."}, {"start": 214.4, "end": 217.36, "text": "Because there is so much going on, it is not necessarily a loop either,"}, {"start": 217.64, "end": 220.42000000000002, "text": "but a continuously updated stream of input and output data."}, {"start": 221.22, "end": 225.38, "text": "The flight computer needs an interrupt handler to process sensor data as it becomes available."}, {"start": 226.24, "end": 228.42000000000002, "text": "The popular system used is ROS,"}, {"start": 229.0, "end": 233.32, "text": "which allows for easy access across multiple sensors, computations, and outputs."}, {"start": 233.32, "end": 238.78, "text": "An autonomous drone might have a combination of cameras, LIDAR, or GPS on board."}, {"start": 239.34, "end": 242.38, "text": "This sensor data is used to estimate the drone's position in space"}, {"start": 242.38, "end": 246.5, "text": "from information about its surroundings or movement, which is known as odometry."}, {"start": 247.28, "end": 251.68, "text": "Once the drone knows where it is, a mission planner can be used to decide where to go next."}, {"start": 251.68, "end": 254.6, "text": "A typical mission planner might look something like this."}, {"start": 255.4, "end": 258.90000000000003, "text": "It must first decide what the current task is, for example, flying through a window."}, {"start": 259.8, "end": 262.74, "text": "Next, the mission planner may request that the drone search for the target"}, {"start": 262.74, "end": 264.74, "text": "by either flying forward or turning around."}, {"start": 265.36, "end": 267.04, "text": "Then once the target is identified,"}, {"start": 267.42, "end": 271.54, "text": "it must converge on it to ensure that it has actually found the target and not something else."}, {"start": 272.26, "end": 275.34000000000003, "text": "Finally, the desired maneuver for that target can be executed."}, {"start": 276.12, "end": 279.0, "text": "Once this is complete, the mission planner decides what to do next."}, {"start": 279.0, "end": 284.48, "text": "The mission planner conducts its operations and in the process requests that the drone moves around."}, {"start": 285.18, "end": 288.42, "text": "A controller is used to generate requested vehicle state set points"}, {"start": 288.42, "end": 290.82, "text": "based on where the mission planner wants the drone to be"}, {"start": 290.82, "end": 293.24, "text": "and where the odometry thinks the drone is."}, {"start": 293.96, "end": 298.82, "text": "These requests are then sent to the flight controller at a rate of about 50 to 100 times per second."}, {"start": 299.72, "end": 304.26, "text": "Here we can see that full and complicated process in action in a simple autonomous landing demo."}, {"start": 305.0, "end": 307.36, "text": "The mission planner's goal here is to land on the target."}, {"start": 307.36, "end": 313.32, "text": "It first performs a forward search and then once the target is identified by a downward-facing camera,"}, {"start": 313.76, "end": 318.3, "text": "requests that the vehicle begins to descend as the detection algorithm converges on the target."}, {"start": 318.3, "end": 331.68, "text": "You might rightfully be asking,"}, {"start": 332.02000000000004, "end": 333.8, "text": "why not just do everything on the flight computer?"}, {"start": 334.48, "end": 336.52, "text": "My answer to that is you certainly can,"}, {"start": 337.2, "end": 341.3, "text": "and many companies such as DJI do that with their custom boards to save power and weight,"}, {"start": 341.3, "end": 344.82, "text": "but if you are assembling your own system, you may run into some problems."}, {"start": 345.7, "end": 348.38, "text": "First, the flight computer speed is not guaranteed constant,"}, {"start": 348.82, "end": 353.86, "text": "which is a problem for stabilizing a vehicle which requires constant, high-speed operation to stay in the air."}, {"start": 354.58000000000004, "end": 360.5, "text": "A flight computer's CPU may become overloaded if excessive computations are being demanded from computer vision algorithms,"}, {"start": 360.90000000000003, "end": 363.78000000000003, "text": "which slow down the whole system or even crash it entirely."}, {"start": 363.78, "end": 369.79999999999995, "text": "So generally speaking, it is best to have a dedicated single-task microcontroller for stabilization"}, {"start": 369.79999999999995, "end": 374.11999999999995, "text": "that guarantees the vehicle will be stabilized regardless of the health of the flight computer."}, {"start": 374.96, "end": 377.23999999999995, "text": "In the event that the flight computer encounters an error,"}, {"start": 377.65999999999997, "end": 380.88, "text": "you can always switch back to the pilot transmitter to safely land the vehicle."}, {"start": 380.88, "end": 383.68, "text": "So to answer our original question,"}, {"start": 384.18, "end": 387.65999999999997, "text": "the flight controller is a dedicated board to simply stabilize the vehicle,"}, {"start": 387.94, "end": 392.64, "text": "whereas the flight computer performs all the onboard decision-making and sensing, much like a pilot."}, {"start": 393.26, "end": 397.06, "text": "Both are very important for safe and reliable autonomous drone operation."}, {"start": 398.65999999999997, "end": 403.3, "text": "This was a very broad overview of some of the things going on inside an autonomous drone,"}, {"start": 403.52, "end": 405.0, "text": "and is by no means comprehensive."}, {"start": 405.68, "end": 406.71999999999997, "text": "I hope you've learned something,"}, {"start": 406.98, "end": 410.28, "text": "and you now have a better understanding of some of the topics that need to be addressed"}, {"start": 410.28, "end": 411.88, "text": "to create a fully autonomous drone."}, {"start": 412.46, "end": 414.52, "text": "If you're interested in some more of the nitty-gritty,"}, {"start": 414.91999999999996, "end": 418.47999999999996, "text": "check out my other video on a fully autonomous drone completing an obstacle course,"}, {"start": 418.76, "end": 419.4, "text": "and how we did it."}]}