{"video_id": "Sd6CcsCgFbg", "url": "https://www.youtube.com/watch?v=Sd6CcsCgFbg", "title": "Sd6CcsCgFbg", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.48, "end": 7.6000000000000005, "text": "Hello and welcome to Enritsu's webinar entitled Network Extraction and De-Embedding Techniques"}, {"start": 7.6000000000000005, "end": 14.0, "text": "for Differential Printed Circuit Probe. My name is Arno Pettai. I'm a field applications engineer"}, {"start": 14.0, "end": 22.16, "text": "at Enritsu company and my specialty is in B&As and joining me today is Brian Shoemaker, president and"}, {"start": 22.16, "end": 31.04, "text": "founder of DVT Solutions, a company that makes probing systems, solutions and probes and connectors."}, {"start": 32.480000000000004, "end": 40.24, "text": "I also want to recognize Bill Rosas of Signal Microwave for supplying the verification board"}, {"start": 40.24, "end": 48.400000000000006, "text": "that we're using today to perform the network extraction as well as the verification and"}, {"start": 48.4, "end": 57.36, "text": "Dr. Jing Chao Wang of Atai Tech who has been so kind to allow us to use his ISD software"}, {"start": 58.16, "end": 61.519999999999996, "text": "which allows us to do the network extraction of the probe."}, {"start": 63.44, "end": 70.88, "text": "So today we're going to cover first of all the basic topics of network extraction as well as"}, {"start": 70.88, "end": 77.03999999999999, "text": "embedding and de-embedding. These are common terms that are used in conjunction with VNAs but not"}, {"start": 77.04, "end": 82.88000000000001, "text": "very well understood. So I want to spend a few minutes explaining these important concepts."}, {"start": 84.16000000000001, "end": 91.44000000000001, "text": "After that I will turn over to Brian who will explain the DVT Solutions probing system and talk"}, {"start": 91.44000000000001, "end": 98.48, "text": "about the probe in particular and some of the unique advantages and features of that. And Brian will also"}, {"start": 98.48, "end": 109.44, "text": "take us through the ISD software and how we generate using that software the S4P model for a differential probe."}, {"start": 110.56, "end": 116.64, "text": "Then I will discuss Enritsu's VNA family and how we make differential measurements which is critical"}, {"start": 116.64, "end": 122.72, "text": "here because we're trying to obviously get differential measurement results so we need a four port"}, {"start": 122.72, "end": 130.88, "text": "VNA to do that. And at the end we'll apply and verify the probe model that we've extracted using the"}, {"start": 130.88, "end": 138.4, "text": "Atai Tech software and display that on a VNA with both the embedding or de-embedding implied and de-embedding off"}, {"start": 138.4, "end": 144.72, "text": "so we can actually see the difference which would be the probe loss that we're looking at. And we'll"}, {"start": 144.72, "end": 152.4, "text": "summarize all that with a live demonstration at the very end. So first of all what is network extraction?"}, {"start": 152.4, "end": 159.36, "text": "Well network extraction is a tool that we use to generate the S-parameters or the model for some"}, {"start": 159.36, "end": 168.4, "text": "network that we want to then embed or de-embed later from a VNA test port. This model can be single-ended"}, {"start": 168.4, "end": 174.4, "text": "or differential. And as I said earlier in today's presentation we're going to use the Atai Tech ISD"}, {"start": 174.4, "end": 182.08, "text": "software to perform this network extraction in our example being a differential probe. But there's"}, {"start": 182.08, "end": 187.92000000000002, "text": "also other uses for network extraction. We can extract portions of a circuit on a PC board. We can"}, {"start": 189.44, "end": 196.56, "text": "extract the launches for a test fixture. And it's an alternative to using time domain gating. That's"}, {"start": 196.56, "end": 205.52, "text": "always been a technique used in the past as well for isolating a network in time and then going back"}, {"start": 205.52, "end": 214.32, "text": "to frequency domain and capturing the characteristics in an S4P or S2P format. Or doing just simple test"}, {"start": 214.32, "end": 221.68, "text": "port extensions. But those of course don't always take into account loss and other characteristics."}, {"start": 221.68, "end": 229.36, "text": "So it's very important to use network extraction especially in cases where you don't have all"}, {"start": 229.36, "end": 233.6, "text": "the CAL kits available at the various reference planes of interest or where you can't connect"}, {"start": 233.6, "end": 239.12, "text": "it through. And in our example today we simply cannot connect two probes together because it would be the"}, {"start": 239.92000000000002, "end": 245.76000000000002, "text": "chance of damaging probe tips in that case. So we are using network extraction in this case"}, {"start": 245.76, "end": 254.32, "text": "to avoid having to make that type of through measurement. And what we're trying to get of"}, {"start": 254.32, "end": 263.2, "text": "course is as a result is an SNP formatted file or model for the probe that we will then use in embedding"}, {"start": 263.2, "end": 270.08, "text": "de-embedding. So then what is embedding de-embedding? Well much like in a circuit simulator it's useful to add or"}, {"start": 270.08, "end": 276.08, "text": "remove networks from a given measured results. So we're able to look at a live measurement on a VNA"}, {"start": 276.64, "end": 284.64, "text": "and actually add a network and have that measurement display that network as if the matching network was"}, {"start": 284.64, "end": 292.15999999999997, "text": "present. Or in the case of de-embedding we can remove a fixture or in this case in our example a probe"}, {"start": 292.72, "end": 298.96000000000004, "text": "from the measurement so that we can concentrate or or isolate a measurement to just the device"}, {"start": 298.96000000000004, "end": 305.04, "text": "under test of interest. And an embedding de-embedding function is a standard feature in a VNA"}, {"start": 305.68, "end": 314.40000000000003, "text": "and basically it allows us to add that network or remove that network and measure that new data live on"}, {"start": 314.40000000000003, "end": 320.24, "text": "the instrument. Of course we need to have a standard VNA calibration performed first."}, {"start": 320.24, "end": 327.84000000000003, "text": "So this would be your standard SOLT or other method that you choose to use. And then we can apply this"}, {"start": 327.84000000000003, "end": 331.76, "text": "embedding de-embedding to two, three, and four port devices under test."}, {"start": 334.96000000000004, "end": 341.44, "text": "Now what kind of networks can we mathematically add or remove from ports of a VNA? Well we can have"}, {"start": 341.44, "end": 346.88, "text": "standard circuit elements. These would be lumped elements such as shunt and series, inductors, resistors,"}, {"start": 346.88, "end": 351.04, "text": "capacitors, and transmission lines. We can put in the characteristics of a transmission line"}, {"start": 351.68, "end": 361.28, "text": "and add and subtract that. We can also in our case here today use S2P and S4P models of the networks"}, {"start": 361.28, "end": 367.28, "text": "that we want to add and subtract. And so these would be created in network extraction and then applied"}, {"start": 367.28, "end": 373.52, "text": "here in the embedding de-embedding. Now there's also another example of a very simplified case of"}, {"start": 373.52, "end": 379.68, "text": "de-embedding and this applies to optoelectronic components where you only want to de-embed in"}, {"start": 379.68, "end": 385.59999999999997, "text": "this case the transmission measurement portion. So you're not concerned with reflection here."}, {"start": 385.59999999999997, "end": 391.84, "text": "So you're doing a subset of full de-embedding by just treating the transmission only so that we can"}, {"start": 391.84, "end": 397.2, "text": "isolate a measurement to either an optical modulator or a photo receiver. Assuming of course you have a"}, {"start": 397.2, "end": 402.4, "text": "characterization file for one or the other that you intend to de-embed to isolate the measurement"}, {"start": 402.4, "end": 407.52, "text": "measurement on the device under test of choice. So this would be the same functionality as in a"}, {"start": 407.52, "end": 412.47999999999996, "text": "lightweight component analyzer or something else that Enritsu offers as part of their VNAs."}, {"start": 415.76, "end": 423.76, "text": "So to summarize embedding and de-embedding, we can view results as if a different launch structure"}, {"start": 423.76, "end": 430.15999999999997, "text": "was present. So we can have an embedding task where we're adding something and we want to visualize it on"}, {"start": 430.16, "end": 438.16, "text": "the screen live with that launch structure present. We can also look at measurements with some matching"}, {"start": 438.16, "end": 444.0, "text": "circuit applied that we've gotten from our simulator and we can view that result live with that matching"}, {"start": 444.0, "end": 449.84000000000003, "text": "circuit applied or we can add a cable length or a transmission length or launch as needed. So that's"}, {"start": 449.84000000000003, "end": 454.24, "text": "in the case of the embedding where you're adding some network. In the case of de-embedding which is what"}, {"start": 454.24, "end": 459.28000000000003, "text": "we're demonstrating today, we're going to look at a probe but there's also other examples such as test"}, {"start": 459.28000000000003, "end": 467.92, "text": "fixture or a transmission line that you may want to remove on a fixture or a matching circuit that you"}, {"start": 467.92, "end": 477.28000000000003, "text": "want to remove the effects of physically in the measurement case. Okay at this point I'm going to turn it"}, {"start": 477.28, "end": 484.79999999999995, "text": "over to Brian. We'll explain the probing systems. First I want to discuss what is a differential probe so"}, {"start": 484.79999999999995, "end": 491.11999999999995, "text": "that it will become more relevant as to why we want to create de-embedding files and models in order to"}, {"start": 491.11999999999995, "end": 497.2, "text": "remove any artifacts within the probe for the measurements. So differential probe, we developed"}, {"start": 497.2, "end": 504.79999999999995, "text": "the first differential true differential probe back in Brown in 2005 when the LVDS circuits started to come"}, {"start": 504.8, "end": 511.12, "text": "out from National Semiconductor and a few other companies. This changed the entire architecture"}, {"start": 511.12, "end": 520.08, "text": "at that time from point to point to a dual line differential interface and it was designed so that"}, {"start": 520.08, "end": 526.8, "text": "you're able to reject common mode noise so the power supply glitch if it occurred would just wipe out"}, {"start": 526.8, "end": 534.0, "text": "your data and your system crashes. It also allows you to use a lower voltage to define the ones and zeros"}, {"start": 534.0, "end": 542.88, "text": "so that you can move data faster down the transmission line. In this slide set here I have an example of"}, {"start": 542.88, "end": 548.32, "text": "what an LVDS interface might look like. You've got your differential transmitter, your receiver. We had to"}, {"start": 548.32, "end": 554.24, "text": "develop a probe to measure the impedance and the s parameters of this transmission line according to the"}, {"start": 554.24, "end": 565.12, "text": "specifications of the specifications of the drivers. So in a true differential probe, as kind of describes the fields that are"}, {"start": 565.12, "end": 572.96, "text": "going up and down the transmission line on the bottom of the of the slide, is that it sends a positive and negative pulse down the"}, {"start": 572.96, "end": 582.24, "text": "transmission line so that it creates a virtual ground and not not have to rely upon a common mode or a physical ground. So there's coupling there that has to be"}, {"start": 582.24, "end": 591.12, "text": "modeled later and I will just discuss how we do this with a software product but in order to create a good model of a"}, {"start": 591.12, "end": 599.12, "text": "differential probe you have to be able to model the coupling between the two transmission lines. Next, let's discuss the model development."}, {"start": 599.12, "end": 611.12, "text": "Well, currently we have a partnership with a tie tech which is a company that makes the in situ de embedding or ISD software that allows us to create a differential probe"}, {"start": 611.12, "end": 630.0, "text": "a differential probe to include the crosstalk or what we'd call if it's functional a virtual ground and it creates a S4P touchstone file that we can input into the VNA that allows us to then take this model and then de embed the probe from the model."}, {"start": 630.0, "end": 648.0, "text": "So the model contains coupling between the differential conductors. The model creates its own virtual ground so the probes do not require a ground between the signal pins. If you draw your attention to the picture at the lower right hand side, we've just introduced these differential probes."}, {"start": 648.0, "end": 666.0, "text": "These will go up to 70 gigahertz and as you can see the picture are kind of the center or a lot off to the left of the probe. There's only two signal pins. There is no ground so we're completely relying upon the coupling of the probe to carry the energy down back and forth through the probe."}, {"start": 666.0, "end": 678.0, "text": "And to model that is a really, really, really difficult thing to do. But we've been able to do that with the tie tech software that we will discuss later on and have a live model creation demonstration later."}, {"start": 678.0, "end": 695.0, "text": "Now probe the embedding process. What we do to create the model itself of the tie tech software pretty much needs three different measurements and open a short and one that's a measurement called a we call a probe in situ."}, {"start": 695.0, "end": 707.0, "text": "It's basically it's a probe differential probing a differential line that connects to a connector and these three waveforms or S parameters are imported into I attack to create the S4P to create the S4P to create the S4P to create the S4P."}, {"start": 708.0, "end": 725.0, "text": "The S4P model. By doing this, it allows us to create a more accurate embedding model to model the differential crosstalk. You get more accurate S-parameter measurements by removing the probe loss from the measurements and it sets the measurement reference plane at the probe tips."}, {"start": 725.0, "end": 737.98, "text": "Now, lastly, I need to kind of define the differences between a differential probe and what the industry really calls a dual probe. Since we define a differential probe is that you have to have the"}, {"start": 737.98, "end": 753.98, "text": "transmission lines in the differential lines coupled in most probes on a marketplace that believe we're the only company DVT solutions that do have a differential probe is that they just use two coax cables in a plastic box."}, {"start": 753.98, "end": 763.98, "text": "And with the shields around the conductors, the conductors are not coupled. So that very nature and that architecture."}, {"start": 763.98, "end": 773.98, "text": "It's impossible to create a virtual ground because the conductors are not coupled and are isolated. So in a sense, these are referred to as dual probes."}, {"start": 773.98, "end": 782.98, "text": "Now, I wanted to kind of since we build probe systems, a lot of people ask, well, I just need a quotation for some probes thinking that's all you really need."}, {"start": 782.98, "end": 791.98, "text": "But it's not practical to hold in your hand probes onto a board control your instrument at the same time without creating bad data."}, {"start": 791.98, "end": 798.98, "text": "So essentially a probe system that that we put together, it's not a fixed platform."}, {"start": 798.98, "end": 803.98, "text": "They're basically components that consist of a probe positioner that you attach the probe."}, {"start": 803.98, "end": 817.98, "text": "And what that does is it it holds it in place planar to the surface of the board, which allows us to go down onto the test pads with some maybe some minor planar adjustment controls."}, {"start": 817.98, "end": 824.98, "text": "Allows the probe tips and the test pads to make contact so that you get good data coming from it."}, {"start": 824.98, "end": 830.98, "text": "Secondly, in order to see that the probe tips are making contact with the test pads, you need a camera system."}, {"start": 830.98, "end": 837.98, "text": "And that allows us to view the probe tips making contact with the test pads and also to that they're planar."}, {"start": 837.98, "end": 849.98, "text": "Lastly, you know, if you're probing a board, you're most likely going to need to have some kind of fixed PCB fixturing to keep it from moving or bowing while you're measuring your data."}, {"start": 849.98, "end": 856.98, "text": "Now here's an example of a little more elaborate probe systems that we put these together for the last 18 years."}, {"start": 856.98, "end": 868.98, "text": "The pro different dual probe system on the left just means that we've got two probes making contact and we're making a complete full full through measurement from one probe to the other."}, {"start": 868.98, "end": 871.98, "text": "And that data is is going into a full port VNA."}, {"start": 871.98, "end": 877.98, "text": "We're using two cameras, one camera per probe, and we're using two manipulators."}, {"start": 877.98, "end": 889.98, "text": "And then in cases where we're probing larger boards, we've got a probe bridge that we're setting the probe manipulator on, as you can see on the left and on the right."}, {"start": 889.98, "end": 894.98, "text": "It raises it up high enough that I could slide the board underneath."}, {"start": 894.98, "end": 905.98, "text": "That allows us to probe anywhere into that board that's necessary because primarily the length of the arm of the manipulator is about five inches."}, {"start": 905.98, "end": 914.98, "text": "So if you brought that right manipulator right up to the edge of the board, you're only going to be able to probe into it about five inches."}, {"start": 914.98, "end": 925.98, "text": "So if your board is say longer than wider than five inches or 10 inches, then you might want to take a look at getting a probe bridge to assist the probing of it."}, {"start": 925.98, "end": 931.98, "text": "Now, going back to the AtaiTech software, I mentioned earlier that it requires three different measurements."}, {"start": 931.98, "end": 941.98, "text": "So what we do initially is we set up the VNA so we have a time domain or harmonic cal that creates a time domain or like a TDR display."}, {"start": 941.98, "end": 951.98, "text": "So we'll start on the left hand side. The VNA is showing us the time domain of the probe making an open measurement."}, {"start": 951.98, "end": 959.98, "text": "And you can see at the end of that trace it goes up. So there's no contact at that point. The probes are raised."}, {"start": 959.98, "end": 968.98, "text": "And we use a copper plate that comes with the probes to allow you to make the short measurement, which is the next one on the right."}, {"start": 968.98, "end": 974.98, "text": "And you can see at the end of the trace on the vector network and I understand it goes down. So it's shorting."}, {"start": 974.98, "end": 984.98, "text": "And by putting the VNA into time domain mode, it gives us visual feedback to see that we are making contact with the short."}, {"start": 984.98, "end": 996.98, "text": "And it is making an open measurement. You can see the probe tips on the camera that's viewing the probe tips at the top of the VNA."}, {"start": 996.98, "end": 1003.98, "text": "On the screen, you can see on the left, it's up, it's open, right? It's short. It's making contact across the copper pad."}, {"start": 1003.98, "end": 1010.98, "text": "So lastly, the third measure we need to do is the probe SITU S4P file."}, {"start": 1010.98, "end": 1021.98, "text": "And so this is requires a board that has a probe pad on one end of a differential line that goes down to connectors, differential connectors on the end."}, {"start": 1021.98, "end": 1027.98, "text": "So we're going to make a full insertion loss and S4P measurement."}, {"start": 1027.98, "end": 1036.98, "text": "And this is our last file that we need in order to create a S4P model using a TITEC software."}, {"start": 1036.98, "end": 1042.98, "text": "Here is a screenshot of the TITEC software on the left hand side."}, {"start": 1042.98, "end": 1047.98, "text": "So we're going to make a look at the right side. We load the open, the short, the in situ."}, {"start": 1047.98, "end": 1052.98, "text": "And then we select auto, which kind of verifies that our ports are correct."}, {"start": 1052.98, "end": 1064.98, "text": "And then ports to skip on the right, kind of the right side is on the left, meaning that it's going to be not developing a model for the left side."}, {"start": 1064.98, "end": 1068.98, "text": "This is going to be for the right side. The probe would be on the right side in this case."}, {"start": 1068.98, "end": 1075.98, "text": "Now on the right hand side is the probe model after it's completed its extraction, its model extraction."}, {"start": 1075.98, "end": 1084.98, "text": "And it's this is a 70 gigahertz, no ground probe model for our brand new differential probe to 70 gigahertz."}, {"start": 1084.98, "end": 1098.98, "text": "OK, continuing on with the DNA, which is really the measurement engine behind the measurements that Brian was talking about that are required to build up the model for the probe."}, {"start": 1098.98, "end": 1103.98, "text": "We need a differential DNA. Of course, for the first two steps, it's an open and a short."}, {"start": 1103.98, "end": 1109.98, "text": "That's a two port measurement. But we need the four port, obviously, to make the in situ measurement."}, {"start": 1109.98, "end": 1116.98, "text": "And then later on, when we're using the probe, of course, and de embedding it, we're talking about differential measurements."}, {"start": 1116.98, "end": 1128.98, "text": "So once again, we need a four port. So and it's who has a quite a wide family portfolio of VNAs, ranging from the high performance vector star, which we're talking and demonstrating today."}, {"start": 1128.98, "end": 1134.98, "text": "There's also a mid performance four port. It's called the shock line, and that goes up to 43 and a half gigahertz."}, {"start": 1134.98, "end": 1140.98, "text": "It's also has the de embedding software as standard on it as well."}, {"start": 1140.98, "end": 1143.98, "text": "So much the same as what what Vector star has."}, {"start": 1143.98, "end": 1146.98, "text": "But we're using Vector star today because we're going up to 70 gigahertz."}, {"start": 1146.98, "end": 1155.98, "text": "And it's also possible to extend even higher with millimeter wave extenders to 110 gigahertz, 145 and even 220."}, {"start": 1155.98, "end": 1163.98, "text": "We're the only company that has a single sweep vector network analyzer from 70 kilohertz all the way up to 220 gigahertz."}, {"start": 1163.98, "end": 1168.98, "text": "So a lot of these concepts we're talking about can be extended, of course, into higher frequencies."}, {"start": 1168.98, "end": 1172.98, "text": "But we're going to concentrate on the picture that's in the middle and the bottom there."}, {"start": 1172.98, "end": 1185.98, "text": "That's our four port system. And it consists of our two port mainframe VNA plus the multiport test set, which basically combines the two ports on the mainframe with the two ports on the test set to create a four port system."}, {"start": 1185.98, "end": 1189.98, "text": "So this is our vector star with the test set."}, {"start": 1189.98, "end": 1193.98, "text": "Obviously, signal integrity application being that they are differential in nature."}, {"start": 1193.98, "end": 1199.98, "text": "They need a four port VNA to make all of those measurements possible."}, {"start": 1199.98, "end": 1202.98, "text": "So the test set is added. We have four ports."}, {"start": 1202.98, "end": 1210.98, "text": "We do the single ended and we have superposition mathematics that basically transform single ended S-paramers into differential S-paramers,"}, {"start": 1210.98, "end": 1221.98, "text": "which is what we're after because we want the differential insertion loss and differential return loss of our probe as the final result when we do the network extraction."}, {"start": 1221.98, "end": 1226.98, "text": "So embedding, de-embedding is a standard feature, as I said, on Enritsu VNAs."}, {"start": 1226.98, "end": 1234.98, "text": "And then we can also add a second source and we can add differential view in those cases where true mode differential stimulus is required."}, {"start": 1234.98, "end": 1249.98, "text": "In this case, since we're working with a passive device, we do not need true mode to do that since we're able to measure it with single ended and then use the mathematical transformation to get our differential results."}, {"start": 1249.98, "end": 1252.98, "text": "So we don't need to have multiple sources as a result."}, {"start": 1252.98, "end": 1261.98, "text": "The single source will allow us to make all of the necessary measurements for computing the differential S-parameter results."}, {"start": 1261.98, "end": 1264.98, "text": "These are the only systems that cover kilohertz to gigahertz."}, {"start": 1264.98, "end": 1270.98, "text": "So again, 70 kilohertz low end frequency all the way up to 70 gigahertz in the case of this VNA."}, {"start": 1270.98, "end": 1279.98, "text": "So superposition is what we use to take the single ended S-parameters and convert them to differential S-parameters."}, {"start": 1279.98, "end": 1291.98, "text": "And the way superposition works basically is we're applying a signal one at a time, an incident stimulus one at a time to each port via switch matrix that's part of the system, part of the VNA system,"}, {"start": 1291.98, "end": 1295.98, "text": "and measuring the response from all of the ports simultaneously."}, {"start": 1295.98, "end": 1297.98, "text": "And then we go to the next port and do the same thing."}, {"start": 1297.98, "end": 1305.98, "text": "So we collect all of these measurements, all these ratio measurements to form our S4P matrix of single ended S-parameters,"}, {"start": 1305.98, "end": 1312.98, "text": "and then mathematically generate the differential common mode and mixed mode quantities based on that."}, {"start": 1312.98, "end": 1318.98, "text": "So as I said, this works perfectly well for passive devices and even linear active devices."}, {"start": 1318.98, "end": 1332.98, "text": "It's only in the non-linear case that you would actually need a true mode differential and thus a second source and all the phase synchronization required to get a full true mode differential stimulus."}, {"start": 1332.98, "end": 1335.98, "text": "So this is our single ended S-parameters on the left side."}, {"start": 1335.98, "end": 1343.98, "text": "That's our S-4P matrix basically, and we're mathematically transforming that to the differential quantities."}, {"start": 1343.98, "end": 1347.98, "text": "And what matters here is basically the differential transmission."}, {"start": 1347.98, "end": 1353.98, "text": "So the SD2D1, the return loss, the SD1D1 or D2D2."}, {"start": 1353.98, "end": 1356.98, "text": "Those are the return loss of reflection terms."}, {"start": 1356.98, "end": 1361.98, "text": "And then there's also common to differential, differential common, what we call mixed mode."}, {"start": 1361.98, "end": 1365.98, "text": "Some of that's important for common mode rejection type measurements."}, {"start": 1365.98, "end": 1370.98, "text": "And there's also common mode, which usually no one cares about because differential is what everyone wants."}, {"start": 1370.98, "end": 1376.98, "text": "So it's really the 180 degree out of phase that is of interest, which is how differential is defined."}, {"start": 1376.98, "end": 1385.98, "text": "So we're looking at insertion loss, as I mentioned, the D2D1 and in the reverse direction, that would be D1D2."}, {"start": 1385.98, "end": 1390.98, "text": "Return loss at both ports, both differential ports."}, {"start": 1390.98, "end": 1400.98, "text": "And then the common mode rejection may be of interest in just looking at how well your design performs in a differential sense and how well it rejects the common mode."}, {"start": 1400.98, "end": 1403.98, "text": "Cross talk is really just single ended S-parameters."}, {"start": 1403.98, "end": 1406.98, "text": "We're looking at really the near end and the far end cross talk here."}, {"start": 1406.98, "end": 1409.98, "text": "So these are looked at in terms of single ended S-parameters."}, {"start": 1409.98, "end": 1416.98, "text": "These are the cross terms. These are not the direct through terms that you would have in the differential transmission."}, {"start": 1416.98, "end": 1418.98, "text": "That would be one to two and three to four."}, {"start": 1418.98, "end": 1426.98, "text": "So here we're looking at the cross terms and that would be the leakage across or the isolation."}, {"start": 1426.98, "end": 1436.98, "text": "And then we can use time domain and, as Brian mentioned, the low pass time domain step response to get our impedance profile."}, {"start": 1436.98, "end": 1439.98, "text": "And we actually see what is happening along the line."}, {"start": 1439.98, "end": 1452.98, "text": "And this is helpful when you're landing the probes as well to actually see the result that you expect if you're probing an open, probing a short or probing the line to make sure that you're touched down correctly and that the line impedance makes sense."}, {"start": 1452.98, "end": 1455.98, "text": "Remember, this is a hundred ohms because it's a differential."}, {"start": 1455.98, "end": 1460.98, "text": "So this is what we're looking at in our in our impedance profile."}, {"start": 1460.98, "end": 1464.98, "text": "So all of these measurements are possible with a four port VNA."}, {"start": 1464.98, "end": 1468.98, "text": "Now turning to the embedding, de-embedding menu."}, {"start": 1468.98, "end": 1472.98, "text": "This is after you've got your calibration and you're making measurements."}, {"start": 1472.98, "end": 1479.98, "text": "And now you want to input the model that we've developed or extracted using the ATITEC software for the probe."}, {"start": 1479.98, "end": 1487.98, "text": "And you want to actually apply it to your measurement because at the end of the day, what you want to measure is your device under test and not anything outside of that."}, {"start": 1487.98, "end": 1495.98, "text": "So everything else in the measurement path, including the probe, has to get removed if you want to isolate the measurement to your device under test."}, {"start": 1495.98, "end": 1497.98, "text": "So this is the process that we use."}, {"start": 1497.98, "end": 1498.98, "text": "So we load the file."}, {"start": 1498.98, "end": 1504.98, "text": "If it's a two port S2P file, it would be the menu on the left."}, {"start": 1504.98, "end": 1507.98, "text": "If it's a four port, it would be the menu on the right."}, {"start": 1507.98, "end": 1509.98, "text": "You would load an S4P file."}, {"start": 1509.98, "end": 1511.98, "text": "You would add that to your network."}, {"start": 1511.98, "end": 1519.98, "text": "If you have multiple layers of de-embedding that you wish to accomplish, then you would add an additional network to that table below."}, {"start": 1519.98, "end": 1526.98, "text": "And then when you've got everything set the way you want it, you apply it and turn the embedding on."}, {"start": 1526.98, "end": 1529.98, "text": "And the Enritsu VNA menu has a way of toggling on and off."}, {"start": 1529.98, "end": 1533.98, "text": "So you can actually see very quickly what the result is after de-embedding."}, {"start": 1533.98, "end": 1537.98, "text": "And you can revert back to what it was before de-embedding and actually see the difference."}, {"start": 1537.98, "end": 1542.98, "text": "And we'll be demonstrating that when we do the verification portion of our demonstration."}, {"start": 1542.98, "end": 1545.98, "text": "And this is what it looks like."}, {"start": 1545.98, "end": 1558.98, "text": "This is actually what I'm talking about here is where we're applying the probe model and the trace is the blue trace and the green trace is the original measurement with no probe de-embedding taking place."}, {"start": 1558.98, "end": 1571.98, "text": "So you can see that the insertion loss of your device under test improves as you remove the probe because the net difference between these two traces is the actual insertion loss of the probe,"}, {"start": 1571.98, "end": 1575.98, "text": "which is about 8 dB at 70 GHz."}, {"start": 1575.98, "end": 1583.98, "text": "So at this point, we're going to turn to the live demonstration and we'll be back with you in just a couple of minutes."}, {"start": 1583.98, "end": 1586.98, "text": "Okay, now we're back for the live demo."}, {"start": 1586.98, "end": 1593.98, "text": "The live demo is going to consist of the systems that you see up on the slide."}, {"start": 1593.98, "end": 1601.66, "text": "Starting with the left, what we're going to do, those shows the port assignments, how we're connected to the probe in situ board."}, {"start": 1601.98, "end": 1607.98, "text": "And then in the middle is the actual devices that we're using as the probe system."}, {"start": 1607.98, "end": 1613.98, "text": "This is kind of the half of a dual probe system, essentially."}, {"start": 1613.98, "end": 1619.98, "text": "You would need the camera system and the probe and the manipulator to hold it and a board to make measurements from."}, {"start": 1619.98, "end": 1625.98, "text": "And then on the right side is the full system, showing you the board to set up the DNA, the display."}, {"start": 1625.98, "end": 1631.98, "text": "And next we're going to do is we're going to go to a live demonstration of making the probe in situ measurement."}, {"start": 1631.98, "end": 1643.98, "text": "All right. The picture on the left side, as you see in the camera, down at the bottom, the black thing down there is the probe positioner."}, {"start": 1643.98, "end": 1650.98, "text": "And as I said earlier, you want a long arm on this thing."}, {"start": 1650.98, "end": 1653.98, "text": "And then this is connected to the probe."}, {"start": 1653.98, "end": 1656.98, "text": "Now this is the true differential 70 gigahertz probe."}, {"start": 1656.98, "end": 1661.98, "text": "And it's controlled by these controls back here, your X, Y, and Z."}, {"start": 1661.98, "end": 1665.98, "text": "And this one here is your planarization control."}, {"start": 1665.98, "end": 1670.98, "text": "If the probe tips are not planar to the test pads, you're not going to make good measurements."}, {"start": 1670.98, "end": 1686.98, "text": "And in order to verify they are or not, is that we have a camera here that's showing the probe tips very, expands it on the display, as you can see here by the display on the PC."}, {"start": 1686.98, "end": 1689.98, "text": "So those are the two signal pins within the probe itself."}, {"start": 1689.98, "end": 1692.98, "text": "As you can see, there is no ground."}, {"start": 1692.98, "end": 1699.98, "text": "So we have no common mode path, just a differential path with crosstalk."}, {"start": 1699.98, "end": 1705.98, "text": "And they were making contact with the differential line, as you can see on the trace."}, {"start": 1705.98, "end": 1721.98, "text": "So this connection to the VNA is we have a differential port one on the left here, one and three connected to one side of the probe in situ board."}, {"start": 1721.98, "end": 1727.98, "text": "And then the other port, differential port two and four are connected to the probe."}, {"start": 1727.98, "end": 1730.98, "text": "And now that completes the path."}, {"start": 1730.98, "end": 1744.98, "text": "So on the display to verify and help us kind of guide that we're making good contact is the time domain display on the VNA that shows the probe's making contact through the transmission line."}, {"start": 1744.98, "end": 1751.98, "text": "And now the next thing we're going to do is we're going to make an S parameter measurement, return loss measurements."}, {"start": 1751.98, "end": 1763.98, "text": "And this is going to be our probe in situ measurement that we're going to be sending to Arno, who's going to do a live demonstration using a TIA-TECH software."}, {"start": 1763.98, "end": 1775.98, "text": "And this insertion loss measurement, which is the last of the three waveforms that we need, the open, the short, and now the probe in situ measurement."}, {"start": 1775.98, "end": 1786.98, "text": "So I'm going to pass this waveform off to Arno, who will next create the extraction that will give us our probe model."}, {"start": 1786.98, "end": 1789.98, "text": "We're going to use the TIA-TECH software next."}, {"start": 1791.98, "end": 1798.98, "text": "And for this, we're going to use a 1X open and short."}, {"start": 1798.98, "end": 1801.98, "text": "This is what we measured."}, {"start": 1801.98, "end": 1805.98, "text": "These are basically S2P files."}, {"start": 1805.98, "end": 1810.98, "text": "These were two port measurements we made with ports 1 and 2 of the VNA."}, {"start": 1810.98, "end": 1813.98, "text": "We probed the open, which was basically probes in the air."}, {"start": 1813.98, "end": 1819.98, "text": "And we probed the short, which is the probes touching down on the copper shorting plate."}, {"start": 1819.98, "end": 1824.98, "text": "And so we're going to select 1X open and 1X short."}, {"start": 1824.98, "end": 1828.98, "text": "And we're going to load the two S2P files."}, {"start": 1828.98, "end": 1831.98, "text": "So the first one is for the open."}, {"start": 1831.98, "end": 1834.98, "text": "And I have that one here in the directory."}, {"start": 1834.98, "end": 1837.98, "text": "And over here I have the short."}, {"start": 1837.98, "end": 1839.98, "text": "So we'll load that one."}, {"start": 1839.98, "end": 1847.98, "text": "And then finally, it's the measurement that Brian was just showing live, which is the in situ through measurement."}, {"start": 1847.98, "end": 1862.98, "text": "And that is S4P because it's a full differential measurement that we're taking there from the connector to the probe through the transmission line on the board."}, {"start": 1862.98, "end": 1867.98, "text": "And so that's our in situ measurement, which is the one here."}, {"start": 1867.98, "end": 1870.98, "text": "It's the one inch board we're using to 70 gigahertz."}, {"start": 1870.98, "end": 1872.98, "text": "So we'll load that measurement."}, {"start": 1872.98, "end": 1876.98, "text": "And then we perform an auto port sequence check."}, {"start": 1876.98, "end": 1883.98, "text": "This is just ensure that our through line or through connections are as we expect them to be."}, {"start": 1883.98, "end": 1891.98, "text": "So the port sequence for our through is one to two single ended and three to four single ended."}, {"start": 1891.98, "end": 1900.98, "text": "And it also shows the frequency range where we're covering with 2000 data points from 35 megahertz to 70 gigahertz."}, {"start": 1900.98, "end": 1903.98, "text": "And now another very important step is the port to skip."}, {"start": 1903.98, "end": 1907.98, "text": "Since we're not concerned about the left side, the left side is where the connectors are."}, {"start": 1907.98, "end": 1908.98, "text": "The probe is on the right side."}, {"start": 1908.98, "end": 1910.98, "text": "So we want to skip the side that has the connector."}, {"start": 1910.98, "end": 1912.98, "text": "So that would be the left side."}, {"start": 1912.98, "end": 1924.98, "text": "So we select left and then we're ready to run the ISD software to extract the S4P model for the probe."}, {"start": 1924.98, "end": 1927.98, "text": "So this takes just a few seconds."}, {"start": 1927.98, "end": 1931.98, "text": "And what you get is the single ended S parameters."}, {"start": 1931.98, "end": 1937.98, "text": "Well, that's not all that interesting for us because we're after the differential S parameters."}, {"start": 1937.98, "end": 1940.98, "text": "So we come over here to plot S parameter."}, {"start": 1940.98, "end": 1942.98, "text": "And we de-embed from the right."}, {"start": 1942.98, "end": 1947.98, "text": "And it's basically the differential view that we want to see."}, {"start": 1947.98, "end": 1955.98, "text": "And so if I expand that, this is the actual differential S parameters of the probe by itself."}, {"start": 1955.98, "end": 1960.98, "text": "So it's extracted the probe from those three measurements that we supplied."}, {"start": 1960.98, "end": 1966.98, "text": "And it plots out the differential return loss, both the input side and the output side."}, {"start": 1966.98, "end": 1970.98, "text": "So that's the blue trace over here is the input return loss."}, {"start": 1970.98, "end": 1974.98, "text": "The red trace over here is the output return loss."}, {"start": 1974.98, "end": 1979.98, "text": "And we see over here the insertion loss, the differential insertion loss of the probe itself."}, {"start": 1979.98, "end": 1983.98, "text": "In the forward direction is the blue."}, {"start": 1983.98, "end": 1986.98, "text": "In the reverse direction is the red."}, {"start": 1986.98, "end": 1989.98, "text": "And they're the same as we would expect."}, {"start": 1989.98, "end": 1996.98, "text": "Because this is a symmetric and a passive device that we're extracting a model for."}, {"start": 1996.98, "end": 2005.98, "text": "So once we have the model, we're ready to go over to the VNA and actually apply it to that measurement that Brian was showing just a moment ago."}, {"start": 2005.98, "end": 2010.98, "text": "So I'm going to go ahead and close this window and bring up the VNA menu again."}, {"start": 2010.98, "end": 2017.98, "text": "And look at the differential transmission."}, {"start": 2017.98, "end": 2026.98, "text": "And right now what we're measuring is the probe and the board all together."}, {"start": 2026.98, "end": 2035.98, "text": "But what we want to get to is basically just a measurement of the board and the connector on that board on the left side."}, {"start": 2035.98, "end": 2039.98, "text": "But we're going to remove the probe that is on the right side."}, {"start": 2039.98, "end": 2044.98, "text": "So the first thing I'm going to do is place this trace into memory."}, {"start": 2044.98, "end": 2049.98, "text": "So we have a record of what it looked like before we de-embed it."}, {"start": 2049.98, "end": 2053.98, "text": "So we're going to go ahead and store this trace to the memory."}, {"start": 2053.98, "end": 2058.98, "text": "And then we're going to put data and memory on."}, {"start": 2058.98, "end": 2064.98, "text": "And then we're going to go to the measurement menu, which is where we apply all our post-processing."}, {"start": 2064.98, "end": 2074.98, "text": "So as I mentioned earlier in the presentation, all of this assumes that you've done a standard calibration, S-O-L-T type calibration,"}, {"start": 2074.98, "end": 2077.98, "text": "so that you're obviously measuring accurately."}, {"start": 2077.98, "end": 2084.98, "text": "But now what we want to do is apply that probe model and remove that probe from this combined measurement."}, {"start": 2084.98, "end": 2087.98, "text": "So it becomes a post-processing step."}, {"start": 2087.98, "end": 2089.98, "text": "And we call that de-embedding."}, {"start": 2089.98, "end": 2094.98, "text": "And we want to go into the edit menu for de-embedding."}, {"start": 2094.98, "end": 2103.98, "text": "And you'll see the menu that I showed earlier in the presentation where you can choose between embedding and de-embedding."}, {"start": 2103.98, "end": 2105.98, "text": "Obviously the default is de-embedding."}, {"start": 2105.98, "end": 2108.98, "text": "Most of the time you want to remove things rather than add things."}, {"start": 2108.98, "end": 2109.98, "text": "But it can go both ways."}, {"start": 2109.98, "end": 2112.98, "text": "We have to decide what port we want to apply it to."}, {"start": 2112.98, "end": 2118.98, "text": "And this is very important because you can do S-2P embedding de-embedding, which would be on a single-ended port."}, {"start": 2118.98, "end": 2124.98, "text": "Or you can do differential embedding de-embedding, which would be on a differential port."}, {"start": 2124.98, "end": 2126.98, "text": "Obviously we're here to do differential measurements."}, {"start": 2126.98, "end": 2132.98, "text": "So we're going to pick ports two and four because that's what's on the right-hand side."}, {"start": 2132.98, "end": 2133.98, "text": "That's our output."}, {"start": 2133.98, "end": 2135.98, "text": "That's where our probe is."}, {"start": 2135.98, "end": 2144.98, "text": "And as I mentioned in the presentation, we can handle discrete components."}, {"start": 2144.98, "end": 2146.98, "text": "We can also do transmission lines."}, {"start": 2146.98, "end": 2153.98, "text": "But really the most useful de-embedding network, of course, is the S-4P file itself."}, {"start": 2153.98, "end": 2156.98, "text": "So that's what we're going to use here."}, {"start": 2156.98, "end": 2161.98, "text": "And we're going to load in the S-4P file."}, {"start": 2161.98, "end": 2171.98, "text": "And so when the ISD software ran, it created a file in the same directory that's labeled write DUT."}, {"start": 2171.98, "end": 2178.98, "text": "And that is basically distinguishing that we're removing what's on the right-hand side and creating a file for it."}, {"start": 2178.98, "end": 2182.98, "text": "And so what will be left is just the DUT measurement."}, {"start": 2182.98, "end": 2189.98, "text": "So the actual probe file is this one, the one I'm pointing to that's called write DUT."}, {"start": 2189.98, "end": 2193.98, "text": "So this captures the probe model."}, {"start": 2193.98, "end": 2196.98, "text": "So we're going to go ahead and open that."}, {"start": 2196.98, "end": 2199.98, "text": "And we're going to apply that."}, {"start": 2199.98, "end": 2204.98, "text": "Sorry, we're going to apply that."}, {"start": 2204.98, "end": 2207.98, "text": "I had another one in there, so I'm going to remove that."}, {"start": 2207.98, "end": 2210.98, "text": "So now I have the file loaded in the table."}, {"start": 2210.98, "end": 2212.98, "text": "And we're going to apply it."}, {"start": 2212.98, "end": 2216.98, "text": "And we're going to close."}, {"start": 2216.98, "end": 2221.98, "text": "And now all that remains is to basically turn on the embedding."}, {"start": 2221.98, "end": 2230.98, "text": "And what you'll notice right away, the memory trace still captures the combined measurement with the probe."}, {"start": 2230.98, "end": 2234.98, "text": "And the measurement in blue is now the D-embedded result."}, {"start": 2234.98, "end": 2237.98, "text": "So we remove the contribution to the probe."}, {"start": 2237.98, "end": 2243.98, "text": "And that's somewhere around 6 to 8 dB, depending on where you're looking at it, frequency."}, {"start": 2243.98, "end": 2245.98, "text": "But that's the result."}, {"start": 2245.98, "end": 2254.98, "text": "So this is where we end up after the probe is basically removed from the combined measurement."}, {"start": 2254.98, "end": 2260.98, "text": "So that concludes our demonstration and also concludes our seminar for today."}, {"start": 2260.98, "end": 2263.98, "text": "We hope it's been informative."}, {"start": 2263.98, "end": 2270.98, "text": "We do want to mention again, this was a collaborative effort with four companies involved."}, {"start": 2270.98, "end": 2273.98, "text": "So we thank you today for your attention."}, {"start": 2273.98, "end": 2279.98, "text": "If you have any questions, feel free to reach out to any one of us."}, {"start": 2279.98, "end": 2282.98, "text": "I'm, of course, responsible for the V&A part."}, {"start": 2282.98, "end": 2287.98, "text": "Brian helped here with the probing part of it and probe systems."}, {"start": 2287.98, "end": 2295.98, "text": "And Bill Rosas manufactures the probes themselves as well as the verification board that we're using."}, {"start": 2295.98, "end": 2303.98, "text": "And Dr. Jing Chao-Wong at the TITEC for the ISD network extraction software."}, {"start": 2303.98, "end": 2308.98, "text": "So again, on behalf of Brian and myself, we want to thank you for your attendance today."}, {"start": 2308.98, "end": 2312.98, "text": "And feel free to contact us with any questions you may have."}, {"start": 2312.98, "end": 2314.98, "text": "Thank you and good day."}]}