{"video_id": "t1Q9_PlN4GU", "url": "https://www.youtube.com/watch?v=t1Q9_PlN4GU", "title": "t1Q9_PlN4GU", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 3.0, "text": "Now that we have looked at positions and velocities,"}, {"start": 3.0, "end": 7.0, "text": "it's time to study the dynamics of a quadrotor."}, {"start": 7.0, "end": 12.0, "text": "Once again, let's remind ourselves that we have two coordinate systems,"}, {"start": 12.0, "end": 16.0, "text": "one attached to the moving robot,"}, {"start": 16.0, "end": 20.0, "text": "and the other, the inertial coordinate system."}, {"start": 20.0, "end": 26.0, "text": "B1, B2, B3 constitute the set of unit vectors"}, {"start": 26.0, "end": 29.0, "text": "that describe the body fixed coordinate system,"}, {"start": 29.0, "end": 36.0, "text": "and likewise A1, A2, A3 describe the coordinate system that's fixed to the inertial frame."}, {"start": 36.0, "end": 41.0, "text": "Recall that you have four rotors, each of which is independently actuated."}, {"start": 41.0, "end": 45.0, "text": "R is the position vector of the center of mass,"}, {"start": 45.0, "end": 52.0, "text": "and we know expressions for the thrusts that the motors produce on the airframe."}, {"start": 52.0, "end": 57.0, "text": "We also know the expressions for the reaction moments,"}, {"start": 57.0, "end": 64.0, "text": "and both of these are proportional to the square of the angular speeds of the rotors."}, {"start": 64.0, "end": 69.0, "text": "We've seen how Euler angles are used to represent rotations."}, {"start": 69.0, "end": 79.0, "text": "We will use the ZXY convention, the first rotation being about the Z-axis through Psi,"}, {"start": 79.0, "end": 88.0, "text": "the second one about the X-axis, and the third one about the Y-axis."}, {"start": 88.0, "end": 95.0, "text": "So the first axis is yaw, the second one is roll, the third one is pitch."}, {"start": 95.0, "end": 103.0, "text": "Again, just to remind ourselves, this is the ZXY convention."}, {"start": 103.0, "end": 106.0, "text": "The first rotation is the ZXY convention."}, {"start": 106.0, "end": 111.0, "text": "The second rotation is about the X-axis through Psi, this is the roll angle."}, {"start": 111.0, "end": 115.0, "text": "And finally, the pitch about the Y-axis through Psi."}, {"start": 115.0, "end": 119.0, "text": "Of course, there are singularities."}, {"start": 119.0, "end": 125.0, "text": "Singularities occur when the roll angle is equal to zero, which is Psi equal to zero."}, {"start": 125.0, "end": 138.0, "text": "And even when the angle phi is not equal to zero, you can have two sets of Euler angles for every rotation."}, {"start": 138.0, "end": 143.0, "text": "Let's look at the external forces and moments that act on the airframe."}, {"start": 143.0, "end": 154.0, "text": "We have four thrusts, F1, F2, and F3, and F4, and then four moments, M1, M2, and M3, and M4."}, {"start": 154.0, "end": 164.0, "text": "The sum of the forces is obtained by adding up the thrust vectors and the gravity vector."}, {"start": 164.0, "end": 172.0, "text": "The sum of the moments is obtained by adding up the reaction moments, as well as the moments of the thrust forces."}, {"start": 172.0, "end": 175.0, "text": "Again, these are vector computations."}, {"start": 175.0, "end": 180.0, "text": "You have to add 3 by 1 vectors in each of these equations."}, {"start": 180.0, "end": 188.0, "text": "To predict the net acceleration, we have to write down the equations of motion."}, {"start": 188.0, "end": 195.0, "text": "These come from Newton and Euler, and they're called the Newton-Euler equations."}, {"start": 195.0, "end": 196.0, "text": "Down is another direction of your nest."}, {"start": 196.0, "end": 197.0, "text": "You set up theength vector transport Gestanca стен."}, {"start": 197.0, "end": 198.0, "text": "By holding 2 points that each of which is used in passive существ,"}, {"start": 198.0, "end": 202.0, "text": "against Lot alta Ettrace, Hence, this is Psi equal to 0,8-17-18-18-50,"}, {"start": 202.0, "end": 203.0, "text": "This is a Psi someone at 616-Euler equation."}, {"start": 203.0, "end": 204.0, "text": "From Python and for AirPods two, please look at how mouse some places are rolling."}, {"start": 204.0, "end": 206.0, "text": "Its number of the non-looking names and these ones are rolling."}, {"start": 206.0, "end": 208.0, "text": "This means introduction alone."}, {"start": 208.0, "end": 210.0, "text": "It is a Psi late."}, {"start": 210.0, "end": 211.0, "text": "It is the pin."}]}