{"video_id": "tFVAaUcOm4I", "url": "https://www.youtube.com/watch?v=tFVAaUcOm4I", "title": "tFVAaUcOm4I", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 5.08, "text": "A PID controller is a control structure that's used in many closed-loop systems."}, {"start": 5.5200000000000005, "end": 9.16, "text": "It was developed by Nicholas Minorski in 1922."}, {"start": 9.72, "end": 13.84, "text": "PID stands for Proportional, Integral, and Derivative."}, {"start": 14.26, "end": 20.72, "text": "It's a way to compare the input and output of a system to generate a signal to control some process or machinery."}, {"start": 21.34, "end": 24.38, "text": "Don't worry about understanding this diagram quite yet."}, {"start": 24.54, "end": 26.84, "text": "We'll work our way up to it throughout this video."}, {"start": 26.84, "end": 31.52, "text": "But know that PID controllers are one of the most popular control theory mechanisms."}, {"start": 32.1, "end": 39.86, "text": "If you're not familiar with it, control theory is a field of engineering and mathematics dealing with the control of dynamic systems."}, {"start": 40.36, "end": 45.5, "text": "Often, these systems are mechanical and can be described entirely by math equations."}, {"start": 46.08, "end": 52.24, "text": "I'll give you an overview of how PID controllers work and some examples of them in everyday use."}, {"start": 56.84, "end": 62.540000000000006, "text": "Let's start with our system or subsystem that we want to control."}, {"start": 62.800000000000004, "end": 67.44, "text": "This can be any process, piece of machinery, actuator, or what have you."}, {"start": 67.44, "end": 71.26, "text": "In control theory, you'll often see this referred to as a plant,"}, {"start": 71.52000000000001, "end": 75.56, "text": "which is a term that comes from the Industrial Revolution in the late 1700s"}, {"start": 75.56, "end": 81.22, "text": "to mean something that has been planted in the ground for industrial purposes, such as machinery or tools."}, {"start": 81.22, "end": 86.64, "text": "The process receives some sort of input signal, and the output can be ideally measured."}, {"start": 87.03999999999999, "end": 92.52, "text": "While controllers are extremely popular in industrial settings, let's start with a more common example."}, {"start": 93.42, "end": 96.9, "text": "Most cars have an accelerator, also known as a gas pedal."}, {"start": 97.16, "end": 102.46000000000001, "text": "When you press the gas pedal, the car responds by allowing more air and fuel into the engine."}, {"start": 102.8, "end": 106.2, "text": "As a result, your engine produces more power, which increases your speed."}, {"start": 106.2, "end": 108.96000000000001, "text": "Now, most accelerators are not binary."}, {"start": 109.44, "end": 112.52000000000001, "text": "You can control the amount you depress the pedal with your foot."}, {"start": 112.9, "end": 115.46000000000001, "text": "Press a little, and some air and fuel go into the engine,"}, {"start": 115.64, "end": 118.8, "text": "and your car starts to accelerate slowly up to some speed."}, {"start": 119.22, "end": 123.4, "text": "Mash the pedal to the floor, and you'll start dumping a lot of air and fuel into the engine."}, {"start": 123.60000000000001, "end": 128.12, "text": "You'll accelerate quickly, and at some point, you will reach the maximum speed for your car."}, {"start": 128.54, "end": 131.7, "text": "Our car is an example of a process or plant."}, {"start": 132.06, "end": 135.56, "text": "We can give it an input signal, the accelerator position in this case."}, {"start": 135.56, "end": 140.62, "text": "The car will respond with motion, and we can read the speed of the car on our speedometer."}, {"start": 140.9, "end": 141.68, "text": "That's the output."}, {"start": 142.38, "end": 145.16, "text": "Let's say we want to maintain some constant speed."}, {"start": 145.46, "end": 148.32, "text": "As it turns out, our brains are very good controllers."}, {"start": 148.8, "end": 153.7, "text": "We can often read the speedometer and adjust the gas pedal as necessary to maintain that speed."}, {"start": 154.1, "end": 158.82, "text": "Keep in mind that on flat roads, you can just hold the pedal in one spot to maintain speed,"}, {"start": 159.0, "end": 163.98000000000002, "text": "but you will need to adjust the accelerator position when going up and down hills and around turns."}, {"start": 163.98, "end": 166.6, "text": "This is a closed-loop system."}, {"start": 167.0, "end": 172.29999999999998, "text": "We read the speedometer or judge speed by looking out the windshield and adjusting the input signal,"}, {"start": 172.44, "end": 174.39999999999998, "text": "the accelerometer in this case, as needed."}, {"start": 174.82, "end": 180.73999999999998, "text": "However, let's say that you, the engineer, have been tasked with designing a controller"}, {"start": 180.73999999999998, "end": 187.07999999999998, "text": "that will automatically adjust the accelerator as needed to maintain a consistent speed."}, {"start": 187.32, "end": 189.17999999999998, "text": "We'll call this cruise control."}, {"start": 189.5, "end": 190.83999999999997, "text": "That has a nice ring to it."}, {"start": 190.84, "end": 194.06, "text": "Here's our initial pass at a control system."}, {"start": 194.52, "end": 197.3, "text": "Our controller takes some input or a set point."}, {"start": 197.62, "end": 202.08, "text": "In our example, this is like setting a particular value on our cruise control,"}, {"start": 202.24, "end": 204.0, "text": "say 100 kilometers per hour."}, {"start": 204.22, "end": 207.86, "text": "The controller then figures out what value to send to the plant."}, {"start": 208.18, "end": 210.52, "text": "Remember that the plant in our example is the engine."}, {"start": 210.52, "end": 215.48000000000002, "text": "So let's create a simple mapping from desired speed to accelerator position,"}, {"start": 215.62, "end": 219.76000000000002, "text": "as we know that the car will reach a maximum speed based on that position."}, {"start": 219.98000000000002, "end": 225.66000000000003, "text": "The pedal position will in turn affect the engine, which will accelerate the car up to some speed."}, {"start": 226.16000000000003, "end": 227.26000000000002, "text": "Seems simple enough."}, {"start": 227.48000000000002, "end": 229.74, "text": "This is known as an open-loop system."}, {"start": 230.26000000000002, "end": 232.72, "text": "There is no sensor or feedback loop."}, {"start": 233.08, "end": 235.04000000000002, "text": "While this might work in some cases,"}, {"start": 235.04, "end": 240.51999999999998, "text": "I'm sure you can already see some issues with this control scheme for our cruise control device."}, {"start": 240.51999999999998, "end": 245.88, "text": "If we're going up a hill, the car is going to slow down thanks to the effects of gravity,"}, {"start": 246.32, "end": 248.94, "text": "even though the accelerator is in the same position."}, {"start": 249.62, "end": 253.34, "text": "Similarly, if we're going down a hill, the car is going to speed up."}, {"start": 253.34, "end": 258.26, "text": "So we need to let off the gas pedal in order to maintain that same speed."}, {"start": 258.8, "end": 262.44, "text": "This is something that our open-loop system cannot accommodate."}, {"start": 262.76, "end": 265.78000000000003, "text": "So we turn to a closed-loop system."}, {"start": 266.18, "end": 268.98, "text": "Here, the output is measured by some sort of sensor,"}, {"start": 269.24, "end": 271.5, "text": "and that feedback is sent to our controller."}, {"start": 271.84000000000003, "end": 275.68, "text": "In most cases, we will compare the input setpoint to that feedback"}, {"start": 275.68, "end": 279.0, "text": "to generate an error signal, which goes to the controller."}, {"start": 279.0, "end": 284.92, "text": "We'll label that error signal as E of T, as it's something that can vary over time."}, {"start": 285.5, "end": 289.06, "text": "In our manual example, our brains acted as the controller."}, {"start": 289.62, "end": 293.8, "text": "We could adjust the gas pedal with our foot as needed to maintain our speed,"}, {"start": 293.94, "end": 295.56, "text": "regardless of road variations."}, {"start": 295.98, "end": 300.02, "text": "But we want to automate this process to take that pressure off the driver."}, {"start": 300.24, "end": 304.02, "text": "So we need to design a controller that accepts the error signal"}, {"start": 304.02, "end": 307.06, "text": "and outputs some other signal to drive the process."}, {"start": 307.06, "end": 313.16, "text": "First, let's try simply multiplying our error value by some constant to get the output signal."}, {"start": 313.42, "end": 315.78000000000003, "text": "This is known as a proportional controller,"}, {"start": 315.94, "end": 318.92, "text": "as the output signal is proportional to the error term."}, {"start": 319.18, "end": 323.7, "text": "We'll start with a very simple example before coming back to our cruise control system."}, {"start": 324.18, "end": 328.1, "text": "Instead of speed, let's say that we want to move our car 10 kilometers."}, {"start": 328.36, "end": 330.44, "text": "So our setpoint is 10 kilometers."}, {"start": 331.04, "end": 335.64, "text": "Our error is the difference between this setpoint and the actual position of the car."}, {"start": 335.64, "end": 339.44, "text": "Therefore, our error is a measurement of the distance to the goal."}, {"start": 339.86, "end": 343.26, "text": "We want the output to be the speed of our car in kilometers per hour."}, {"start": 343.64, "end": 345.86, "text": "The plant is still our car or engine."}, {"start": 346.2, "end": 349.21999999999997, "text": "We give it a speed and it performs the movement for us."}, {"start": 349.52, "end": 352.36, "text": "Here's a diagram of our car moving toward its goal."}, {"start": 352.65999999999997, "end": 357.12, "text": "At zero kilometers, the error is 10 minus zero, so 10 kilometers."}, {"start": 357.12, "end": 362.66, "text": "Let's set our constant, kp, to some arbitrary value like 5."}, {"start": 362.84000000000003, "end": 368.68, "text": "So we multiply 5 by that error to get our controller output, which is 50 kilometers per hour."}, {"start": 368.94, "end": 371.42, "text": "Our car starts moving very quickly at first."}, {"start": 371.86, "end": 375.94, "text": "Don't worry about acceleration and deceleration for this very simple example."}, {"start": 376.5, "end": 379.58, "text": "At 3 kilometers, the error is 7 kilometers."}, {"start": 379.58, "end": 384.21999999999997, "text": "So our speed slows to 5 times 7, or 35 kilometers per hour."}, {"start": 384.64, "end": 385.91999999999996, "text": "We continue with this pattern."}, {"start": 386.14, "end": 391.08, "text": "At 5 kilometers, the speed is 25 kilometers per hour, as the error is 5 kilometers."}, {"start": 391.41999999999996, "end": 396.59999999999997, "text": "At 7 kilometers, the error is 3, so the speed slows even more to 15 kilometers per hour."}, {"start": 397.09999999999997, "end": 400.76, "text": "Similarly, at 8 kilometers, the speed drops to 10 kilometers per hour."}, {"start": 400.76, "end": 405.64, "text": "And at 9 kilometers, the speed slows all the way down to 5 kilometers per hour."}, {"start": 406.03999999999996, "end": 412.24, "text": "Finally, at our goal, the speed should be 0 kilometers per hour, as our error is 0 kilometers."}, {"start": 412.62, "end": 417.14, "text": "If we graph our error and speed, we should see something like this."}, {"start": 417.46, "end": 423.48, "text": "The error starts at 10 kilometers, and the speed is proportionally high, at 50 kilometers per hour."}, {"start": 423.7, "end": 427.38, "text": "As we get closer to our goal, the speed also starts to drop."}, {"start": 427.38, "end": 432.48, "text": "As a result, we approach our goal more slowly, until we're barely moving at all."}, {"start": 433.04, "end": 437.92, "text": "Assuming an ideal system, we should reach our goal at a snail's pace without overshooting."}, {"start": 438.36, "end": 440.56, "text": "Note that we can adjust our constant value."}, {"start": 440.74, "end": 445.88, "text": "For example, if we set it to 2, the speed will be slower, but still proportional to the distance error."}, {"start": 446.2, "end": 448.14, "text": "It will take longer to reach our goal."}, {"start": 448.46, "end": 453.4, "text": "If we increased the constant to, say, 10, we'll reach our goal much faster."}, {"start": 453.4, "end": 459.02, "text": "But we start risking overshoot in non-ideal systems, and possibly breaking some speeding laws."}, {"start": 459.59999999999997, "end": 463.9, "text": "Now, let's turn our attention back to the cruise control system that we're designing,"}, {"start": 464.09999999999997, "end": 467.32, "text": "as it's a little more complex than this distance problem."}, {"start": 467.73999999999995, "end": 473.23999999999995, "text": "Remember, we want our car speed to match our set point at 100 kilometers per hour,"}, {"start": 473.4, "end": 479.02, "text": "and we need to design a controller that can take in this information and adjust the accelerator position."}, {"start": 479.02, "end": 483.62, "text": "We'll say our accelerator position can go from 0 to 10 centimeters."}, {"start": 484.24, "end": 489.7, "text": "0 is when we're not touching the pedal, and 10 centimeters is pushing it in as far as it will go."}, {"start": 490.14, "end": 495.52, "text": "For the sake of argument, we'll say that we can cruise at 100 kilometers per hour on a flat road"}, {"start": 495.52, "end": 498.7, "text": "when the accelerator is pressed in at 5 centimeters."}, {"start": 498.7, "end": 503.76, "text": "Now, let's choose an initial proportional constant, say, 0.1."}, {"start": 504.34, "end": 508.64, "text": "At 0 kilometers per hour, the error is 100 kilometers per hour,"}, {"start": 508.84, "end": 513.7, "text": "and the output of our controller is 0.1 times 100 to get 10 centimeters."}, {"start": 514.16, "end": 519.16, "text": "That's pressing the accelerator all the way in, so we will accelerate quite quickly at first."}, {"start": 519.5, "end": 523.42, "text": "Then, at 30 kilometers per hour, our error is 70."}, {"start": 523.42, "end": 529.04, "text": "Times our constant of 0.1, that means we begin to let off the gas pedal by a few centimeters."}, {"start": 529.4, "end": 533.8, "text": "At 50 kilometers per hour, we've moved the gas pedal to 5 centimeters."}, {"start": 533.9799999999999, "end": 537.3, "text": "Remember, that is our assumed cruising pedal position."}, {"start": 537.8199999999999, "end": 538.56, "text": "Do you see the problem?"}, {"start": 539.38, "end": 541.5799999999999, "text": "We're not at our desired speed."}, {"start": 542.0999999999999, "end": 545.68, "text": "At 50 kilometers per hour and a pedal position of 5 centimeters,"}, {"start": 545.88, "end": 547.9599999999999, "text": "we'll continue to accelerate some."}, {"start": 547.96, "end": 553.5, "text": "However, once we reach 60 kilometers per hour, our pedal position will be at 4 centimeters."}, {"start": 554.08, "end": 558.74, "text": "For the sake of this example, we'll say that we can cruise at 60 kilometers per hour"}, {"start": 558.74, "end": 561.02, "text": "with the pedal position at 4 centimeters."}, {"start": 561.4200000000001, "end": 564.38, "text": "But we'll never quite get to our desired speed."}, {"start": 564.86, "end": 571.14, "text": "If our error is 0, that means our proportional controller will set the accelerator position to 0,"}, {"start": 571.5400000000001, "end": 574.52, "text": "which essentially means no power from our engine."}, {"start": 575.08, "end": 577.26, "text": "Let's graph our error and speed."}, {"start": 577.26, "end": 581.54, "text": "As you can see, we go from 0 up to 60 kilometers per hour,"}, {"start": 581.7, "end": 583.78, "text": "but we never quite reach our set point."}, {"start": 584.38, "end": 587.98, "text": "The difference between our set point and actual achieved cruising speed"}, {"start": 587.98, "end": 589.98, "text": "is known as the steady state error."}, {"start": 590.76, "end": 594.64, "text": "Many systems, like a cruise control, suffer from this steady state error."}, {"start": 595.1, "end": 599.38, "text": "No matter how we adjust KP, we'll never quite get to the set point."}, {"start": 599.88, "end": 601.76, "text": "We could include a constant offset,"}, {"start": 602.1, "end": 605.28, "text": "but there's a better, more robust way to handle such errors."}, {"start": 605.28, "end": 608.14, "text": "Let's go back to our system diagram for a moment."}, {"start": 608.56, "end": 614.1999999999999, "text": "A common way to find steady state error is to look at how much error has accumulated over time."}, {"start": 614.72, "end": 617.4599999999999, "text": "We then multiply that amount by some new constant,"}, {"start": 617.72, "end": 621.66, "text": "KI, before adding it to the output of our proportional controller."}, {"start": 621.66, "end": 626.1, "text": "In the math world, we would take the area under our error curve,"}, {"start": 626.3, "end": 627.4, "text": "which would be an integral."}, {"start": 627.8399999999999, "end": 630.3399999999999, "text": "This is how we get to a PI controller."}, {"start": 630.7199999999999, "end": 634.8, "text": "Proportional and integral values are summed together to produce a single output."}, {"start": 635.24, "end": 640.9599999999999, "text": "However, integrating this unknown error function is often impossible for most real-world systems."}, {"start": 640.96, "end": 644.36, "text": "So we can take an approximation of that integral."}, {"start": 644.7800000000001, "end": 651.12, "text": "We simply sum each error term over time and then multiply that accumulated value by our KI constant."}, {"start": 651.62, "end": 657.64, "text": "Note that for a true summation approximation, you should multiply by a delta T interval time."}, {"start": 657.96, "end": 661.9200000000001, "text": "To make our calculations easier, we can assume that this is 1."}, {"start": 662.64, "end": 666.26, "text": "For example, maybe we take an error reading every 1 second."}, {"start": 666.26, "end": 672.0, "text": "Or if we know that this interval time is constant, we can just say it's part of our KI value."}, {"start": 672.3199999999999, "end": 675.4399999999999, "text": "Either way, we won't need to worry about this term in this example."}, {"start": 675.78, "end": 681.46, "text": "Now, let's see what happens if we include this integral term with our proportional term from the previous example."}, {"start": 681.76, "end": 685.72, "text": "We start at 0 kilometers per hour, so our error is 100."}, {"start": 686.12, "end": 691.7, "text": "From before, we know that our proportional controller wants to set the accelerator to 10 centimeters,"}, {"start": 692.02, "end": 694.46, "text": "assuming we have KP set to 0.1."}, {"start": 694.46, "end": 697.44, "text": "We'll set the KI term to 0.01."}, {"start": 698.0600000000001, "end": 703.2, "text": "As this is the start of the accumulation, the approximate integral is just 100."}, {"start": 703.58, "end": 707.58, "text": "100 times our KI of 0.01 is 1 centimeter."}, {"start": 707.9200000000001, "end": 712.14, "text": "We then add the two controller outputs together to get a sum of 11 centimeters."}, {"start": 712.48, "end": 718.94, "text": "Our accelerator doesn't go to 11, so for now, we'll just say we max out the accelerator at 10 centimeters."}, {"start": 719.34, "end": 722.4200000000001, "text": "We start accelerating up to 30 kilometers per hour,"}, {"start": 722.42, "end": 725.2199999999999, "text": "so our error term is now 70."}, {"start": 725.64, "end": 729.04, "text": "Our proportional controller sets the pedal to 7 centimeters."}, {"start": 729.64, "end": 734.8399999999999, "text": "In the integral controller, we accumulate 70 on top of 100 to get 170,"}, {"start": 735.36, "end": 740.3, "text": "and multiply that by our constant to get an output of 1.7 centimeters."}, {"start": 740.86, "end": 745.0, "text": "Our new PI controller output is 8.7 centimeters."}, {"start": 745.0, "end": 750.06, "text": "So, we keep the accelerator pressed farther than we did with just the P controller."}, {"start": 750.42, "end": 757.48, "text": "We continue this trend to get a PI controller output of 7.2 centimeters when going 50 kilometers per hour."}, {"start": 757.94, "end": 761.04, "text": "Notice that the P controller is starting to contribute less,"}, {"start": 761.18, "end": 765.98, "text": "but the I controller is contributing more as the area under the error curve grows."}, {"start": 766.38, "end": 770.66, "text": "At 70 kilometers per hour, the output is 5.5 centimeters."}, {"start": 770.66, "end": 777.3399999999999, "text": "We've already passed our original limit of 60 kilometers per hour when we used just the P controller."}, {"start": 777.8199999999999, "end": 782.5, "text": "Even at 70 kilometers per hour, our controller is saying to continue accelerating."}, {"start": 782.9399999999999, "end": 788.36, "text": "However, when we reach 80 kilometers per hour, the total output has dipped below 5 centimeters,"}, {"start": 788.6999999999999, "end": 790.36, "text": "which we know is a problem."}, {"start": 791.1, "end": 792.26, "text": "There's still an error."}, {"start": 792.62, "end": 794.74, "text": "But wait, let's see what happens next."}, {"start": 794.74, "end": 800.36, "text": "Next, assuming we continue at 80 kilometers per hour, the P controller will output the same amount."}, {"start": 800.82, "end": 804.04, "text": "However, the integral controller continues to accumulate."}, {"start": 804.42, "end": 808.42, "text": "It says to increase the value of the output to account for that error."}, {"start": 808.64, "end": 812.38, "text": "So, we press the accelerator a little more to start closing that error."}, {"start": 812.78, "end": 816.94, "text": "It might look like the output will fluctuate as it approaches that steady state value,"}, {"start": 816.94, "end": 822.24, "text": "but this example is just intended to show how the integral controller will account for that error."}, {"start": 822.24, "end": 825.26, "text": "In reality, our example will look something like this."}, {"start": 825.58, "end": 829.78, "text": "The proportional and integral terms will reach a steady state when the error is zero,"}, {"start": 829.94, "end": 831.94, "text": "which means we perfectly hit our mark."}, {"start": 832.38, "end": 835.94, "text": "In fact, in many cases, a P.I. controller is all we need."}, {"start": 836.32, "end": 840.74, "text": "It's enough to move a process toward its goal while accounting for steady state error."}, {"start": 841.14, "end": 846.32, "text": "However, you'll often run into other issues that can't be solved by proportional and integral terms alone."}, {"start": 846.62, "end": 849.92, "text": "A well-tuned P.I. controller looks something like this."}, {"start": 849.92, "end": 853.12, "text": "However, the rate of change might be too slow for you."}, {"start": 853.54, "end": 855.7199999999999, "text": "This is known as an overdamped response."}, {"start": 856.26, "end": 858.9799999999999, "text": "You may want your process to approach the goal quickly."}, {"start": 859.24, "end": 864.5799999999999, "text": "So, you start playing with the K.P. and K.I. terms, and you end up with something like this."}, {"start": 864.86, "end": 868.76, "text": "While the system approaches the set point quickly, it also overshoots."}, {"start": 869.14, "end": 874.64, "text": "The integral term will account for the negative error and eventually bring the output in line with the set point."}, {"start": 875.02, "end": 878.16, "text": "However, the system might oscillate for a while before it does that."}, {"start": 878.16, "end": 880.62, "text": "This is known as an underdamped response."}, {"start": 881.04, "end": 885.3, "text": "In many cases, no matter how much you fiddle with the K.P. and K.I. terms,"}, {"start": 885.68, "end": 890.66, "text": "you can't seem to find a good balance between an overdamped and an underdamped response."}, {"start": 891.1, "end": 894.4599999999999, "text": "What you're after is a response curve that looks like this."}, {"start": 894.78, "end": 899.26, "text": "The process quickly approaches the set point and settles there with no overshoot."}, {"start": 899.5799999999999, "end": 901.78, "text": "This is known as a critically damped response."}, {"start": 902.14, "end": 905.92, "text": "To make this happen, we need to add one more component to our controller."}, {"start": 905.92, "end": 907.9399999999999, "text": "This is the derivative term."}, {"start": 908.3399999999999, "end": 912.1999999999999, "text": "We multiply the rate of change in the error by some constant, KD."}, {"start": 912.64, "end": 917.0799999999999, "text": "We sum the proportional, integral, and derivative terms together to get the output."}, {"start": 917.4399999999999, "end": 920.14, "text": "This is known as a PID controller."}, {"start": 920.74, "end": 922.4399999999999, "text": "Let's see how this works with an example."}, {"start": 923.0, "end": 926.38, "text": "The derivative of the error is the slope at that particular point."}, {"start": 926.78, "end": 932.28, "text": "That means if the error is decreasing quickly, meaning we are accelerating fast toward our target speed,"}, {"start": 932.28, "end": 936.28, "text": "then the derivative term will be a negative number with a large magnitude."}, {"start": 936.92, "end": 941.42, "text": "Like with the integral term, this is often difficult or impossible to analytically solve"}, {"start": 941.42, "end": 944.14, "text": "unless you have a mathematical model of your process."}, {"start": 944.64, "end": 948.24, "text": "So we turn to numerical estimations again to help us out."}, {"start": 948.64, "end": 953.0, "text": "We can approximate the derivative by simply subtracting the current error value"}, {"start": 953.0, "end": 957.4599999999999, "text": "from the previous error value and dividing that by our sampling interval time."}, {"start": 957.46, "end": 961.6, "text": "That should give us the slope of the line between the current and previous values,"}, {"start": 961.7800000000001, "end": 964.02, "text": "which is good enough for what we need in most cases."}, {"start": 964.46, "end": 968.52, "text": "And just like we did with the integral term, we can assume the sampling interval,"}, {"start": 968.8000000000001, "end": 972.7800000000001, "text": "delta T, is 1, or we can assume it's part of our constant for now."}, {"start": 973.2, "end": 977.24, "text": "The difference between the current and previous error values will work in this instance."}, {"start": 977.82, "end": 982.8000000000001, "text": "The idea is that we want a term that can tell if we are approaching the goal too fast"}, {"start": 982.8, "end": 986.92, "text": "and dampen the response just enough so that we don't overshoot."}, {"start": 986.92, "end": 989.5799999999999, "text": "So let's work on another simple example."}, {"start": 989.9599999999999, "end": 993.5999999999999, "text": "Here we've added the proportional, integral, and derivative terms."}, {"start": 994.0999999999999, "end": 997.7199999999999, "text": "I've adjusted the ki coefficient to be a little higher."}, {"start": 998.16, "end": 1003.06, "text": "That way our speed increases much more quickly toward our goal, at least in theory."}, {"start": 1003.52, "end": 1009.4, "text": "It's not a perfect example, but it should illustrate how the p, i, and d terms work together."}, {"start": 1009.4, "end": 1013.06, "text": "At first, we accelerate very quickly from a stop."}, {"start": 1013.4599999999999, "end": 1017.34, "text": "Note here that the derivative term is zero as we do not have a slope yet."}, {"start": 1017.6999999999999, "end": 1021.84, "text": "Once again, we make the assumption that we can only push the pedal to 10 centimeters."}, {"start": 1022.4, "end": 1026.94, "text": "At 30 kilometers per hour, the integral term starts to increase quickly."}, {"start": 1027.36, "end": 1029.62, "text": "However, because we are accelerating so fast,"}, {"start": 1029.94, "end": 1035.76, "text": "the difference between this and the last error terms dampen the current pedal position to 7.1."}, {"start": 1035.76, "end": 1041.28, "text": "We repeat this procedure and we see that we've dampened the pedal position again to 7 centimeters."}, {"start": 1041.84, "end": 1047.58, "text": "At 70 kilometers per hour, our derivative controller output is again minus 2 centimeters,"}, {"start": 1047.98, "end": 1050.2, "text": "which makes the total 5.5 centimeters."}, {"start": 1050.68, "end": 1053.94, "text": "We still have the pedal pressed more than what we want to cruise at,"}, {"start": 1054.2, "end": 1055.36, "text": "but it means we're accelerating."}, {"start": 1055.7, "end": 1057.6, "text": "As we start to approach our goal,"}, {"start": 1057.8799999999999, "end": 1062.28, "text": "you can see how the proportional term approaches zero and the integral term takes over."}, {"start": 1062.28, "end": 1067.54, "text": "The derivative term is no longer needed to dampen, so that also approaches zero."}, {"start": 1067.98, "end": 1073.8, "text": "In the ideal case, we land right at 100 kilometers per hour with the pedal at 5 centimeters."}, {"start": 1074.18, "end": 1080.0, "text": "We probably overshot a little as the pedal was pulled back to 4 centimeters for that second-to-last sample."}, {"start": 1080.52, "end": 1083.62, "text": "That's probably just indicative of my poor example here."}, {"start": 1083.92, "end": 1088.74, "text": "However, it shows that we need to tune the kp, ki, and kd terms"}, {"start": 1088.74, "end": 1093.72, "text": "to make a system that is critically damped where we approach our goal quickly without overshooting."}, {"start": 1094.04, "end": 1098.34, "text": "If you have a mathematical model that correctly describes the behavior of the plant,"}, {"start": 1098.64, "end": 1104.14, "text": "you can solve for kp, ki, and kd to make the system critically damped."}, {"start": 1104.46, "end": 1107.48, "text": "This model is usually expressed as a transfer function,"}, {"start": 1107.76, "end": 1110.92, "text": "which gives the plant's output for any given input."}, {"start": 1111.24, "end": 1113.98, "text": "This works well in academic settings with simple plants."}, {"start": 1113.98, "end": 1119.68, "text": "In most cases, it's either impossible or very difficult to know the exact transfer function of the plant."}, {"start": 1120.06, "end": 1122.3600000000001, "text": "So, we turn to other tuning methods."}, {"start": 1122.78, "end": 1125.8, "text": "There are a number of ways to tune a PID controller,"}, {"start": 1126.02, "end": 1128.42, "text": "but we'll demonstrate a simple manual method here."}, {"start": 1128.78, "end": 1131.72, "text": "We measure the output as we vary each of the constants."}, {"start": 1132.26, "end": 1136.34, "text": "You set ki and kd to zero and leave kp at some low value."}, {"start": 1136.72, "end": 1141.1, "text": "You increase kp until the output oscillates with some steady state offset."}, {"start": 1141.1, "end": 1145.2199999999998, "text": "You then increase ki until you correct the steady state offset,"}, {"start": 1145.54, "end": 1147.2199999999998, "text": "even if that means more oscillation."}, {"start": 1148.08, "end": 1152.56, "text": "Just make sure the output does not become unstable and oscillates out of control."}, {"start": 1153.06, "end": 1156.1799999999998, "text": "Finally, adjust kd to remove the oscillations."}, {"start": 1156.56, "end": 1159.8799999999999, "text": "At the end of the process, you should have an optimally tuned system."}, {"start": 1160.3999999999999, "end": 1163.9599999999998, "text": "Note there are other tuning schemes, such as the Ziegler-Nichols method,"}, {"start": 1164.26, "end": 1167.3, "text": "where you can use some math to help you choose ki and kd"}, {"start": 1167.3, "end": 1169.78, "text": "to reduce the amount of trial and error that's needed."}, {"start": 1169.78, "end": 1173.94, "text": "Early PID controllers were pneumatic, and then eventually electrical."}, {"start": 1174.48, "end": 1178.96, "text": "Here is an example of a classical electrical PID controller used in a research paper."}, {"start": 1179.28, "end": 1184.8799999999999, "text": "However, most modern PID controllers rely on code and microcontrollers rather than discrete components."}, {"start": 1185.3999999999999, "end": 1188.92, "text": "This is some pseudocode for how you might implement a PID controller."}, {"start": 1189.3999999999999, "end": 1193.06, "text": "We set the constants to some arbitrary values to be tuned later,"}, {"start": 1193.22, "end": 1195.44, "text": "and we also need to know the interval time."}, {"start": 1195.44, "end": 1199.78, "text": "This corresponds to the sample rate, how often we will sample from our sensor,"}, {"start": 1200.14, "end": 1202.02, "text": "and perform some action on our plant."}, {"start": 1202.52, "end": 1204.18, "text": "We'll go with one millisecond."}, {"start": 1204.66, "end": 1206.24, "text": "We loop forever in this case."}, {"start": 1206.42, "end": 1210.7, "text": "At the beginning of the loop, we read our feedback value, which is often from a sensor."}, {"start": 1211.0800000000002, "end": 1213.5800000000002, "text": "We then calculate each of the PID terms."}, {"start": 1213.58, "end": 1218.46, "text": "To do that, we take the difference between the set point and the measured value to get the error term."}, {"start": 1218.86, "end": 1222.6599999999999, "text": "We then multiply it by the interval to accumulate in the integral term."}, {"start": 1223.12, "end": 1226.86, "text": "The derivative term takes the difference between the current and previous errors,"}, {"start": 1227.02, "end": 1229.02, "text": "and then divides that value by the interval."}, {"start": 1229.4399999999998, "end": 1234.3, "text": "We then multiply each of these values by their respective k constants and add them together."}, {"start": 1234.62, "end": 1239.06, "text": "While not shown here, you would use that output value to drive whatever you needed."}, {"start": 1239.06, "end": 1243.46, "text": "This could be, say, adjusting the accelerator by some amount in centimeters."}, {"start": 1244.02, "end": 1249.76, "text": "Finally, we save the error value for the next iteration and then wait for the given interval time."}, {"start": 1250.08, "end": 1251.98, "text": "This is a very simple example."}, {"start": 1252.34, "end": 1258.3, "text": "You could obviously do this in a separate thread with timers or using a variable interval time."}, {"start": 1258.8799999999999, "end": 1262.4199999999998, "text": "You would also need to spend some time tuning the 3k constants,"}, {"start": 1262.78, "end": 1267.24, "text": "but this should be enough to get you started making your own PID controllers in code."}, {"start": 1267.24, "end": 1270.48, "text": "Now, where would you actually use such a controller?"}, {"start": 1271.1, "end": 1274.26, "text": "PID controllers are used in countless applications."}, {"start": 1274.86, "end": 1280.52, "text": "And as you probably guessed, most cruise control systems in cars use PID controllers."}, {"start": 1280.98, "end": 1285.9, "text": "In the 1920s, Minorski was researching methods for automatic ship steering"}, {"start": 1285.9, "end": 1289.68, "text": "when he devised his theoretical analysis of PID controllers."}, {"start": 1290.22, "end": 1293.8, "text": "They are also heavily used in manufacturing and industrial equipment."}, {"start": 1293.8, "end": 1299.36, "text": "For example, many reflow ovens use PID controllers to adjust the heating elements as needed"}, {"start": 1299.36, "end": 1301.36, "text": "to match the set points in the profile."}, {"start": 1301.86, "end": 1305.22, "text": "This allows mass soldering of components without burning boards."}, {"start": 1305.8, "end": 1309.8999999999999, "text": "I hope this helps you understand the theory behind PID controllers"}, {"start": 1309.8999999999999, "end": 1315.2, "text": "and how they can be used to regulate a system based on feedback from one or more sensors."}, {"start": 1315.76, "end": 1319.82, "text": "In a future episode, I'll demonstrate tuning a PID controller."}, {"start": 1320.28, "end": 1321.94, "text": "Stay tuned and happy hacking!"}, {"start": 1321.94, "end": 1323.7, "text": "Stay tuned!"}, {"start": 1324.44, "end": 1324.96, "text": "souvenirs"}, {"start": 1324.96, "end": 1325.0800000000002, "text": "etten北"}, {"start": 1325.0800000000002, "end": 1325.7, "text": "店"}, {"start": 1326.28, "end": 1326.42, "text": "店"}]}