{"video_id": "uwDajwnP2XE", "url": "https://www.youtube.com/watch?v=uwDajwnP2XE", "title": "uwDajwnP2XE", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 12.6, "text": "Hi, Lonnie Vaughn with Emotiva Audio here. Another one of our Tech Talks today and today"}, {"start": 12.6, "end": 17.88, "text": "we're going to be exploring the amplifier. The little humble amplifier that's also the workhorse"}, {"start": 17.88, "end": 23.1, "text": "of your system. Every system has it, whether it's built into another piece of gear or whether it's"}, {"start": 23.1, "end": 29.64, "text": "external. Every system out there has to have an amp, else you're not going to get anything out"}, {"start": 29.64, "end": 36.4, "text": "of touch speakers. Now, there's a lot of misconceptions about what an amp is and how it works and what"}, {"start": 36.4, "end": 40.760000000000005, "text": "it does and I want to try and give you a little background, tell you how they work and what"}, {"start": 40.760000000000005, "end": 47.66, "text": "they do and dispel some of those myths that you probably hear a lot of on the web. So, first"}, {"start": 47.66, "end": 54.82, "text": "off, what is an amp? Well, take it from the old Latin term of amplify, it means to increase"}, {"start": 54.82, "end": 61.36, "text": "and that's what an amp does. It's actually just a multiplier. It takes whatever signal"}, {"start": 61.36, "end": 67.58, "text": "comes in, it multiplies it x number of times and then it sends it on out and that's all"}, {"start": 67.58, "end": 71.14, "text": "it does. It has no real intelligence to it and we're going to get to that in a little"}, {"start": 71.14, "end": 77.74000000000001, "text": "bit later and some of those myths that are out there. So, an amplifier is just a multiplier"}, {"start": 77.74, "end": 84.28, "text": "but it increases both the voltage and the current to a level that can actually drive a speaker."}, {"start": 84.28, "end": 89.6, "text": "Now, what I've got here is just a little setup to show you the difference of what it actually"}, {"start": 89.6, "end": 95.64, "text": "does. I'm using my audio precision here to generate a test tone instead of music because"}, {"start": 95.64, "end": 102.74, "text": "a test tone is easier to actually visually see and measure. That is being fed into the amplifier"}, {"start": 102.74, "end": 110.28, "text": "as well as into my scope over here and the output of the amplifier is going into the scope as well."}, {"start": 110.28, "end": 118.88, "text": "Alright, so here I've got a 1k signal just middle of the road 1k signal. I'm sending out 1 volt of"}, {"start": 118.88, "end": 125.36, "text": "signal. Now, that's representative of what a preamp will do. Most source units and preamps will put out"}, {"start": 125.36, "end": 132.2, "text": "around 1 maybe 2 volts of output drive and if you're really lucky you might get a preamp that does up to"}, {"start": 132.2, "end": 138.6, "text": "about 6 or 9. Which is like our preamps. Our preamps are high level output but you really don't need"}, {"start": 138.6, "end": 144.14, "text": "that much. It's just there so that it doesn't ever clip. That being said, I'm putting out about a volt"}, {"start": 144.14, "end": 151.94, "text": "into the unit. Now, if you look at this top line up here on the scope, it doesn't really look like much."}, {"start": 151.94, "end": 160.39999999999998, "text": "I'm going to change the scale. Right now, the top line and the bottom line are on the same scale. If I adjust the scale,"}, {"start": 160.4, "end": 171.4, "text": "you see now we have a signal that represents the same as what's on the bottom. If I take it back and match the two scales again,"}, {"start": 171.4, "end": 189.4, "text": "this is our incoming signal. You see how small it is? This is what's coming out of the amp. That's how much of an increase you actually get of what goes in versus what comes out. In this case, it's 29 dB. That's about average for most consumer equipment."}, {"start": 189.4, "end": 202.4, "text": "There's a few companies out there that make some that are 26 and some that are 32. But it's all going to be in the ballpark of around 29 dB of gain. In this case, that means it's a multiplier 28."}, {"start": 202.4, "end": 218.4, "text": "dB and gain are not the same. It just happens to work out that in this case, it's 28 times of multiplication. So, we're coming in with our test signal. We're coming out with a much higher level signal. Boom. That's what an amp does."}, {"start": 218.4, "end": 230.4, "text": "Now, let's talk about some of the stuff that's out there that people ask me all the time and stuff that I see out on the web. People seem to be a little confused."}, {"start": 230.4, "end": 239.4, "text": "Most common one of all is there's no markings to designate right, left, center, or whatever. Why? How do I know which one to put it into?"}, {"start": 239.4, "end": 252.4, "text": "Answer to that is very simple. It doesn't matter. An amp channel is just a channel. The amp doesn't know right from left, center, or anything else. It's just a channel."}, {"start": 252.4, "end": 265.4, "text": "So, you select your channel and you say, okay, I'm going to put my right channel in here, I'm going to put my left channel in here. That's fine. All you have to do is make sure you match up your speaker wires to those channels and everything's correct."}, {"start": 265.4, "end": 273.4, "text": "If you want to move it around to make it easier to understand, select any one of them that you want because the amp doesn't know and doesn't care."}, {"start": 273.4, "end": 285.4, "text": "Another big myth that I always hear. People are afraid to buy a 300, 400, 500 watt amp because their speakers are rated at 200 watts."}, {"start": 285.4, "end": 290.4, "text": "They're afraid they're actually going to blow their speakers. Well, you're not. And I'll show you why."}, {"start": 290.4, "end": 299.4, "text": "Because this is a multiplier, if I turn the level down, you notice my output level is also going down."}, {"start": 299.4, "end": 309.4, "text": "So, this is proportional. How much power an amp puts out in its ratings means that's its maximum capability of producing energy."}, {"start": 309.4, "end": 316.4, "text": "But what it actually puts out is proportional to how high you turn up the volume."}, {"start": 316.4, "end": 327.4, "text": "So, don't be afraid to put a bigger amp on speakers. If speakers say they're 200 watts, 300 watts, whatever, and you want to put a 500 or 1000 watt amp on there,"}, {"start": 327.4, "end": 333.4, "text": "that's actually a really good thing because the one thing you don't want to do is drive an amp into clipping."}, {"start": 333.4, "end": 340.4, "text": "When you drive an amp into clipping, essentially it's hitting its maximum voltage rail and it's going to start to flat line at the top."}, {"start": 340.4, "end": 344.4, "text": "That's going to cause the voice coils and the speaker to superheat."}, {"start": 344.4, "end": 352.4, "text": "And how much power our speaker handles is directly proportional to how much heat it can get rid of."}, {"start": 352.4, "end": 359.4, "text": "So, when you clip an amp, the voice coils and the speaker are superheat and you can do damage over time."}, {"start": 359.4, "end": 363.4, "text": "So, don't be afraid to buy a big amp. Bigger is always better."}, {"start": 363.4, "end": 366.4, "text": "You'll never be unhappy that you did that."}, {"start": 366.4, "end": 375.4, "text": "The third biggest thing that always comes to mind is when people get their systems hooked up and they go up and they call up all the time."}, {"start": 375.4, "end": 379.4, "text": "If I go right up to my speaker, I can hear a little bit of what sounds like background noise."}, {"start": 379.4, "end": 383.4, "text": "Why is that? Is there something wrong? Is there something wrong?"}, {"start": 383.4, "end": 385.4, "text": "Nope. Nothing wrong."}, {"start": 385.4, "end": 391.4, "text": "Your source, your preamp, whatever is going to have a certain amount of background noise."}, {"start": 391.4, "end": 395.4, "text": "That is going into the amp and the amp is just doing what it does."}, {"start": 395.4, "end": 400.4, "text": "It's multiplying it because it doesn't know the difference between noise and music."}, {"start": 400.4, "end": 406.4, "text": "So, it's just amplifying whatever comes in and that's what you hear when you get right next to your speakers."}, {"start": 406.4, "end": 408.4, "text": "You hear that little bit of background noise."}, {"start": 408.4, "end": 411.4, "text": "You know, that's just normal."}, {"start": 411.4, "end": 414.4, "text": "So, don't worry about that. That's just everything's doing what it's doing."}, {"start": 414.4, "end": 420.4, "text": "And if you can hear it more than maybe a foot or two away, well, give us a call."}, {"start": 420.4, "end": 423.4, "text": "There's something else going on and we need to talk about it."}, {"start": 423.4, "end": 429.4, "text": "It could be cabling. It could be cell phone tower outside your back window. Who knows what."}, {"start": 429.4, "end": 436.4, "text": "But, for all practical purposes, 99% of the people will never hear anything unless they get right next to their speaker."}, {"start": 436.4, "end": 438.4, "text": "And that is normal."}, {"start": 438.4, "end": 443.4, "text": "So, beyond that, there's not much to it."}, {"start": 443.4, "end": 447.4, "text": "And I'm not going to get into how an amp multiplies the signal."}, {"start": 447.4, "end": 449.4, "text": "That would be for another talk, another day."}, {"start": 449.4, "end": 452.4, "text": "But, for now, just think of an amp as a multiplier."}, {"start": 452.4, "end": 455.4, "text": "It is the workhorse of your system."}, {"start": 455.4, "end": 458.4, "text": "And bigger is better."}, {"start": 458.4, "end": 459.4, "text": "Hope that was helpful."}, {"start": 459.4, "end": 462.4, "text": "Thanks for joining us again and we'll talk to you next time."}, {"start": 462.4, "end": 463.4, "text": "Happy listening."}, {"start": 463.4, "end": 464.4, "text": "Have a great week."}, {"start": 464.4, "end": 465.4, "text": "Thank you."}, {"start": 465.4, "end": 466.4, "text": "Thank you again and happy listening."}, {"start": 466.4, "end": 467.4, "text": "Doing great weight营LETEVEEK. amorf ."}, {"start": 467.4, "end": 468.4, "text": "At 14します seезд3dynplus.com"}, {"start": 468.4, "end": 470.4, "text": "For the next video, when the pricedvana looks really cool."}, {"start": 470.4, "end": 472.4, "text": "Oh, this looks very popular."}, {"start": 472.4, "end": 474.4, "text": "No onate."}, {"start": 474.4, "end": 475.4, "text": "Tok ban seismaster."}, {"start": 475.4, "end": 477.4, "text": "Not only what I call it."}, {"start": 477.4, "end": 478.4, "text": "Well, after the shift ?"}, {"start": 478.4, "end": 479.4, "text": "Now, thanks for stopping and second tip."}, {"start": 479.4, "end": 480.4, "text": "We'll talk bacamole f diagram."}, {"start": 480.4, "end": 483.41999999999996, "text": "Let's take on it here with DHS It's the whole opposite is the question that"}]}