{"video_id": "WoxDbIbpP_Q", "url": "https://www.youtube.com/watch?v=WoxDbIbpP_Q", "title": "WoxDbIbpP_Q", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.56, "end": 7.12, "text": "Hi everyone, this is the second in my series of videos on Betaflight filter and PID tuning."}, {"start": 7.92, "end": 13.68, "text": "In this video I'm going to take you through step by step everything you need to do and everything"}, {"start": 13.68, "end": 21.76, "text": "you need to know to get the perfect PID tune on any Betaflight quad. It's quite a lot of material"}, {"start": 21.76, "end": 28.16, "text": "to get through so let's not waste any time. I have to start this video with a little bit of a health"}, {"start": 28.16, "end": 34.32, "text": "warning. This video presumes that you are using my recommended filter tuning approach. Now I've done"}, {"start": 34.32, "end": 40.32, "text": "another video where I look at filter tuning in Betaflight. This video assumes that you've completed"}, {"start": 40.32, "end": 45.36, "text": "that video and that you've now got your filters correctly tuned. Don't proceed with this video"}, {"start": 45.36, "end": 52.879999999999995, "text": "until you've completed steps one to three in that other video. So the next steps are PID tuning and"}, {"start": 52.879999999999995, "end": 58.0, "text": "there are three steps here that we're going to cover in this video. Finding your max D gains that"}, {"start": 58.0, "end": 65.12, "text": "you're comfortable with. Then finding the right P to D balance in order to get a critically damped PID"}, {"start": 65.12, "end": 72.0, "text": "response. And then the final stage tuning feed forward for set point tracking so that we get"}, {"start": 72.0, "end": 77.36, "text": "really really great responsiveness of the quad, really close tracking of your stick inputs."}, {"start": 78.8, "end": 84.88, "text": "Now in order to get a really good PID tune on your quadcopter it really helps if you understand"}, {"start": 84.88, "end": 91.52, "text": "all the different elements of Betaflight's PID controller and what they all do. Now Betaflight's"}, {"start": 91.52, "end": 98.88, "text": "PID controller consists of four main parts. P is the proportional term of the PID controller."}, {"start": 99.6, "end": 106.16, "text": "I is the integral term of the PID controller. D is the derivative term of the PID controller."}, {"start": 106.16, "end": 111.75999999999999, "text": "And feed forward is used to push the quad into sharp moves and improve set point tracking."}, {"start": 111.76, "end": 117.44, "text": "Now don't worry if you don't understand all of these terms right away. We're going to go through"}, {"start": 117.44, "end": 125.04, "text": "them all step by step and explain how they all work now. So let's look at a diagram of Betaflight's"}, {"start": 125.04, "end": 132.4, "text": "PID controller. You can see that it takes two inputs. The first input is the input from the gyro which is"}, {"start": 132.4, "end": 138.32, "text": "telling the PID controller what the quad is doing at this instant. And then the second input is the set"}, {"start": 138.32, "end": 145.2, "text": "point. Now this is your stick positions multiplied by your rates. So it's what you are telling the quad"}, {"start": 145.2, "end": 152.88, "text": "you want it to do at that instant. And these two input terms are combined in this sum here. So the"}, {"start": 152.88, "end": 160.72, "text": "set point minus the gyro gives the PID error. So the PID error is the difference between what you told the"}, {"start": 160.72, "end": 168.08, "text": "quad you wanted it to do and what it is actually doing. And that PID error is fed into the derivative,"}, {"start": 168.08, "end": 172.96, "text": "proportional and integral terms. And they do some maths on it which we'll talk about in a second."}, {"start": 173.68, "end": 180.16, "text": "And the results of those terms are all added together along with the feed forward term which"}, {"start": 180.16, "end": 186.72, "text": "is based only on the set point. They're all added together here. And this is where the PID gains that"}, {"start": 186.72, "end": 192.96, "text": "you set in beta flight are applied. So if you set a really big gain for the derivative term for example"}, {"start": 193.52, "end": 201.04, "text": "in this addition block here this gets multiplied by that gain. So if you double the derivative gain, the"}, {"start": 201.04, "end": 209.04, "text": "D gain, then it will add twice as much into this block as before. If you halve the proportional gain, suddenly"}, {"start": 209.04, "end": 215.6, "text": "this term only gets added half as much. So that's where all your PID gains live in this block here."}, {"start": 216.64, "end": 222.79999999999998, "text": "Once all of those have been added together, that gives a control signal telling the quad how to"}, {"start": 222.79999999999998, "end": 229.28, "text": "change what it is doing. And that gets passed to the motor mixer. And the motor mixer determines,"}, {"start": 229.28, "end": 236.32, "text": "ah well if you want me to roll left more quickly, then I need to increase the speed of the right motors"}, {"start": 236.32, "end": 241.84, "text": "and decrease the speed of the left motors. So it turns the control signal that's telling the quad what"}, {"start": 241.84, "end": 250.64, "text": "to do into which motors do I speed up, which do I slow down. That's what the motor mixer does. So that"}, {"start": 250.64, "end": 257.76, "text": "is how the beta flight PID controller works in a very simple way. Now let's talk about the different"}, {"start": 257.76, "end": 262.56, "text": "terms. And we'll start with the proportional term because I think it's easiest to understand."}, {"start": 262.56, "end": 270.64, "text": "Now the proportional term looks at the PID error. This blue line here represents zero PID error."}, {"start": 271.2, "end": 277.28000000000003, "text": "So if we have some positive PID error, then the proportional term pushes back against that and"}, {"start": 277.28000000000003, "end": 284.16, "text": "tries to bring the PID error to zero. If that PID error gets bigger, the proportional term pushes harder."}, {"start": 284.16, "end": 290.32, "text": "And if it's very big like this, you can see it's pushing really hard. If the PID error goes negative,"}, {"start": 291.04, "end": 297.92, "text": "then the proportional term still pushes back towards zero. So it's pushing back towards zero the whole"}, {"start": 297.92, "end": 304.48, "text": "time. And the bigger the PID error, the harder it pushes back. And so whatever size the PID error is,"}, {"start": 304.48, "end": 309.52, "text": "and whether it's positive or negative, that proportional term is just acting to try and reduce"}, {"start": 309.52, "end": 317.2, "text": "that PID error back towards that blue line, the zero line. Now let's talk about the derivative term."}, {"start": 317.2, "end": 324.4, "text": "Now the derivative term is a little bit different. Because all the derivative term wants is for the"}, {"start": 324.4, "end": 331.59999999999997, "text": "PID error to stay the same from one minute to the next. It doesn't want it to be zero. It just wants it"}, {"start": 331.6, "end": 338.88, "text": "to stay the same. So if the PID error increases, the derivative term doesn't like that because it"}, {"start": 338.88, "end": 345.04, "text": "wants the PID error to stay the same. So it acts to try and stop the PID error increasing."}, {"start": 345.04, "end": 353.76000000000005, "text": "But if the PID error starts to decrease, the derivative term doesn't like that either. It wants the PID error to stay the same."}, {"start": 353.76000000000005, "end": 361.76, "text": "So it's pushing back against the PID error decreasing. So this is quite a strange behavior because you can see that"}, {"start": 361.76, "end": 371.76, "text": "things appear to be getting better here. The PID error is decreasing. But the derivative term just is pushing back. It wants the PID error to stay the same and not decrease."}, {"start": 371.76, "end": 380.15999999999997, "text": "So that's how the derivative term works. The integral term also has a bit of a different behavior."}, {"start": 381.28, "end": 392.71999999999997, "text": "The integral term adds up the PID error over time. So here we have some small positive PID error. And initially, the integral term pushes back a little bit."}, {"start": 392.72, "end": 398.88000000000005, "text": "But then if that error doesn't go away, the integral term says, ah, I'll push back twice as hard."}, {"start": 398.88000000000005, "end": 406.72, "text": "And then if there's another same amount of error again, three times as hard, four times as hard, five times as hard."}, {"start": 406.72, "end": 415.28000000000003, "text": "It's adding up over time, that error. And the longer that error is there, the harder the integral term pushes back."}, {"start": 415.28, "end": 422.79999999999995, "text": "But then what if the error goes negative? Well, the integral term then says, oh, okay, well, you've been negative for a bit."}, {"start": 422.79999999999995, "end": 428.4, "text": "So I guess I don't need to push as hard. Oh, you're still negative. I'm going to push even less."}, {"start": 429.11999999999995, "end": 434.0, "text": "Ah, still negative, even less. You can see it's adding up, but it's actually subtracting."}, {"start": 434.0, "end": 440.08, "text": "It's taking a little bit away from its push every time it sees that negative PID error."}, {"start": 440.64, "end": 446.24, "text": "So you can see the integral term is just counting. It's just adding up the error over time."}, {"start": 446.24, "end": 454.96, "text": "And it's pushing back towards zero, but it's pushing back based on how much error has accumulated over time."}, {"start": 456.56, "end": 462.47999999999996, "text": "And the feedforward term is completely different from the other terms in the PID controller,"}, {"start": 462.47999999999996, "end": 467.2, "text": "because it does not act on the PID error. It acts on the set point."}, {"start": 467.2, "end": 479.59999999999997, "text": "And what it says is that if the set point is changing, I need to push the quad in the same direction to start it moving in the direction that the set point is changing."}, {"start": 479.6, "end": 486.56, "text": "So if the set point is increasing, then the feedforward term pushes the quad to change in that direction."}, {"start": 487.52000000000004, "end": 499.28000000000003, "text": "If the set point is decreasing, the feedforward term again pushes back to try and get the quad to move in the direction that the set point is moving in."}, {"start": 499.28, "end": 503.91999999999996, "text": "Let's say you've just commanded full stick right roll."}, {"start": 503.91999999999996, "end": 505.59999999999997, "text": "You're doing a snap roll to the right."}, {"start": 506.15999999999997, "end": 512.4, "text": "The feedforward term sees that set point change and goes, ah, I need to start rolling right right now,"}, {"start": 512.4, "end": 514.8, "text": "because you've commanded a snap roll right."}, {"start": 514.8, "end": 516.4, "text": "I need to start that move now."}, {"start": 517.04, "end": 520.64, "text": "And it doesn't wait for the PID error to build up."}, {"start": 520.64, "end": 522.16, "text": "It acts immediately."}, {"start": 522.16, "end": 528.3199999999999, "text": "And this allows the feedforward term to really reduce the amount of PID error that builds up,"}, {"start": 528.3199999999999, "end": 532.56, "text": "because it gets the quad moving in the right direction straight away."}, {"start": 534.56, "end": 539.4399999999999, "text": "There are three of these PID controllers in Betaflight, and they all work the same way."}, {"start": 539.44, "end": 544.5600000000001, "text": "There's one each for roll, pitch and yaw axis, and they're all separate."}, {"start": 545.2, "end": 549.2800000000001, "text": "The only difference with the yaw axis is that it doesn't have a derivative term,"}, {"start": 549.84, "end": 555.12, "text": "because the nature of the yaw axis for multirotors means that a derivative term isn't required."}, {"start": 557.2800000000001, "end": 562.8000000000001, "text": "So with that said, let's jump into step four, finding your max D gains."}, {"start": 562.8000000000001, "end": 567.84, "text": "Now the foundation, in my opinion, of a good PID tune is the right D gain."}, {"start": 568.48, "end": 573.52, "text": "And the right D gain is as much as you feel comfortable that you can get away with."}, {"start": 574.1600000000001, "end": 578.24, "text": "The more D gain you have, the hotter your motors are going to get,"}, {"start": 578.24, "end": 583.52, "text": "the more likely you are to get D term oscillations, especially if you bend a prop."}, {"start": 584.96, "end": 593.0400000000001, "text": "However, the more D gain you can tolerate without getting motors that are too hot or D term oscillations,"}, {"start": 593.0400000000001, "end": 595.2800000000001, "text": "the better your final tune is going to be."}, {"start": 595.28, "end": 602.16, "text": "Now, before tuning D term, make sure your build is in a representative state."}, {"start": 602.16, "end": 607.68, "text": "So if you typically fly with bent props, make sure that you've got bent props on."}, {"start": 608.56, "end": 613.04, "text": "If you typically fly a very clean build, make sure that that's how it's set up."}, {"start": 613.6, "end": 617.4399999999999, "text": "If you usually fly with a GoPro, make sure that you've got a GoPro on the build."}, {"start": 617.4399999999999, "end": 617.92, "text": "All of these things."}, {"start": 617.92, "end": 624.16, "text": "Just make sure that your build is in the same state that you would normally fly it before you tune it."}, {"start": 624.16, "end": 626.3199999999999, "text": "So we have these three boxes on the right."}, {"start": 626.3199999999999, "end": 632.56, "text": "Now, if we start down here with too little D gain, we're going to have worse prop wash handling."}, {"start": 632.56, "end": 635.12, "text": "We're going to have worse set point tracking."}, {"start": 635.12, "end": 637.92, "text": "So the quad isn't going to follow the sticks as closely."}, {"start": 637.92, "end": 641.4399999999999, "text": "We're going to have a bit of a flight feel, you know, not great."}, {"start": 642.08, "end": 645.36, "text": "But the quad is going to be much more tolerant of vibrations."}, {"start": 645.36, "end": 650.0, "text": "It's going to be more tolerant of damage, more tolerant of bent props, that sort of thing."}, {"start": 651.12, "end": 657.12, "text": "If we have more D gain, we're going to have better prop wash handling, better set point tracking,"}, {"start": 657.12, "end": 660.1600000000001, "text": "that more responsive feel that we all want."}, {"start": 660.16, "end": 664.7199999999999, "text": "And the quad is going to be overall less tolerant of vibration."}, {"start": 664.7199999999999, "end": 668.56, "text": "So you're more likely to get hot motors and maybe even oscillations."}, {"start": 669.1999999999999, "end": 672.3199999999999, "text": "If you damage the quad in flight, you bend a prop, something like that."}, {"start": 673.36, "end": 676.16, "text": "And then at the top here, we have too much D gain."}, {"start": 676.16, "end": 682.7199999999999, "text": "There's a real risk with too much D gain of overheating your motors, smoking motors and blowing ESCs."}, {"start": 683.76, "end": 688.48, "text": "Getting flyaways, oscillations and overall sadness."}, {"start": 688.48, "end": 692.8000000000001, "text": "So we definitely don't want too much D gain, but we also don't want too little."}, {"start": 692.8000000000001, "end": 697.04, "text": "We want to try and aim for that maximum comfortable amount of D gain."}, {"start": 698.4, "end": 703.12, "text": "So the amount of D gain that you want to run really depends on you as a pilot."}, {"start": 703.12, "end": 709.36, "text": "And so I put together this little chart of trying to show what might be the right D gain for different"}, {"start": 709.36, "end": 710.16, "text": "kinds of pilots."}, {"start": 710.72, "end": 716.64, "text": "So if you're a new pilot, you've got an unproven build, or you've got a build with known vibration"}, {"start": 716.64, "end": 720.64, "text": "issues, stick to stock D gains of about 30."}, {"start": 721.28, "end": 722.8, "text": "This is for a five inch freestyle."}, {"start": 723.92, "end": 730.24, "text": "If you are a bandeau basher and you know you're going to need to fly home after having a big crash,"}, {"start": 731.12, "end": 735.52, "text": "or perhaps you've got a build with rough motor bearings because you've had a big crash,"}, {"start": 736.16, "end": 740.72, "text": "then maybe stick with a D gain of about 35, a little bit more than stock."}, {"start": 740.72, "end": 748.88, "text": "If you're an experienced pilot who builds nice clean quads, and you know that you rarely need to"}, {"start": 748.88, "end": 755.52, "text": "fly home from crashes, and more importantly, you know when you shouldn't fly home after a crash,"}, {"start": 755.52, "end": 760.08, "text": "you know when a prop is badly bent enough that you shouldn't fly at home,"}, {"start": 760.72, "end": 764.0, "text": "then perhaps you could tolerate a D gain of about 40."}, {"start": 764.0, "end": 771.36, "text": "If you are a very experienced pilot with a very low vibration build, for example,"}, {"start": 771.36, "end": 777.12, "text": "an AOS 5 frame with PG44A mechanical damping grease applied to it,"}, {"start": 777.76, "end": 781.68, "text": "you've got your filters really dialed in, and you're the kind of pilot who goes,"}, {"start": 782.32, "end": 786.56, "text": "no, no, no, it's a lovely day and I'm going to go and walk and get my quad."}, {"start": 786.56, "end": 789.76, "text": "I am not going to risk flying it back with a bent prop and smoking motors."}, {"start": 789.76, "end": 797.36, "text": "And you're the kind of pilot who wants the best possible flight feel, that kind of fly-by telepathy"}, {"start": 797.36, "end": 806.24, "text": "responsiveness, then you might be able to tolerate even higher D gains, 45, 50, even 55."}, {"start": 806.24, "end": 814.0, "text": "On my perfect AOS 5 build, I'm running D gains between 50 and 55. So it's doable,"}, {"start": 814.0, "end": 816.96, "text": "but you do need to have the right build and the right filter tune."}, {"start": 816.96, "end": 821.2800000000001, "text": "Before starting, you need to unleash your PID controller."}, {"start": 822.32, "end": 827.36, "text": "You need to enter the following into the Betaflight CLI to increase the PID sum limit"}, {"start": 827.36, "end": 834.24, "text": "to 100% of maximum. And what this allows the PID controller to do is to push even harder to try"}, {"start": 834.24, "end": 841.0400000000001, "text": "and follow setpoint. So these are the commands you need to enter. Set PID sum limit equals 1000,"}, {"start": 841.04, "end": 849.8399999999999, "text": "and hit enter. Set PID sum limit equals 1000, and hit enter. And then finally type save and hit enter."}, {"start": 849.8399999999999, "end": 853.04, "text": "And that will save and reboot your flight controller and store those settings."}, {"start": 854.9599999999999, "end": 858.9599999999999, "text": "So now that you know roughly what you might be aiming at in terms of D gains,"}, {"start": 858.96, "end": 867.2, "text": "you need a method to find your perfect D gains. And this is my method. There are other equally good"}, {"start": 867.2, "end": 874.0, "text": "methods. I know Mark Spatz at UAV Tech has another really good method, but this one's my one. So step"}, {"start": 874.0, "end": 880.96, "text": "one is to turn off D-Min. So go into the Betaflight PID tuning tab and turn off D-Min."}, {"start": 882.08, "end": 889.2, "text": "The next step is to gradually turn up the master multiplier slider, 0.1 to 0.2 at a time."}, {"start": 889.92, "end": 896.16, "text": "Every time you turn it up, do a tuning flight with some full throttle punch outs, some hard pylon turns,"}, {"start": 896.16, "end": 903.04, "text": "some aggressive flying, and come in and land and check for hot motors. And during the flight, listen"}, {"start": 903.04, "end": 910.8, "text": "for any kind of growling oscillations or any ticks or jerks from the motors. Repeat these steps, steps"}, {"start": 910.8, "end": 917.92, "text": "two to four, until you have a D gain that you're comfortable with. A D gain where you don't have motors"}, {"start": 917.92, "end": 925.04, "text": "that are too hot. So really if your motors feel hot to the touch, I would say that's too hot. If your"}, {"start": 925.04, "end": 931.52, "text": "motors feel just slightly warm to the touch, that's fine. And make sure that you don't have any ticks"}, {"start": 931.52, "end": 936.3199999999999, "text": "or oscillations. And if both of those things are true and you're comfortable with the amount of D"}, {"start": 936.3199999999999, "end": 943.4399999999999, "text": "gain you have, you've found your perfect D gains. I'd like to take a minute to try and explain why I"}, {"start": 943.4399999999999, "end": 949.5999999999999, "text": "prefer to use the master slider and not the P and D gain slider when I'm starting out tuning a quad."}, {"start": 949.6, "end": 956.5600000000001, "text": "I think that for most five inch quads, the beta flight defaults have a really nice balance between"}, {"start": 956.5600000000001, "end": 964.8000000000001, "text": "the P, I and D terms. Using the master slider maintains that balance because all of the terms"}, {"start": 964.8000000000001, "end": 970.64, "text": "increase together, while it also increases the response to PID error, which is obviously what"}, {"start": 970.64, "end": 978.96, "text": "we're wanting to do. A really well tuned quad that follows setpoint closely and has iTerm Relax enabled,"}, {"start": 978.96, "end": 986.08, "text": "in my experience does not tend to suffer too badly with iTerm windup and associated overshooting."}, {"start": 987.28, "end": 994.24, "text": "I also really like the way high i gains keep the quad very stable at speed, and I don't feel I get that"}, {"start": 994.24, "end": 1002.48, "text": "same feel with the default level of i in beta flight. So on the AOS 5 for example with the master slider at"}, {"start": 1002.48, "end": 1008.96, "text": "2.0, I have twice as much i gain as the default and I really like the way that feels. I know this is quite"}, {"start": 1008.96, "end": 1014.96, "text": "a personal thing, so I'd love to hear your thoughts in the comments. What are your experiences? How much"}, {"start": 1014.96, "end": 1023.44, "text": "i gain do you typically like to run? Once you've found your perfect D gain, which is the maximum D gain"}, {"start": 1023.44, "end": 1029.1200000000001, "text": "that you as a pilot are comfortable with, the next step, step five, is to find your P to D balance."}, {"start": 1029.68, "end": 1035.3600000000001, "text": "The best way to do this is to look at logs using PID Toolbox. Don't worry if you've never used PID"}, {"start": 1035.3600000000001, "end": 1040.64, "text": "Toolbox before, I'm going to take you through it step by step. Before that you need to do some tuning"}, {"start": 1040.64, "end": 1046.88, "text": "flights with lots of full stick snap flips and rolls, and that's because that's what we're going to need"}, {"start": 1046.88, "end": 1052.88, "text": "to look at the step response. So let's look at an example step response here. Now this is the type of"}, {"start": 1052.88, "end": 1059.6000000000001, "text": "graph that we're going to see in PID Toolbox in a second. If your log looks like the green curve"}, {"start": 1059.6000000000001, "end": 1065.3600000000001, "text": "or the purple curve here that wiggle up and down for a while, that means you have too much P gain."}, {"start": 1066.16, "end": 1070.88, "text": "And to fix that you're going to want to decrease your P gain. And the easiest way to do that in my"}, {"start": 1070.88, "end": 1079.2800000000002, "text": "opinion is to use the sliders. You increase the PD balance by one or two notches, and you reduce the"}, {"start": 1079.28, "end": 1084.56, "text": "PD gain by the exact same amount. And that's important because you want your D gain to stay"}, {"start": 1084.56, "end": 1093.04, "text": "the same and your P gain to reduce. If however you have a log that looks more like this purple line"}, {"start": 1093.04, "end": 1100.96, "text": "here where it's kind of very slow to reach the center, then you're going to want to increase your"}, {"start": 1100.96, "end": 1107.76, "text": "P gain. And you do that by doing the opposite. So you reduce the PD balance by 0.1 or 0.2,"}, {"start": 1107.76, "end": 1116.64, "text": "one or two notches. And you increase your PD gain by the exact same amount. So 0.1 or 0.2. But it's got"}, {"start": 1116.64, "end": 1123.8400000000001, "text": "to be the exact same amount you reduce the PD balance by. And the goal in my opinion is the red line here."}, {"start": 1124.48, "end": 1130.9599999999998, "text": "You can see that there is just a tiny bit of overshoot, but there's no undershoot afterwards."}, {"start": 1130.9599999999998, "end": 1136.1599999999999, "text": "That's the key. You see that brown line, it has an overshoot and then an undershoot. That's bad."}, {"start": 1136.1599999999999, "end": 1142.0, "text": "We don't really want that. But that red line that just has a tiny overshoot, but gets up to the line"}, {"start": 1142.0, "end": 1147.12, "text": "as quickly as possible is exactly what we want. So that red line is what it should look like."}, {"start": 1147.12, "end": 1155.52, "text": "I'm going to use this platform to make a request of the Betaflight developers now. I know Mark Spatz,"}, {"start": 1155.52, "end": 1163.1999999999998, "text": "UAV tech has made the same request. Please change the way the PD balance slider in Betaflight works."}, {"start": 1164.3999999999999, "end": 1170.9599999999998, "text": "The goal with the tune is to keep D gain the same because you found your maximum D gain by now,"}, {"start": 1170.9599999999998, "end": 1174.32, "text": "and just change your P gain to get a critically damped response."}, {"start": 1175.2, "end": 1181.2, "text": "To do this with the sliders currently, you need to move the PD balance and P and D gain in opposite"}, {"start": 1181.2, "end": 1189.76, "text": "directions by the exact same amount. If the PD balance slider was adjusted so that it altered the"}, {"start": 1189.76, "end": 1195.9199999999998, "text": "P gain rather than the D gain, you would only have one slider to move and it would be much simpler."}, {"start": 1195.9199999999998, "end": 1200.96, "text": "So Betaflight devs, if you're listening, please, please, please change the PD balance slider"}, {"start": 1200.96, "end": 1206.24, "text": "to adjust P gain only and not D gain. Thanks very much."}, {"start": 1208.88, "end": 1215.8400000000001, "text": "Okay, now the next sections of this video all require you to have black box logging enabled on"}, {"start": 1215.8400000000001, "end": 1222.48, "text": "your quad. Now I know that not everyone has black box logging on their quad because maybe they're flying"}, {"start": 1222.48, "end": 1229.76, "text": "an all-in-one board or something that doesn't have black box logging. If you do not have logging on your"}, {"start": 1229.76, "end": 1237.6, "text": "quad, you can still tune PD balance, which is what we're going to do next, by listening to the quad."}, {"start": 1237.6, "end": 1247.12, "text": "But this can be quite tricky. What you're listening for is the motor zipping at the start and end of a"}, {"start": 1247.12, "end": 1256.6399999999999, "text": "snap flip or roll. So if everything is going well, when you do a snap roll, you'll hear zip, zip,"}, {"start": 1257.2, "end": 1262.5600000000002, "text": "and that first zip will be at the start of the move, and the second zip will be at the end of the move."}, {"start": 1263.68, "end": 1270.8000000000002, "text": "Now decrease the PD balance by one tick and increase the PD gain by one tick and try again."}, {"start": 1271.44, "end": 1280.4, "text": "Again, listen to the start and the end of the roll or flip. You should again hear zip, zip, two zips,"}, {"start": 1280.4, "end": 1286.48, "text": "one at the start of the move, one at the end of the move. Now if you keep going, if you keep decreasing"}, {"start": 1286.48, "end": 1293.68, "text": "your PD balance and increasing your PD gain, eventually you will start to hear a double zip"}, {"start": 1294.32, "end": 1301.52, "text": "at the start or more likely the end of the move. So you might hear something like this, zip, zip, zip."}, {"start": 1302.8, "end": 1309.2, "text": "If you hear a double zip at the end of the move, that means that you've started to get bounce back"}, {"start": 1309.2, "end": 1316.32, "text": "overshoot. So you need to go back one. So what you want is to get to the lowest"}, {"start": 1316.32, "end": 1324.08, "text": "PD balance and highest PD gain, obviously moving them together, before you hear a double zip"}, {"start": 1324.8, "end": 1330.96, "text": "at the end of a move or the start of a move. Hopefully that's clear. If you've got any questions,"}, {"start": 1330.96, "end": 1340.72, "text": "please ask them in the comments. Once you've done that, set your stick response gain slider equal to your"}, {"start": 1340.72, "end": 1346.64, "text": "master multiplier that you found in the previous step. That should get you most of the way to a"}, {"start": 1346.64, "end": 1352.88, "text": "great tune. If you want to go all the way, you'll need logging and I'll put links to some inexpensive"}, {"start": 1352.88, "end": 1361.76, "text": "flight controllers with logging in the video description. So let's get set up with PID Toolbox."}, {"start": 1361.76, "end": 1367.1200000000001, "text": "If you follow the link in the video description, you'll end up here on the PID Toolbox releases page"}, {"start": 1367.12, "end": 1374.4799999999998, "text": "in GitHub. You can see that the latest version at the time of this video is 0.42. If you scroll down,"}, {"start": 1374.4799999999998, "end": 1382.1599999999999, "text": "you'll see the various files here. You want the underscore win.zip if you're running Windows like"}, {"start": 1382.1599999999999, "end": 1390.9599999999998, "text": "I am. So download this folder here. See that's downloading. If we look at the folder, we can see"}, {"start": 1390.96, "end": 1398.88, "text": "that it's a zip folder. So we extract that with any tool and you can see that inside that extracted"}, {"start": 1398.88, "end": 1405.2, "text": "folder are two other folders. If this is the first time that you're running PID Toolbox, you will need"}, {"start": 1405.2, "end": 1410.64, "text": "to install the runtime. So let's go into the runtime installation file. You'll see there's just one"}, {"start": 1410.64, "end": 1417.28, "text": "file in here. Double click that, go through the installation process and then once that's finished,"}, {"start": 1417.28, "end": 1425.84, "text": "you can come out of that folder, go into the main folder. Now you'll see that there's a file called"}, {"start": 1425.84, "end": 1434.72, "text": "blackbox decode. Now this is the file that's needed to allow PID Toolbox to understand your blackbox log."}, {"start": 1435.36, "end": 1442.32, "text": "So what we need to do here is select that, copy it, control c, come out of the folder again,"}, {"start": 1442.32, "end": 1450.32, "text": "go into our logs folder, mine is here, and just paste the blackbox decode in there."}, {"start": 1451.2, "end": 1456.8799999999999, "text": "Obviously I've done that before so I replace, but that's the file that you need in order to decode"}, {"start": 1456.8799999999999, "end": 1463.28, "text": "the logs and it needs to be in the folder where your log files are. Okay, so it needs to be pasted in"}, {"start": 1463.28, "end": 1469.6, "text": "with all your logs as I've done here. Once you've done that, you can come out of your logs folder and go"}, {"start": 1469.6, "end": 1478.32, "text": "back into the PID Toolbox main folder and run PID Toolbox. That will open this window here,"}, {"start": 1478.9599999999998, "end": 1484.32, "text": "a kind of blank window. If you go over onto the right hand side, there's a green select button."}, {"start": 1484.32, "end": 1493.28, "text": "So we click that and now we select the log file. So I'm just going to select this master 200 log here."}, {"start": 1493.28, "end": 1502.0, "text": "I click OK. And if everything works, you should see some converting and importing status messages pop"}, {"start": 1502.0, "end": 1509.52, "text": "up and that will load in. Once that's loaded in, you should be able to see the log there on the screen."}, {"start": 1510.8799999999999, "end": 1516.48, "text": "What we're going to be using for the next part of this video is the Step Response Tool. So that's"}, {"start": 1516.48, "end": 1523.2, "text": "again over on the right hand side. Click that blue button Step Response Tool. That opens this new blank"}, {"start": 1523.2, "end": 1529.84, "text": "window and just click the green run button. And that will produce the step response functions for that"}, {"start": 1529.84, "end": 1536.88, "text": "log. And that's where we're going to see if we have an underdamped, overdamped or critically damped system."}, {"start": 1538.8, "end": 1545.52, "text": "Okay, so now you've seen exactly how to get a step response graph for your own log. Here's one that I did"}, {"start": 1545.52, "end": 1552.8, "text": "on the AOS 5. Now this is on the Betaflight default PD balance and all I've done in this log is turn the"}, {"start": 1552.8, "end": 1562.08, "text": "master slider up to 2.0. And you can see that the step response is pretty much perfect on roll and pitch."}, {"start": 1562.08, "end": 1567.04, "text": "I'm very happy with these. I'm not going to change the PD balance at all from the Betaflight defaults"}, {"start": 1567.04, "end": 1573.44, "text": "on this build. It looks great. And you can see that your as well is a nice straight step up and then a"}, {"start": 1573.44, "end": 1579.8400000000001, "text": "flat line. So overall very happy with all three of these. And if your step response graphs look like"}, {"start": 1579.8400000000001, "end": 1585.1200000000001, "text": "this, then you're done. You don't need to make any adjustments to your PD balance at all."}, {"start": 1588.3200000000002, "end": 1593.52, "text": "Now that we have our PIDs pretty much locked in, the next step, step six, is tuning feed forward."}, {"start": 1594.64, "end": 1600.48, "text": "The first thing to do is to check that feed forward transition equals zero. Once that's been set,"}, {"start": 1600.48, "end": 1607.2, "text": "do a tuning flight with lots of full stick snap rolls and snap flips. We also need to install"}, {"start": 1607.2, "end": 1613.28, "text": "UAV text trace templates and open the log in Blackbox Explorer and look at the flips and rolls"}, {"start": 1613.28, "end": 1617.28, "text": "that we've done. Don't worry if you've never done this before. I'm going to take you through it again"}, {"start": 1617.28, "end": 1624.88, "text": "step by step. Okay, so let's get set up with Blackbox Explorer so that we can check our set point"}, {"start": 1624.88, "end": 1630.96, "text": "tracking from our logs. The first thing you'll need is Blackbox Explorer. So if you follow the link in"}, {"start": 1630.96, "end": 1636.88, "text": "the video description, you'll end up here to the releases page of the Blackbox Log Viewer, latest version"}, {"start": 1636.88, "end": 1646.48, "text": "3.5 as of this video. You need the underscore win32 version .exe. You're on Windows, so just click that and"}, {"start": 1646.48, "end": 1652.88, "text": "download it. And once it's downloaded, run that file and it will install Blackbox Explorer for you."}, {"start": 1653.92, "end": 1660.56, "text": "Once that's done, open Blackbox Explorer. And if you see this page when you open it, then you know that"}, {"start": 1660.56, "end": 1665.68, "text": "you've done the right thing and that everything's installed correctly. The next thing you need is"}, {"start": 1665.68, "end": 1671.92, "text": "UAV text Blackbox Explorer trace templates. So again, if you follow the link in the video description for"}, {"start": 1671.92, "end": 1678.16, "text": "the trace template, it'll take you to here. You can see that there are a few different versions. We want"}, {"start": 1678.16, "end": 1685.3600000000001, "text": "3.5 version because that's the version of Blackbox Explorer that we have. So right click on that and"}, {"start": 1685.3600000000001, "end": 1693.28, "text": "download and that will download it. Then what we're going to do is we're going to open in Blackbox Explorer,"}, {"start": 1695.1200000000001, "end": 1701.28, "text": "go into the folder where we downloaded the trace template and simply select the trace template as a"}, {"start": 1701.28, "end": 1706.96, "text": "file that we want to open. And it will tell us that workspaces have been loaded and that's perfect."}, {"start": 1708.72, "end": 1715.36, "text": "Then the next thing to do is to go into our logs folder. Again, just trying to open a log. Select a"}, {"start": 1715.36, "end": 1723.28, "text": "log in this case. I'm going to open master 200. Let's open and you can see that that's opened there and"}, {"start": 1723.28, "end": 1729.36, "text": "the log is, that whole log is here. Now, if we're wanting to look at stick tracking, we need to use a"}, {"start": 1729.36, "end": 1738.56, "text": "particular trace template. So go up here to workspace and select number four, stick tracking. So that's"}, {"start": 1738.56, "end": 1746.4799999999998, "text": "good. The next thing you'll want to do is turn off Expo in the display. So we go down here to Expo on"}, {"start": 1746.4799999999998, "end": 1756.4799999999998, "text": "off and turn it off. And that is all there is to it. Now you can scroll through the log to your heart's"}, {"start": 1756.48, "end": 1764.56, "text": "content and find the information that you want to look at. So here's, for example, a sharp roll one"}, {"start": 1764.56, "end": 1769.92, "text": "way and then the other. And I'm sure a little further on I've done something similar on pitch."}, {"start": 1770.56, "end": 1773.2, "text": "Yeah, sharp pitch move forward and back."}, {"start": 1776.0, "end": 1780.0, "text": "And a full throttle punch out. You can see the motors go up. So if you're seeing all of this,"}, {"start": 1780.0, "end": 1784.96, "text": "that means you have everything correctly configured. And now you can look at your stick tracking and let's"}, {"start": 1784.96, "end": 1789.76, "text": "see what you should be looking for in your stick tracking to show that you have a good tune for"}, {"start": 1789.76, "end": 1798.8, "text": "your feed forward. So now that you've got your traces open in Black Box Explorer, the next step is to"}, {"start": 1798.8, "end": 1804.88, "text": "show you what too little feed forward looks like. So you're probably going to start off with too little"}, {"start": 1804.88, "end": 1811.28, "text": "feed forward because the beta flight defaults are quite conservative. If you have too little feed forward,"}, {"start": 1811.28, "end": 1817.6, "text": "you'll see that the gyro line, which is this bluish purplish line here,"}, {"start": 1818.8, "end": 1824.16, "text": "lags behind the green line, which is a set point. And you can see it lags behind by quite a lot."}, {"start": 1826.48, "end": 1834.16, "text": "It's always behind. And that's because we don't have enough feed forward. You'll also see if you look"}, {"start": 1834.16, "end": 1841.52, "text": "at the motors that the motors aren't really working that hard. They never really get up to 100% throttle."}, {"start": 1841.52, "end": 1847.52, "text": "And so that means that the quad is kind of being lazy. It knows that it's not doing what you've told"}, {"start": 1847.52, "end": 1853.3600000000001, "text": "it to do because that blue line isn't on top of the green line, but it's not doing anything about it."}, {"start": 1853.3600000000001, "end": 1860.4, "text": "It's just kind of lazing around with the motors at a modest amount of load. So that's what we need to fix."}, {"start": 1860.4, "end": 1869.3600000000001, "text": "Now you might be tempted just to crank feed forward all the way up. If you do that, you might end up"}, {"start": 1869.3600000000001, "end": 1874.5600000000002, "text": "with too much feed forward. And it's really important to know what too much feed forward looks like."}, {"start": 1875.76, "end": 1881.1200000000001, "text": "If we look at the start of this roll, you can see that everything looks really good. I mean, the gyro is"}, {"start": 1881.1200000000001, "end": 1887.1200000000001, "text": "right on top of the set point the whole way and everything looks great. But if we now look at the"}, {"start": 1887.12, "end": 1895.12, "text": "end of the roll, do you see how the gyro trace suddenly dips way below set point just here?"}, {"start": 1896.8, "end": 1905.52, "text": "That is because feed forward is too high and the quad is actually overshooting the end of the move."}, {"start": 1907.76, "end": 1911.1999999999998, "text": "The other thing you'll notice is that now that we've got loads more feed forward,"}, {"start": 1911.2, "end": 1918.24, "text": "we've actually got motor saturation. So we're hitting 100% on the motor power for one motor."}, {"start": 1918.24, "end": 1923.8400000000001, "text": "So the quad is working as hard as it possibly can to track set point. And you can see that the,"}, {"start": 1924.88, "end": 1928.88, "text": "even though the gyro is lagging behind the set point in this part of the move here,"}, {"start": 1929.92, "end": 1935.2, "text": "there's nothing we can do about that because a motor has reached 100%, it's saturated and there's"}, {"start": 1935.2, "end": 1941.44, "text": "nothing more to do. So if you have that situation where gyro and set point aren't on top of each"}, {"start": 1941.44, "end": 1946.8, "text": "other, but you have a motor at 100%, then there's nothing more you can do, I'm afraid. That's as good"}, {"start": 1946.8, "end": 1954.24, "text": "as it's going to get. Finally, let's look at what I settled on for my final feed forward value for the"}, {"start": 1954.24, "end": 1961.6000000000001, "text": "AOS 5. This is what I think is about the right amount of feed forward. So you'll notice that, you know,"}, {"start": 1961.6, "end": 1967.36, "text": "we're not quite tracking set point perfectly at the start of the move. There's possibly some more"}, {"start": 1967.36, "end": 1973.84, "text": "that I can do there to be fair. But for this rough tune, it's absolutely fine. And at the end of the"}, {"start": 1973.84, "end": 1981.52, "text": "move, there's no overshooting. You can see that the gyro doesn't really overshoot like it did in the"}, {"start": 1981.52, "end": 1988.56, "text": "last slide. So that's good too. There is just the hint of an overshoot here, which tells me that I can't"}, {"start": 1988.56, "end": 1994.48, "text": "increase feed forward anymore. Notice that we're still hitting motor saturation at the end of the"}, {"start": 1994.48, "end": 2002.1599999999999, "text": "move here. So there is enough feed forward to saturate the motors and have the quad working as"}, {"start": 2002.1599999999999, "end": 2006.96, "text": "hard as it can to stay on set point. And that's really what we want to see. We want to see that"}, {"start": 2006.96, "end": 2014.08, "text": "we have enough feed forward to make the motors max out on sharp moves. And then we know that we can do"}, {"start": 2014.08, "end": 2019.6799999999998, "text": "no more. The motors are doing all they can. If the quad can't track set point, that's just a"}, {"start": 2019.6799999999998, "end": 2027.36, "text": "mechanical limitation of the motors, the props, all of that kind of stuff. And we've done all we can"}, {"start": 2027.36, "end": 2034.08, "text": "in the PID controller. I hope you found this video interesting. You'll have noticed that we didn't make"}, {"start": 2034.08, "end": 2040.24, "text": "it to the end of my tuning process in this video. And that's because I have follow-up videos planned on"}, {"start": 2040.24, "end": 2046.32, "text": "how to tune your rates and how to fine tune your PIDs for the ultimate in flight performance."}, {"start": 2046.32, "end": 2051.68, "text": "Make sure you're subscribed so you don't miss those videos when they're ready. If you like the work that"}, {"start": 2051.68, "end": 2058.16, "text": "I'm doing, please consider joining my Patreon. For less than $5 a month, you can get early access to the"}, {"start": 2058.16, "end": 2063.2, "text": "designs that I'm working on and have an opportunity to give feedback to make them even better."}, {"start": 2063.2, "end": 2070.64, "text": "If you'd like the best possible platform to start your filter and PID tune from, please consider"}, {"start": 2070.64, "end": 2075.2799999999997, "text": "checking out my frame, the AOS 5. I'll put a link for that down in the video description as well."}, {"start": 2075.2799999999997, "end": 2081.2, "text": "It's been designed from the ground up to give the absolute best possible vibration and resonance"}, {"start": 2081.2, "end": 2086.16, "text": "performance. And that's going to allow you to push your filters and PIDs further than ever before."}, {"start": 2087.2, "end": 2092.48, "text": "That's all I have for you for today. So until next time, all that remains is for me to wish you all"}, {"start": 2092.48, "end": 2094.48, "text": "very, very happy flying."}]}