{"video_id": "XRsJRqipSx8", "url": "https://www.youtube.com/watch?v=XRsJRqipSx8", "title": "XRsJRqipSx8", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.56, "end": 6.36, "text": "Hi, this is János, it's RealWorld Audio, and we are back on track with the amplifier"}, {"start": 6.36, "end": 12.88, "text": "loudspeaker matching series about that."}, {"start": 12.88, "end": 21.88, "text": "So basically Zoe Nagy asked a question about Zobell networks, is that can we fix the impedance"}, {"start": 21.88, "end": 32.0, "text": "issues with Zobell networks and the impedance issues of loudspeakers, because on my previous"}, {"start": 32.0, "end": 39.56, "text": "videos in this series I told mostly about impedance problems that when you have with"}, {"start": 39.56, "end": 43.9, "text": "loudspeakers and can they be fixed with Zobells."}, {"start": 43.9, "end": 47.9, "text": "So the response for that is some of it can be fixed."}, {"start": 47.9, "end": 53.9, "text": "And how is that, so just let me see, does it want to change?"}, {"start": 53.9, "end": 63.62, "text": "Let me see, yes, it didn't want to change, but it did after all."}, {"start": 63.62, "end": 70.7, "text": "So basically this is just, this is not my thing, it's WaveCore's website, and just googled it"}, {"start": 70.7, "end": 75.48, "text": "up and found something that I can use to share with you."}, {"start": 75.48, "end": 79.30000000000001, "text": "And they have a nice figures and drawings."}, {"start": 79.30000000000001, "end": 82.94, "text": "So basically this is how a Zobell network looks like."}, {"start": 82.94, "end": 91.48, "text": "You have here the driver, your tweeter, or a full range driver, and you add in parallel with"}, {"start": 91.48, "end": 96.80000000000001, "text": "your driver, resistor and a capacitor combination."}, {"start": 96.8, "end": 106.14, "text": "And what it does is that it neutralizes the effect of the Voyeur's coil's self-inductance."}, {"start": 106.14, "end": 110.36, "text": "Or actually that's what we want to approximate."}, {"start": 110.36, "end": 117.64, "text": "It doesn't actually neutralize that effect, but it is similar, it is complementary to that,"}, {"start": 117.64, "end": 121.2, "text": "and that's the net effect that you are seeing."}, {"start": 121.2, "end": 127.2, "text": "So when you look at the impedance here of the tweeter or full range driver, it looks like"}, {"start": 127.2, "end": 128.58, "text": "this."}, {"start": 128.58, "end": 131.1, "text": "It has a self-resonant frequency."}, {"start": 131.1, "end": 134.5, "text": "And below that the impedance drops down."}, {"start": 134.5, "end": 136.92000000000002, "text": "And above that the impedance drops down."}, {"start": 136.92000000000002, "end": 143.72, "text": "And where it drops here, that's the impedance minima of the driver."}, {"start": 143.72, "end": 151.78, "text": "And if you divide that by 0.8, then you get the nominal impedance of the loudspeaker that's"}, {"start": 151.78, "end": 154.32, "text": "using this driver."}, {"start": 154.32, "end": 161.72, "text": "And you see that minima, where it is, that's where your driver is happiest working at, and"}, {"start": 161.72, "end": 166.04, "text": "the least problem-free in operation."}, {"start": 166.04, "end": 174.1, "text": "And then the impedance starts to rise because of the self-inductance of the voice coil."}, {"start": 174.1, "end": 180.1, "text": "And as it starts to rise, after a while we are going to get into issues."}, {"start": 180.1, "end": 186.42, "text": "And at the far end the issues will start to get dominated by the inductance of the voice"}, {"start": 186.42, "end": 192.42, "text": "coil, which will ultimately limit the high frequency extension of the driver."}, {"start": 192.42, "end": 202.66, "text": "But before that the problems will start occurring because the wavelength of the sound that the"}, {"start": 202.66, "end": 209.83999999999997, "text": "driver needs to produce is getting too short for the size of the driver to handle."}, {"start": 209.83999999999997, "end": 217.89999999999998, "text": "So those two things are the ones that will ultimately limit the high frequency extension of your driver."}, {"start": 217.9, "end": 223.16, "text": "And there's like a plenty of other things going on in the background, like motor strength,"}, {"start": 223.16, "end": 227.0, "text": "if it's not strong enough it cannot produce a clean detail."}, {"start": 227.0, "end": 235.38, "text": "But what is the distortion of the, or the handling of the membrane of your driver, that's a completely"}, {"start": 235.38, "end": 241.42000000000002, "text": "different question regards to the impedance of it."}, {"start": 241.42, "end": 246.54, "text": "So that's a different tail for a different day."}, {"start": 246.54, "end": 250.57999999999998, "text": "So if we put in a Zobell network, that will create something like this."}, {"start": 250.57999999999998, "end": 255.14, "text": "It won't create a perfect fat line, but it will flatten it out."}, {"start": 255.14, "end": 261.68, "text": "And even if you just don't get this harsh rise, it will be nicer."}, {"start": 261.68, "end": 266.41999999999996, "text": "However, is that solution a universal band-aid?"}, {"start": 266.42, "end": 268.84000000000003, "text": "No, it's not."}, {"start": 268.84000000000003, "end": 276.18, "text": "In the case of an unruly tweeter, so if you have a tweeter that gets really harsh and annoying,"}, {"start": 276.18, "end": 284.34000000000003, "text": "or if you get a full range driver speaker and it has really annoying, harsh top end, then"}, {"start": 284.34000000000003, "end": 290.0, "text": "using a Zobell is probably your second best bet to improve it."}, {"start": 290.0, "end": 295.92, "text": "I would say the first best bet is to use a high quality driver."}, {"start": 295.92, "end": 302.58, "text": "If you can't do that, then you have something that has issues."}, {"start": 302.58, "end": 307.46, "text": "In that case, just try to use it with a high quality amplifier."}, {"start": 307.46, "end": 313.0, "text": "And when you don't have that, so you have a mid-low quality driver with a mid-low quality"}, {"start": 313.0, "end": 314.68, "text": "amplifier."}, {"start": 314.68, "end": 322.3, "text": "That's when you really need the Zobell network, because the drivers by themselves usually are"}, {"start": 322.3, "end": 324.56, "text": "not that bad."}, {"start": 324.56, "end": 334.0, "text": "What makes them sound truly bad and awful and just is the fact that they are driven by compromised"}, {"start": 334.0, "end": 335.22, "text": "amplifier."}, {"start": 335.22, "end": 342.28000000000003, "text": "That's where your problems begin."}, {"start": 342.28000000000003, "end": 352.58000000000004, "text": "And when you put a Zobell network there, it not only makes your driver smoother, but it"}, {"start": 352.58000000000004, "end": 359.94000000000005, "text": "kills off a lot of the harsh distortion coming from your power amplifier."}, {"start": 359.94, "end": 366.21999999999997, "text": "So when you read the comments on my channel, Frank is commenting several times on the hard"}, {"start": 366.21999999999997, "end": 367.8, "text": "distortion."}, {"start": 367.8, "end": 370.28, "text": "In French it's the distortion due."}, {"start": 370.28, "end": 380.24, "text": "So it's like a form of distortion that is perceived as a harsh distortion to the human ear."}, {"start": 380.24, "end": 391.06, "text": "And it's particularly nasty in the high end and just messes up the frequencies beyond 10 kilohertz"}, {"start": 391.06, "end": 392.2, "text": "pretty badly."}, {"start": 392.2, "end": 399.2, "text": "So when you add the Zobell network and you have a mid-level, mid-to-low level solid state amplifier,"}, {"start": 399.2, "end": 402.08, "text": "that will do really wonders."}, {"start": 402.08, "end": 408.41999999999996, "text": "And even if you have a higher level solid state amplifier, a very high quality Zobell will be"}, {"start": 408.41999999999996, "end": 410.65999999999997, "text": "your friend."}, {"start": 410.65999999999997, "end": 417.91999999999996, "text": "And I think Gabor, he has mentioned, he has commented that he is making high quality Zobells"}, {"start": 417.91999999999996, "end": 422.53999999999996, "text": "and helping people to install them on their speakers."}, {"start": 422.53999999999996, "end": 425.97999999999996, "text": "And everyone is super happy with them."}, {"start": 425.98, "end": 434.28000000000003, "text": "And that's another application note for Zobell networks is that if you have a low level loudspeaker,"}, {"start": 434.28000000000003, "end": 442.1, "text": "low level amplification like an LM chip driven amplifier that you built or you bought for very"}, {"start": 442.1, "end": 449.22, "text": "cheap, then it's going to have a lot of hard distortion."}, {"start": 449.22, "end": 452.02000000000004, "text": "And that hard distortion is the one that you perceive."}, {"start": 452.02000000000004, "end": 453.82, "text": "That happens with real music."}, {"start": 453.82, "end": 459.06, "text": "You can measure that same device with your oscilloscope and just a plain sine wave."}, {"start": 459.06, "end": 462.2, "text": "And it is, yeah, it measures perfectly the sine wave."}, {"start": 462.2, "end": 470.0, "text": "It's like measuring a car pilot, a student driver, drive on the test field."}, {"start": 470.0, "end": 474.38, "text": "And yeah, he's great, you know, he could turn right, he could turn left."}, {"start": 474.38, "end": 477.38, "text": "Then the instructor asked him to brake, yeah, he brake."}, {"start": 477.38, "end": 482.62, "text": "He could shift up to gear two, back from gear two to gear one."}, {"start": 482.62, "end": 483.62, "text": "Yeah, amazing."}, {"start": 483.62, "end": 488.76, "text": "But that's very different from driving in heavy traffic."}, {"start": 488.76, "end": 493.62, "text": "The two have, as the student, when you are a student driver and you know that you, you"}, {"start": 493.62, "end": 496.62, "text": "ace the driving course."}, {"start": 496.62, "end": 501.86, "text": "And then you go out into heavy traffic on a highway or in a city, that's two completely"}, {"start": 501.86, "end": 503.86, "text": "different things."}, {"start": 503.86, "end": 508.86, "text": "And even though you felt comfortable, like, you know, like just taking, swerving left and"}, {"start": 508.86, "end": 509.86, "text": "right."}, {"start": 509.86, "end": 513.86, "text": "But out there it's like, man, it's like, I'm going to survive it."}, {"start": 513.86, "end": 515.86, "text": "That's your first thought."}, {"start": 515.86, "end": 518.98, "text": "And you will be just a klutz out there."}, {"start": 518.98, "end": 523.0, "text": "And what you need to do is have like 10 years of driving experience."}, {"start": 523.0, "end": 528.14, "text": "And then you can be on the phone, eat your sandwich, maybe shave at the same time, and"}, {"start": 528.14, "end": 531.22, "text": "it's still fine, no problem."}, {"start": 531.22, "end": 535.96, "text": "But what they will measure you is like how you drive on the test course."}, {"start": 535.96, "end": 538.58, "text": "And that's what the audio measurements do."}, {"start": 538.58, "end": 546.64, "text": "And there the amp is not taxed, it's asked to perform basic tasks."}, {"start": 546.64, "end": 555.7, "text": "And when we ask amplifiers to perform basic tasks into a resistor load, not into a loudspeaker,"}, {"start": 555.7, "end": 562.08, "text": "into a resistor load, then the solid state amplifiers are doing a phenomenal job."}, {"start": 562.08, "end": 568.5600000000001, "text": "But when they are asked to drive a true loudspeaker, not a resistor, and use true music, then they"}, {"start": 568.56, "end": 580.4599999999999, "text": "fare much poorer compared to driving the test course of that resistor with a sine wave."}, {"start": 580.4599999999999, "end": 586.8399999999999, "text": "And the tube topology, and I'm not just saying tube topology, but no negative feedback, short"}, {"start": 586.8399999999999, "end": 593.6999999999999, "text": "path, single-ended topology, the strength of it is driving the real thing."}, {"start": 593.7, "end": 599.1, "text": "And when you ask them to drive a test course, they are not that good on that."}, {"start": 599.1, "end": 605.6, "text": "And you expect them that because they are mediocre on the test course, in the real life they will"}, {"start": 605.6, "end": 606.6, "text": "just totally suck."}, {"start": 606.6, "end": 610.74, "text": "But no, it's quite the other way around."}, {"start": 610.74, "end": 617.1800000000001, "text": "And the fact that you look like how much power an amplifier can put into a resistor, and how"}, {"start": 617.18, "end": 621.3199999999999, "text": "much power can it put into a real life loudspeaker?"}, {"start": 621.3199999999999, "end": 628.78, "text": "When you look at solid state amplifiers, they can put out less power into a loudspeaker compared"}, {"start": 628.78, "end": 631.68, "text": "to what they can put out into a resistor."}, {"start": 631.68, "end": 638.28, "text": "So when you read that your amplifier can put out 1000 watts into 2 ohms, that amplifier can"}, {"start": 638.28, "end": 642.28, "text": "put out 1000 watts into a 2 ohms resistor."}, {"start": 642.28, "end": 646.22, "text": "So when you look at the 2 ohms loudspeaker load, it can put out less."}, {"start": 646.22, "end": 655.68, "text": "And when you read that an amp tube amplifier can put out 8 watts into an 8 ohms load, then"}, {"start": 655.68, "end": 660.16, "text": "how much can it put out into a real loudspeaker?"}, {"start": 660.16, "end": 664.9599999999999, "text": "Well, very few people have done experimentation on that."}, {"start": 664.9599999999999, "end": 666.12, "text": "AudioNote was one of them."}, {"start": 666.12, "end": 668.86, "text": "They have a white paper on their website."}, {"start": 668.86, "end": 674.04, "text": "And they used one of their amplifiers driving one of their speakers, and they examined three"}, {"start": 674.04, "end": 675.36, "text": "different amplifiers."}, {"start": 675.36, "end": 682.26, "text": "They used one of their single-handed amps, tube amps with 300b amp."}, {"start": 682.26, "end": 686.36, "text": "They used a push-pull tube amplifier, and they used a solid state amplifier."}, {"start": 686.36, "end": 689.48, "text": "And they compared these three very different topologies."}, {"start": 689.48, "end": 696.7, "text": "And they noticed that the solid state amplifier put out less than the rated wattage."}, {"start": 696.7, "end": 706.16, "text": "The push-pull amplifier put out several times the rated wattage into that real loudspeaker."}, {"start": 706.16, "end": 710.54, "text": "And they put out 300b amp."}, {"start": 710.54, "end": 714.12, "text": "Sorry, 8 watts into that 8 ohms resistor."}, {"start": 714.12, "end": 718.16, "text": "Into their loudspeaker put out 80 watts."}, {"start": 718.16, "end": 721.8399999999999, "text": "10 times the power that it was rated at."}, {"start": 721.8399999999999, "end": 729.16, "text": "So that's why it's very critical that when you are looking at measurements and ratings,"}, {"start": 729.16, "end": 736.66, "text": "you make it clear in your mind that what you lead in the data sheets, in the measurements,"}, {"start": 736.66, "end": 743.88, "text": "how speakers are specified, they're specified with resistors as load, which has absolutely"}, {"start": 743.88, "end": 746.0, "text": "nothing to do with real life."}, {"start": 746.0, "end": 747.98, "text": "But anyway, I digress."}, {"start": 747.98, "end": 753.64, "text": "So now let's return back to the subject on hand, the Zobell networks."}, {"start": 753.64, "end": 759.1999999999999, "text": "So that's why a Zobell network can be your friend, because even though the measurement"}, {"start": 759.1999999999999, "end": 767.46, "text": "didn't of a resistor, of a sine wave, didn't tell you anything what your amplifier would"}, {"start": 767.46, "end": 776.6, "text": "do with a loudspeaker with music, but your hearing will confirm you that your Zobell network"}, {"start": 776.6, "end": 781.4399999999999, "text": "is absolutely necessary to clean up the highs."}, {"start": 781.44, "end": 789.32, "text": "And the problem that it fixes in most cases is not the problem of the rise of the impedance"}, {"start": 789.32, "end": 794.1600000000001, "text": "of the voice coil."}, {"start": 794.1600000000001, "end": 803.7600000000001, "text": "Because the rise of the impedance will do its phase shift and will incur a loss of information."}, {"start": 803.7600000000001, "end": 808.94, "text": "And that loss of information you cannot undo by adding a capacitor resistor network."}, {"start": 808.94, "end": 816.82, "text": "It's just going to lose additional bits of information, but in an opposite phase."}, {"start": 816.82, "end": 826.44, "text": "So the distortion of the two, the kind of distortion, what they do to the sound, they will cancel out"}, {"start": 826.44, "end": 828.32, "text": "each other."}, {"start": 828.32, "end": 834.62, "text": "But the information loss by one and the information loss by the other won't be cancelled out."}, {"start": 834.62, "end": 844.5, "text": "So you will have even greater level of information loss when you have the Zobell in place."}, {"start": 844.5, "end": 853.18, "text": "However, because you have cleaned up so much of the hard distortion of your amplifier's output,"}, {"start": 853.18, "end": 861.06, "text": "in most cases you will experience this as a revelation."}, {"start": 861.06, "end": 870.06, "text": "Because most of that hard distortion is gone and you are able to hear high frequencies coming out from your loudspeaker."}, {"start": 870.06, "end": 872.9399999999999, "text": "Which before you have not heard."}, {"start": 872.9399999999999, "end": 885.9399999999999, "text": "Because the hard distortion of your source, of your amplifier was masquerading, was masking the highest frequencies with distortion content."}, {"start": 885.94, "end": 893.82, "text": "And when I listen to lower level gear, and when you listen to them, and it seems, wow, this sounds really extended in the highs."}, {"start": 893.82, "end": 899.32, "text": "But when you listen to it, that's not natural, that's not part of the music."}, {"start": 899.32, "end": 904.32, "text": "It's the distortion of the amplifier masquerading as high-end."}, {"start": 904.32, "end": 909.0400000000001, "text": "And when you put on a Zoba, that distortion is cut."}, {"start": 909.0400000000001, "end": 916.4000000000001, "text": "But you also notice that the highs, they don't extend anymore that much."}, {"start": 916.4000000000001, "end": 920.9200000000001, "text": "And that's because it's cutting from the information content."}, {"start": 920.9200000000001, "end": 927.2600000000001, "text": "So let's try it, if my computer will let me go back to the PowerPoint."}, {"start": 927.2600000000001, "end": 928.2600000000001, "text": "Where are you?"}, {"start": 928.2600000000001, "end": 929.2600000000001, "text": "Here."}, {"start": 929.26, "end": 931.72, "text": "Okay, so let's try to..."}, {"start": 931.72, "end": 933.66, "text": "Yes, so here we are."}, {"start": 933.66, "end": 938.14, "text": "So let's say in the case, we take this loudspeaker and we put a Zobel on it."}, {"start": 938.14, "end": 946.76, "text": "What it will do is, it will start to cut this part of the frequency range, the highest frequencies."}, {"start": 946.76, "end": 951.84, "text": "And as you see, this is a Bauer-Wilkins 805D3."}, {"start": 951.84, "end": 956.34, "text": "And it has a big peak at 10 kilohertz."}, {"start": 956.34, "end": 962.48, "text": "So if we would put a Zobel on, then that would tame that 10 kilohertz region."}, {"start": 962.48, "end": 965.86, "text": "So it wouldn't sound as harsh."}, {"start": 965.86, "end": 970.34, "text": "And of course, if it has that 10 kilohertz region, it's not just the speaker sounding"}, {"start": 970.34, "end": 971.34, "text": "harsh."}, {"start": 971.34, "end": 976.5600000000001, "text": "But if your amplifier has hard distortion at 10 kilohertz, it will be extremely painful,"}, {"start": 976.56, "end": 984.4399999999999, "text": "because your loudspeaker will bump it up like 5 dB higher than the average output of the"}, {"start": 984.4399999999999, "end": 986.28, "text": "loudspeaker."}, {"start": 986.28, "end": 991.78, "text": "And in that if we tame it, then we don't just tame that unruliness of the speaker, but we"}, {"start": 991.78, "end": 996.6999999999999, "text": "also mitigate the fact that it does to the hard distortion coming from your amplifier."}, {"start": 996.7, "end": 1003.58, "text": "However, when we go higher in frequency, let's say 20 kilohertz, now the output has dropped"}, {"start": 1003.58, "end": 1005.4200000000001, "text": "tremendously by 20 kilohertz."}, {"start": 1005.4200000000001, "end": 1009.22, "text": "And if we add the Zobel, it will be even lower than that."}, {"start": 1009.22, "end": 1019.76, "text": "So ultimately, with the Zobel, it will not help us to fix the very top of the high frequency."}, {"start": 1019.76, "end": 1027.26, "text": "And what you might end up is add a Zobel plus add a super tweeter or an ultrasonic tweeter"}, {"start": 1027.26, "end": 1036.8799999999999, "text": "that will help you to fill out that 15 plus kilohertz region that now you realize is just"}, {"start": 1036.8799999999999, "end": 1040.26, "text": "not there at the level you want."}, {"start": 1040.26, "end": 1049.62, "text": "However another issue, the big issue with impedance occurs down there, that region."}, {"start": 1049.62, "end": 1059.62, "text": "like below 200 hertz, we start to have some, but mostly it's below like 60 hertz, where"}, {"start": 1059.62, "end": 1062.5, "text": "it gets really painful and really taxing."}, {"start": 1062.5, "end": 1068.4399999999998, "text": "But that's time for another video to expand on that."}, {"start": 1068.4399999999998, "end": 1071.06, "text": "And thank you for being here."}, {"start": 1071.06, "end": 1076.76, "text": "Thank you for watching, for educating yourself and keeping me company virtually through the"}, {"start": 1076.76, "end": 1078.76, "text": "ethers of the internet."}, {"start": 1078.76, "end": 1080.76, "text": "And have a wonderful day."}, {"start": 1080.76, "end": 1081.76, "text": "Bye bye."}, {"start": 1081.76, "end": 1082.76, "text": "Bye bye."}, {"start": 1082.76, "end": 1083.76, "text": "Bye bye."}, {"start": 1083.76, "end": 1084.9, "text": "Bye bye."}]}