{"video_id": "zt7YAna-Qcc", "url": "https://www.youtube.com/watch?v=zt7YAna-Qcc", "title": "zt7YAna-Qcc", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 20.84, "text": "Today's project is a little kit from the usual sources and it's the LM1875T. Now this isn't a"}, {"start": 20.84, "end": 30.68, "text": "new chip from by any stretch of the imagination it's been around since 2011. It's actually a pretty"}, {"start": 30.68, "end": 43.7, "text": "good chip. It produces about 20 watts per channel or a little bit more into 4 ohms. Now I don't want"}, {"start": 43.7, "end": 50.760000000000005, "text": "to give away what I've found on this but it's worth watching till the end of the video because"}, {"start": 50.76, "end": 60.08, "text": "there's a few surprises in store. So let's get on with the tests. It's on the bench now and we're"}, {"start": 60.08, "end": 70.12, "text": "connected to a positive and negative supply of 25 volts. This shows the quiescent conditions."}, {"start": 70.92, "end": 79.58, "text": "There's no signal going in at present and it's consuming half a watt of power from both supplies."}, {"start": 79.58, "end": 87.86, "text": "This is the negative supply and this is the positive supply. Now the first test I'm going to do is to"}, {"start": 87.86, "end": 101.42, "text": "power it up and see the maximum power that we can get done in my usual way just prior to clipping"}, {"start": 101.42, "end": 109.54, "text": "with one kilohertz going in. There is only one channel because it's mono. I haven't built the other"}, {"start": 109.54, "end": 119.3, "text": "one yet. So we'll see what power we get. Now bearing in mind this is a stabilized supply so the power will"}, {"start": 119.3, "end": 129.48000000000002, "text": "remain at 25 volts no matter how much power I draw. Obviously if you built this using a standard"}, {"start": 129.48, "end": 140.6, "text": "analog supply for want of a better word you may well start off with 25 volts but that will sag down to 22 23"}, {"start": 140.6, "end": 148.6, "text": "depending on the power supply you build. So obviously you will not get the maximum power"}, {"start": 148.6, "end": 158.04, "text": "power under those conditions. So whatever we measure now is with a stabilized supply of 25 volts."}, {"start": 159.0, "end": 169.72, "text": "Now clearly this little heat sink is not going to provide adequate cooling. Probably on music it might be okay"}, {"start": 169.72, "end": 182.2, "text": "but I'm going to use this little fan because I don't really want it to go bang. I'm sure that's going to be adequate for the job in question."}, {"start": 182.2, "end": 187.72, "text": "Right we're going to wind up the input now until we just"}, {"start": 190.35999999999999, "end": 191.88, "text": "our below clip"}, {"start": 197.07999999999998, "end": 204.35999999999999, "text": "and that's there and we're looking at the 30 volt scale which is this one"}, {"start": 204.36, "end": 221.24, "text": "which means we've got 14 volts RMS. 14 volts times 14 volts equals divided by 8 because we've got an 8 ohm load"}, {"start": 222.12, "end": 234.20000000000002, "text": "that's 24.5 watts. Well I started to do the same test into 4 ohms and it doesn't like 4 ohms. Look"}, {"start": 234.2, "end": 245.48, "text": "it starts to do some horrible things. I'm going to reduce the voltage down to 20 volts"}, {"start": 247.88, "end": 250.67999999999998, "text": "and see if it's happier. Let's have a look."}, {"start": 254.35999999999999, "end": 255.16, "text": "Yes it is."}, {"start": 255.16, "end": 273.24, "text": "So it doesn't like there's the maximum power and we've got 9 volts. Yes 20 watts. It doesn't really like 4 ohms."}, {"start": 273.88, "end": 276.44, "text": "Well we have a bit of a dilemma now."}, {"start": 276.44, "end": 286.84, "text": "The rating of this amplifier if you look at the official specifications is 20 watts into 4 ohms"}, {"start": 287.8, "end": 295.8, "text": "and 25 watts into 8 ohms. So clearly it has a bit of an issue with lower impedances."}, {"start": 296.76, "end": 304.52, "text": "It says that's both with 25 volts and you can operate it at up to plus and minus 30 volts"}, {"start": 304.52, "end": 311.15999999999997, "text": "and you can operate it at up to plus and minus 30 volts. What I'm going to do is I suspect you'll be"}, {"start": 311.15999999999997, "end": 322.03999999999996, "text": "surprised to hear this but we may well have a fake chip. I know what you're saying you find that so hard to"}, {"start": 322.03999999999996, "end": 331.32, "text": "believe but I think it could be the case. So I'm going to pause the video here now and pop down to"}, {"start": 331.32, "end": 343.8, "text": "J-Car and purchase a proper one and the one that I've still got to build here which I've actually built"}, {"start": 344.76, "end": 354.92, "text": "but I haven't put the chip on it yet so I'm going to pop out now and buy a proper chip put that on there"}, {"start": 354.92, "end": 364.04, "text": "and see if it makes any difference and if I find that the chip is fake I should be looking for a refund."}, {"start": 365.32, "end": 375.72, "text": "Well I've returned from shopping at J-Car and here we have the fake maybe and here we have"}, {"start": 375.72, "end": 387.16, "text": "the genuine maybe you can see they do look different this one the supposedly good one has just got a little"}, {"start": 387.8, "end": 399.96000000000004, "text": "round circle etched into it and the fake maybe has the sides beveled again from the rear they do look"}, {"start": 399.96, "end": 408.76, "text": "noticeably different. Now sadly the fakes don't always come with a red or in this case a black blob"}, {"start": 408.76, "end": 416.35999999999996, "text": "on them but that's just so if I drop them on the floor or can't remember which one's which this one"}, {"start": 416.91999999999996, "end": 422.91999999999996, "text": "is the one that came with the kit. If only all the fakes came with a blob of some colour on there that"}, {"start": 422.92, "end": 432.04, "text": "would make life easier wouldn't it. Even the leads have a different pitch slightly to the potentially"}, {"start": 432.04, "end": 440.6, "text": "good one. Anyway that's enough waffle I'm going to assemble this good one into the board and we'll see"}, {"start": 440.6, "end": 449.88, "text": "if there's any difference at all. I have exactly the same setup that I did for the original chip except"}, {"start": 449.88, "end": 456.04, "text": "I've mounted it on a bigger heat sink purely so I don't have to have a fan running on it. Other"}, {"start": 456.04, "end": 463.08, "text": "than that the setup is the same I've got a couple of extra capacitors here purely because my leads are"}, {"start": 463.08, "end": 471.0, "text": "a couple of feet long in reality I don't think it's going to make any difference but I wanted the test to"}, {"start": 471.0, "end": 479.56, "text": "be identical to the previous tests. The first thing we notice is that the quiescent current is now"}, {"start": 479.56, "end": 489.8, "text": "30 milliamps and instead of 20 milliamps and the conditions are otherwise the same. Voltage is the same"}, {"start": 489.8, "end": 498.12, "text": "25 volts plus and minus. Right we have our 8 ohm load connected and you can see on the scope we're"}, {"start": 498.12, "end": 505.72, "text": "actually running this at 100 hertz and the reason for doing that is because when I did the previous"}, {"start": 505.72, "end": 514.52, "text": "tests on the original chip I also had it set to 100 hertz not 1 kilohertz as I said so to keep things"}, {"start": 514.52, "end": 521.8000000000001, "text": "similar it won't make any difference in reality and I've already checked this and the power is the same"}, {"start": 521.8000000000001, "end": 530.2, "text": "at 100 ohms at 100 hertz as it is at 1 kilohertz. So we'll wind up the power now look at the top of the"}, {"start": 530.2, "end": 543.4000000000001, "text": "waveform and there's clipping there there so we take it down to there if we look at the meter on this scale"}, {"start": 544.44, "end": 558.9200000000001, "text": "we have 15 volts now according to my Olivetti meter that gives us 28.1 we'll call it 13 watts which is"}, {"start": 558.92, "end": 567.7199999999999, "text": "already 4 watts more than the previous chip under exactly the same circumstances so we'll do the same"}, {"start": 567.7199999999999, "end": 578.92, "text": "test now into 4 ohms. So there we have clean power and the heat sink is getting really toasty let's look at the"}, {"start": 578.92, "end": 597.88, "text": "power we've got 12 volts into 4 ohms. 12 volts into 4 ohms gives 36 watts which is a bit of an improvement"}, {"start": 597.88, "end": 610.2, "text": "from the previous which gave us 19 watts so I think we can categorically say that the chips supplied with the kit"}, {"start": 611.56, "end": 612.28, "text": "are fake"}, {"start": 614.76, "end": 623.8, "text": "this is our square wave at 1 kilohertz it really is 1 kilohertz now not 100 and as you can see it's pretty"}, {"start": 623.8, "end": 636.04, "text": "respectable let's um open it up a bit not bad at all not bad at all this is 10 kilohertz again as i've"}, {"start": 636.04, "end": 642.3599999999999, "text": "mentioned before excuse all the muck on here it's coming from some something in this room and i don't"}, {"start": 642.3599999999999, "end": 650.12, "text": "know what it is because even if i leave the scope unconnected i get that and it's definitely not coming"}, {"start": 650.12, "end": 656.12, "text": "from the amplifier itself i don't propose to spend hours going through graphs and things i should"}, {"start": 656.12, "end": 661.88, "text": "give you some figures shortly but we'll just go up a little bit to 20 kilohertz and see what the square"}, {"start": 661.88, "end": 667.0, "text": "wave looks like and there we are 20 kilohertz"}, {"start": 667.0, "end": 680.68, "text": "wave. Not bad not bad at all in fact it puts the waveforms of the quad which i'd previously tested to shame"}, {"start": 683.96, "end": 691.64, "text": "I'm embarrassed to say but it it really does! Here we are looking at a sign wave obviously and I just"}, {"start": 691.64, "end": 696.92, "text": "want you to see how clean it looks there's no crossover artifacts or anything"}, {"start": 696.92, "end": 707.26, "text": "nasty and but that corresponds to a hundred milliwatts output but at 50"}, {"start": 707.26, "end": 713.76, "text": "kilohertz can you believe pretty impressive by any standards I think we"}, {"start": 713.76, "end": 722.06, "text": "can categorically say without any fear of contradiction that the chips supplied"}, {"start": 722.06, "end": 733.56, "text": "with the original kits are fakes faulty not good the kits themselves were very"}, {"start": 733.56, "end": 738.2399999999999, "text": "easy to put together and all the components other than the chips which is"}, {"start": 738.2399999999999, "end": 743.3199999999999, "text": "sad because that's the main part of it are fine printed circuit board has good"}, {"start": 743.3199999999999, "end": 751.4399999999999, "text": "earthing planes and it is good one of the kits were missing to 15 pq"}, {"start": 751.44, "end": 758.6800000000001, "text": "was it 15 I can't remember but we're missing two small ceramic capacitors"}, {"start": 758.6800000000001, "end": 767.1600000000001, "text": "should you buy it well if you buy it and use it as is it's sort of okay into 8"}, {"start": 767.1600000000001, "end": 776.46, "text": "ohms and you get a reasonable power but bearing in mind that if you buy a genuine"}, {"start": 776.46, "end": 783.7800000000001, "text": "chip and this should be the giveaway you can expect to pay about 11 New Zealand"}, {"start": 783.7800000000001, "end": 789.7, "text": "dollars per chip which is more than the price of the kit but that's the price you"}, {"start": 789.7, "end": 795.82, "text": "pay if you want something genuine which is actually a pretty good amplifier I have"}, {"start": 795.82, "end": 808.1400000000001, "text": "to say it it really does sound good and if you want a 25 watt or more into 4 ohms then this this is a pretty good"}, {"start": 808.1400000000001, "end": 820.82, "text": "little kit even if you throw the chip away and you couldn't make the printed circuit board or buy the extra components for what you pay so I guess that's what you have to consider"}, {"start": 820.82, "end": 827.36, "text": "buy the kits throw the chip away and go to your do a proper electronic"}, {"start": 827.36, "end": 833.7800000000001, "text": "distributor RS components Farnell or other ones which are probably more"}, {"start": 833.7800000000001, "end": 841.94, "text": "prominent to you in your country and you do get a very nice little amplifier but"}, {"start": 841.94, "end": 853.1, "text": "these are the figures on the proper chip half DB down okay 10 Hertz and on the"}, {"start": 853.1, "end": 861.86, "text": "high side 55 kilohertz but if you want to really slum it and have 1 DB down pretty"}, {"start": 861.86, "end": 879.1, "text": "dreadful 7 Hertz and 105 kilohertz so not not a bad spec I think you'll agree the low end of course does have a 1 microfarad"}, {"start": 879.1, "end": 891.26, "text": "capacitor on the input electrolytic and you could argue that you'd be better off replacing that with a polyester or something like that but"}, {"start": 891.26, "end": 901.66, "text": "and if you put the component to a 2.2 microfarad you will go down even lower but in all honesty"}, {"start": 902.46, "end": 914.06, "text": "um 10 Hertz half a DB down it's not tacky is it I mean it would shame many valve well all am all valve amplifiers"}, {"start": 914.06, "end": 921.5, "text": "so I wouldn't I wouldn't mess with it it is what it is and for what you pay even if you go out and purchase"}, {"start": 921.5, "end": 934.14, "text": "two proper genuine chips you'll have a very nice 25 watt into 8 or 35 watts into 4 not tacky by any means"}, {"start": 934.14, "end": 941.42, "text": "yeah"}, {"start": 941.42, "end": 941.58, "text": "yeah"}, {"start": 941.58, "end": 942.42, "text": "yeah"}, {"start": 942.42, "end": 943.4399999999999, "text": "yeah"}, {"start": 943.4399999999999, "end": 944.46, "text": "yeah"}, {"start": 944.46, "end": 945.6, "text": "yeah"}, {"start": 945.6, "end": 946.86, "text": "yeah"}, {"start": 946.86, "end": 950.5, "text": "yeah"}, {"start": 954.02, "end": 955.02, "text": "yeah"}]}