{"video_id": "aqfyRUVSq9I", "url": "https://www.youtube.com/watch?v=aqfyRUVSq9I", "title": "aqfyRUVSq9I", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 3.2800000000000002, "text": "Hi guys, thanks for joining me. So this time we're going to build this."}, {"start": 8.42, "end": 14.16, "text": "A really gnarly sounding active filter that only takes one chip, one capacitor and a handful of"}, {"start": 14.16, "end": 18.6, "text": "resistors. So stay tuned. Hi folks, welcome back. So how are we going to do that? Well in previous"}, {"start": 18.6, "end": 22.88, "text": "videos we've taken resistors and capacitors and used them together to make filters. Now we're"}, {"start": 22.88, "end": 26.94, "text": "going to take resistors and capacitors again, only this time we're going to use them with active"}, {"start": 26.94, "end": 31.94, "text": "circuitry which is going to boost the gain of the signal after it's been filtered. How we're going"}, {"start": 31.94, "end": 36.34, "text": "to do that is with a little circuit called an op-amp. And an op-amp, or an operational amplifier,"}, {"start": 36.34, "end": 42.38, "text": "is a type of configurable high-gain amplifier where you can set clever feedback networks with"}, {"start": 42.38, "end": 47.540000000000006, "text": "simple components like resistors and capacitors that can change the gain of the circuit depending"}, {"start": 47.540000000000006, "end": 52.44, "text": "on what's going on. We're going to start with the most basic op-amp circuit that you can get. So let"}, {"start": 52.44, "end": 57.339999999999996, "text": "me just explain this very quickly. This is an op-amp circuit symbol. So we've got two inputs,"}, {"start": 57.339999999999996, "end": 62.199999999999996, "text": "we call this the non-inverting input, this is the inverting input, and this is the output. Okay,"}, {"start": 62.199999999999996, "end": 67.2, "text": "so this is called a follower. And the really important thing about this, that's the number"}, {"start": 67.2, "end": 71.64, "text": "one rule that you need to remember, when we have negative feedback, which is when the output is"}, {"start": 71.64, "end": 78.18, "text": "connected back to the inverting input, that the op-amp will then do whatever it can to try and make"}, {"start": 78.18, "end": 84.88000000000001, "text": "these two inputs equal. Okay, so why don't I put a input in here, and we'll have a look at what we're"}, {"start": 84.88000000000001, "end": 89.58000000000001, "text": "going to see in the output. We'll put a sine wave in. Rule number one, do we have negative feedback?"}, {"start": 89.58000000000001, "end": 95.28, "text": "Yes, we do. Okay, so it's going to try and make these two inputs equal. If we've got positive feedback,"}, {"start": 95.28, "end": 99.12, "text": "that makes things a little bit more complicated, and we'll do that in further videos. But for now,"}, {"start": 99.12, "end": 104.32000000000001, "text": "only looking at negative feedback will get us a long way. So the output will do whatever it can to"}, {"start": 104.32, "end": 111.02, "text": "make these two inputs equal. And what that means is, let's say this is one volt at the top and at the bottom."}, {"start": 111.02, "end": 117.44, "text": "So this is zero volts. That's why we call this a follower, because if you follow, if you think the"}, {"start": 117.44, "end": 122.69999999999999, "text": "circuit through, if this is one volt, this wants to be one volt, there's no circuitry here, so the output"}, {"start": 122.69999999999999, "end": 128.07999999999998, "text": "just needs to be one volt. So minus one volt, if this is minus one volt here, what does this one want to be?"}, {"start": 128.08, "end": 135.78, "text": "It's going to be minus one volt. So very easy to see that the output just looks exactly the same as the input."}, {"start": 135.78, "end": 142.78, "text": "Easy peasy. So this is called a follower, and this is essentially what we can think of as a buffer."}, {"start": 142.78, "end": 147.38000000000002, "text": "Okay, so that's all well and good. I'm sure you can see how that's useful, but it doesn't really do anything."}, {"start": 147.38000000000002, "end": 151.48000000000002, "text": "You just get the outputs the same as the input. How do we get up-amp circuits that do stuff?"}, {"start": 151.48, "end": 155.38, "text": "Well, let's have a look what happens when we put some stuff in this feedback path."}, {"start": 155.38, "end": 162.28, "text": "Okay, so by putting two resistors in the feedback circuit, I think you can probably imagine that I've"}, {"start": 162.28, "end": 171.48, "text": "changed how this circuit is going to work quite a lot. This is now a non-inverting amplifier. And we can"}, {"start": 171.48, "end": 176.88, "text": "imagine that the output is still going to look something like this input. Obviously I've already"}, {"start": 176.88, "end": 183.38, "text": "given it away and told you that it's non-inverting. So how do we tell what the relationship is between"}, {"start": 183.38, "end": 187.68, "text": "the output and the input? Well, we can see down here that what we've essentially done is we've made a voltage"}, {"start": 187.68, "end": 194.48, "text": "divider from the output down to ground. I just put output, that's this point here, and this point here is"}, {"start": 194.48, "end": 202.48, "text": "this point here. So the output of our voltage divider, this goes to our inverting input. Then we can see that"}, {"start": 202.48, "end": 208.88, "text": "the ratio of these two resistors is going to set the voltage at this point, which is then going to be"}, {"start": 208.88, "end": 214.88, "text": "what's fed back into here. So the output is going to do what it can to make sure that the voltage at this"}, {"start": 214.88, "end": 221.28, "text": "point here is the same as this point here. Remember our golden rule from before. And so what it needs to"}, {"start": 221.28, "end": 229.83999999999997, "text": "do is drop enough voltage across this whole voltage divider to make this point the same as this point."}, {"start": 229.84, "end": 238.08, "text": "Input is at one volt. Let's say this is 100 kilo ohms, this is R2, and let's say that R1 is one kilo ohm."}, {"start": 238.08, "end": 248.08, "text": "To cut a long story short, this circuit has to output 101 volts at the output to make this part here"}, {"start": 248.72, "end": 254.56, "text": "one volt, because there's a 100 to one ratio here, so there's going to be a hundred times more voltage"}, {"start": 254.56, "end": 260.32, "text": "dropped across this one than this one, so we need 101 to get that equal split."}, {"start": 262.08, "end": 266.4, "text": "How that's represented in terms of gain is we say that this circuit has a gain,"}, {"start": 267.2, "end": 277.68, "text": "this configuration always has a gain of 1 plus R2 over R1. So if this was 100k, this was 1k, the k's"}, {"start": 277.68, "end": 286.16, "text": "cancel out, so we've essentially got 100 over 1, which is 100 plus 1, 101. Okay, so if this were 10k, then this output would have to be"}, {"start": 286.72, "end": 293.84000000000003, "text": "11 volts to get 1 volt here. And so we can see that, let's just leave it like this, that we're going to get an output"}, {"start": 294.4, "end": 300.16, "text": "that is much bigger. We're going to have an output that's 10 times bigger than our input. That's how you make a"}, {"start": 300.16, "end": 305.52000000000004, "text": "non-inverting amplifier. So there's one more variation that I want to show you before we go on to building our active filter."}, {"start": 306.32000000000005, "end": 312.72, "text": "Okay, so this is a slightly more interesting configuration. Now this time we've still got negative feedback, see, so"}, {"start": 312.72, "end": 318.56, "text": "we can still use our first golden rule, but we're applying the input signal to the same input that we're"}, {"start": 318.56, "end": 320.96000000000004, "text": "feeding back. So our feedback is going to kind of be"}, {"start": 321.6, "end": 328.16, "text": "mixed with our input signal, which is going to be giving us some very interesting results. The second really interesting thing,"}, {"start": 328.16, "end": 333.20000000000005, "text": "now we've got this non-inverting input connected to ground. So what does that do with our circuit?"}, {"start": 333.20000000000005, "end": 339.6, "text": "So if we now think about this point here, if this point here is connected to ground, we've got negative feedback,"}, {"start": 339.6, "end": 345.04, "text": "so remember our rule number one, the op-amp will now try and make these two inputs the same."}, {"start": 345.04, "end": 351.28000000000003, "text": "So that means that it's going to try and make this input ground. This is a really special part of op-amp analysis,"}, {"start": 351.28000000000003, "end": 357.52000000000004, "text": "which is that this point is now called virtual ground, which means that this point will act"}, {"start": 357.52, "end": 364.47999999999996, "text": "for all intents and purposes, like a second ground. If we have our input here and ground here,"}, {"start": 364.47999999999996, "end": 370.0, "text": "then our entire input signal is across this resistor. That makes it really easy to analyze, doesn't it?"}, {"start": 370.0, "end": 374.64, "text": "Because now we know, let's say this is one volt peak to peak again, so we've got one milliamp"}, {"start": 374.64, "end": 381.68, "text": "through this resistor. So now we need our second magical rule that no current flows in or out"}, {"start": 382.32, "end": 388.48, "text": "of these terminals. So we've got this one milliamp current that flows this way."}, {"start": 389.12, "end": 394.40000000000003, "text": "So what happens to it? Well, I've just told you that it can't go in here, so we know it has to go this way."}, {"start": 394.40000000000003, "end": 399.04, "text": "And now if we've got current flowing this way, we've got a positive voltage drop in this direction,"}, {"start": 399.04, "end": 405.52, "text": "and one milliamp times 10k is 10 volts. So now we've got, as far as the output is concerned,"}, {"start": 405.52, "end": 410.88, "text": "so if this point is ground, and there's then a 10 volts voltage drop across this resistor,"}, {"start": 410.88, "end": 415.68, "text": "then that means that this point is 10 volts lower than this point. Now this is ground, so that's zero,"}, {"start": 415.68, "end": 421.68, "text": "so this must be minus 10 volts. And then when this is negative, this is minus 1 volts, well this all"}, {"start": 421.68, "end": 429.35999999999996, "text": "gets flipped around. This is minus 1 milliamps now. So now remember this is ground, we've got minus 10 volts,"}, {"start": 429.36, "end": 437.76, "text": "so this place must be plus 10. So this time the gain is minus R2 over R1. This is R2, this is R1,"}, {"start": 437.76, "end": 444.72, "text": "and this minus just shows us, just telling us mathematically that it's inverted. So this inverting"}, {"start": 444.72, "end": 450.88, "text": "amplifier configuration is the one that we're going to use to make our active filter. So we've taken the"}, {"start": 450.88, "end": 455.52000000000004, "text": "inverting op-amp configuration from before, and we just put a capacitor in parallel with the feedback"}, {"start": 455.52, "end": 460.71999999999997, "text": "resistor. So how is that going to affect how this circuit works? In a sentence, a capacitor can be"}, {"start": 460.71999999999997, "end": 465.12, "text": "viewed as a resistor that's able to change its resistance depending on the frequency of the"}, {"start": 465.12, "end": 469.84, "text": "signal across it. Watch my circuits one-on-one video if you want the whole story, but essentially"}, {"start": 469.84, "end": 475.35999999999996, "text": "what's going to happen is that this capacitor is going to look like a very big or very small resistance"}, {"start": 475.35999999999996, "end": 479.52, "text": "depending on what frequency we're looking at. So how is that going to change the behavior of the"}, {"start": 479.52, "end": 485.44, "text": "circuit? Well let's have a look at this circuit in terms of the voltages instead of before how I looked at"}, {"start": 485.44, "end": 490.0, "text": "it with the currents. So for a second let's pretend that capacitor wasn't there, and let's see what"}, {"start": 490.0, "end": 495.76, "text": "happens when you apply one volt at the input. If we assume that the output begins at zero volts,"}, {"start": 495.76, "end": 500.8, "text": "what we're doing is we're applying one volt to a voltage divider that looks like this. So let's say"}, {"start": 500.8, "end": 507.04, "text": "that the output is ground, zero volts, so we've got one volt across 1k and then 10k, so we're going to"}, {"start": 507.04, "end": 512.48, "text": "see about 0.9 volts at this inverting input. The op-amp now is going to try and make these two inputs"}, {"start": 512.48, "end": 516.88, "text": "equal because this inputs at ground remember. This is exactly the same as what we've just done."}, {"start": 516.88, "end": 523.44, "text": "So now what does the output of the op-amp have to do to make this point zero? Well the op-amp"}, {"start": 523.44, "end": 531.04, "text": "has to put minus 0.9 volts here, because if there's 0.9 volts here the op-amp wants to kind of oppose"}, {"start": 531.04, "end": 538.8000000000001, "text": "that. Okay so we know we want about minus 0.9 volts at this point because then minus 0.9 plus 0.9"}, {"start": 538.8, "end": 544.88, "text": "will make this point zero. So what does the output have to do in order to do that? And to get about"}, {"start": 544.88, "end": 553.28, "text": "minus 0.9 volts here, the output needs to push minus 10 volts this way. So either we've got a current"}, {"start": 553.28, "end": 560.9599999999999, "text": "coming this way that drops voltage here and voltage here, or we can think about this as a kind of"}, {"start": 561.52, "end": 568.4799999999999, "text": "balancing act of these two resistances and the output opposing the input to make this point zero."}, {"start": 568.48, "end": 572.8000000000001, "text": "If we think of it in terms of those voltages and we put this capacitor back in, what we're essentially"}, {"start": 572.8000000000001, "end": 578.32, "text": "saying is that when at very low frequencies, when the capacitor looks like essentially an open circuit,"}, {"start": 578.88, "end": 584.5600000000001, "text": "you've got that behaviour that we were just talking about. This just acts like an inverting amplifier."}, {"start": 584.5600000000001, "end": 590.64, "text": "But when we have the capacitor in and we think about the high frequencies, well that short circuits"}, {"start": 590.64, "end": 598.88, "text": "this, and the op-amp output can bypass this resistor and oppose the input with almost no effort. So what"}, {"start": 598.88, "end": 603.68, "text": "we're saying is that at high frequencies, the output can bypass this resistor because this capacitor looks"}, {"start": 603.68, "end": 609.76, "text": "like a short circuit at high frequencies, and at low frequencies it behaves like an ordinary amplifier."}, {"start": 609.76, "end": 616.24, "text": "So we essentially get discrimination between low frequencies and high frequencies by simply just"}, {"start": 616.24, "end": 621.4399999999999, "text": "adding a capacitor in here. So in this context we're just thinking of this capacitor as a frequency"}, {"start": 621.4399999999999, "end": 628.64, "text": "dependent resistor, and it's the frequency at which this resistance becomes comparable to this resistance"}, {"start": 628.64, "end": 634.8, "text": "that is going to set the point at which it starts to filter. And we call that point the 3dB point, and again I'm not"}, {"start": 634.8, "end": 638.64, "text": "going to go into it now because I've done my circuits 101 video where I go through all of this stuff."}, {"start": 638.64, "end": 644.24, "text": "The point I'm trying to make is that if you vary this resistor, you can change the point at which those two resistances become"}, {"start": 644.24, "end": 651.8399999999999, "text": "comparable, and that sets the threshold for the filter. Now if you're eagle-eyed you would have seen there's a huge problem with that,"}, {"start": 651.8399999999999, "end": 659.04, "text": "because if we change this resistance at low frequencies, remember, let's just ignore this because it's an open circuit,"}, {"start": 659.04, "end": 664.64, "text": "now we've got a inverting amplifier, but it's these two resistances that sets the gain."}, {"start": 664.64, "end": 669.92, "text": "So we're simultaneously changing the cutoff frequency and the gain at the same time, and we don't want to do that."}, {"start": 669.92, "end": 676.56, "text": "So all we're going to do is replace these two resistances with a linked stereo potentiometer,"}, {"start": 676.56, "end": 682.88, "text": "which is basically a potentiometer where you turn one dial and it wipes two separate potentiometers at"}, {"start": 682.88, "end": 689.84, "text": "the same time. So you can always keep these two resistances to be exactly equal, so the gain is always one."}, {"start": 689.84, "end": 697.0400000000001, "text": "Okay, so now the last consideration we have to make, this is setting our midpoint. Usually you see an op-amp"}, {"start": 697.0400000000001, "end": 702.08, "text": "like this, but this is plus V and this is minus V if we have a split supply, but we've been using batteries."}, {"start": 702.08, "end": 707.36, "text": "So this is going to be ground, the negative supply is going to be ground, this is going to be 9 volts."}, {"start": 707.36, "end": 712.88, "text": "So if we connect a disk to ground as well, our output circuit, our output signal sorry, would look like this."}, {"start": 712.88, "end": 719.36, "text": "Because we can't go below ground, we need to set this point here to 4.5 volts, we want our output signal"}, {"start": 719.36, "end": 724.32, "text": "to look like this, to be centred around the centre so there's no clipping at the top or at the bottom."}, {"start": 724.32, "end": 728.88, "text": "There's a couple of ways we could do this. Okay, so we could set up a circuit like this if we wanted to."}, {"start": 728.88, "end": 733.76, "text": "This is our low pass filter that we just looked at, remember this is a stereo potentiometer here,"}, {"start": 733.76, "end": 740.96, "text": "and then this is just a unity gain inverting amplifier, just as a buffer, and then you take the output out here."}, {"start": 740.96, "end": 748.96, "text": "We could also just do what we've been doing all along, which is to take advantage of our CMOS chips ability"}, {"start": 748.96, "end": 758.8000000000001, "text": "to do all this stuff for us. This CD4069UB is an inverting amplifier with the midway point threshold"}, {"start": 758.8000000000001, "end": 765.2800000000001, "text": "set internally to the chip. Take rid of this stuff, get rid of this stuff. So these two inputs obviously"}, {"start": 765.2800000000001, "end": 771.2800000000001, "text": "still exist, but they're internal to the chip and they're setting that threshold for us. So with one,"}, {"start": 771.2800000000001, "end": 777.2800000000001, "text": "two, three, four components and one chip, we can make ourselves a stable active filter. Right,"}, {"start": 777.28, "end": 782.0799999999999, "text": "hello folks. What we're going to do now is we're going to build the circuit out. A bit of a 4106"}, {"start": 782.0799999999999, "end": 785.8399999999999, "text": "oscillator as a sound source, you can use any sound source you want. Okay, so now we're going to take"}, {"start": 785.8399999999999, "end": 792.72, "text": "this and we're going to put it into our 4069, but we're going to do it via this stereo potentiometer."}, {"start": 792.72, "end": 797.68, "text": "So we're going to take one output of the 4106, and I'm going to feed it to one leg of the stereo"}, {"start": 797.68, "end": 803.28, "text": "potentiometer. So this is a potentiometer with two potentiometers with only one wiper, and I'm putting it on"}, {"start": 803.28, "end": 807.68, "text": "either side of the track like this so they're electrically isolated from one another. And then"}, {"start": 807.68, "end": 812.72, "text": "I'm going to use them as two separate potentiometers. So I'm using this one as my input potentiometer."}, {"start": 812.72, "end": 819.52, "text": "It goes through this right hand side first, and then to the 4069. And it's also serving as my feedback resistor."}, {"start": 819.52, "end": 834.24, "text": "Okay, so that should be a unity gain inverting amplifier now. And as I vary the potentiometer,"}, {"start": 834.24, "end": 842.3199999999999, "text": "the gain shouldn't change. Good. Okay, so now what I'm going to do is I'm going to put a capacitor,"}, {"start": 842.32, "end": 852.72, "text": "a small capacitor. I'm going to use a 0.033 microfarad capacitor in parallel with this. So one leg at the"}, {"start": 852.72, "end": 858.1600000000001, "text": "output of the op-amp and the other leg at the input. That's the input signal where it's just an ordinary"}, {"start": 858.1600000000001, "end": 862.72, "text": "square wave, you know, it looks exactly the same as the input. And then as we filter it,"}, {"start": 862.72, "end": 874.72, "text": "it becomes more like a triangle wave. Those high frequencies are filtered out. You can see on the"}, {"start": 874.72, "end": 885.0400000000001, "text": "scope that the amplitude isn't changing. Okay, and then finally, I've just added another inverting buffer"}, {"start": 885.0400000000001, "end": 892.4, "text": "with just 100k, which is this resistor here, and then 100k feeding back. So that's just buffered the output."}, {"start": 892.72, "end": 893.9200000000001, "text": "So that we can't load it down."}, {"start": 901.36, "end": 904.88, "text": "Okay, so that's it for this one guys. Thanks for joining me today. We looked over"}, {"start": 904.88, "end": 910.32, "text": "three super simple op-amp circuits. We learned how to analyze op-amp circuits in general, and we built"}, {"start": 910.32, "end": 914.88, "text": "ourselves this awesome sounding active filter. Thanks for watching. Make sure you like, share,"}, {"start": 914.88, "end": 920.32, "text": "subscribe, do all that stuff. Ring the bell. Find me on social media on Facebook, Twitter,"}, {"start": 920.32, "end": 925.9200000000001, "text": "Instagram, watch more of my videos here, some over here, and I'll see you all next time. Take care."}, {"start": 925.92, "end": 927.92, "text": "Amen."}]}