{"video_id": "dmPIydL0lyM", "url": "https://www.youtube.com/watch?v=dmPIydL0lyM", "title": "dmPIydL0lyM", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 22.400000000000002, "text": "Hey friends, welcome to the YouTube channel all about electronics."}, {"start": 22.400000000000002, "end": 27.16, "text": "So, in this video, we will learn about the bandpass and the penstop filter."}, {"start": 27.16, "end": 31.38, "text": "So in the last couple of videos, we had seen that how to design the active as well as the"}, {"start": 31.38, "end": 36.72, "text": "passive low pass and the high pass filter using the resistor and the capacitor."}, {"start": 36.72, "end": 41.04, "text": "And we had seen that this low pass filter passes the low frequency components from the"}, {"start": 41.04, "end": 46.2, "text": "input signal while the high pass filter passes the high frequency components from the input"}, {"start": 46.2, "end": 47.5, "text": "signal."}, {"start": 47.5, "end": 53.54, "text": "But sometimes in some applications, we are only interested in the particular band of frequencies."}, {"start": 53.54, "end": 57.82, "text": "So, for such applications, we can use this bandpass filter."}, {"start": 57.82, "end": 63.28, "text": "So as you can see, this bandpass filter passes only certain band of frequencies."}, {"start": 63.28, "end": 67.28, "text": "And it rejects all the frequencies which is outside of this band."}, {"start": 67.28, "end": 71.36, "text": "So now there are many ways in which we can design this bandpass filter."}, {"start": 71.36, "end": 76.24, "text": "And one of the way is to design this bandpass filter using the series RLC circuit."}, {"start": 76.24, "end": 81.96, "text": "And particularly, when you take the output across this resistor, then the response of this circuit"}, {"start": 81.96, "end": 85.56, "text": "will be very similar to the response of this bandpass filter."}, {"start": 85.56, "end": 91.24, "text": "And we have already seen this in the earlier videos of a series resonance in the RLC circuit."}, {"start": 91.24, "end": 94.34, "text": "So for more information, you can check that video."}, {"start": 94.34, "end": 99.25999999999999, "text": "But in this video, we will learn how to design this bandpass filter just by using this high"}, {"start": 99.25999999999999, "end": 101.24, "text": "pass and the low pass filter."}, {"start": 101.24, "end": 106.6, "text": "So, just by cascading this high pass filter and the low pass filter, we can design this"}, {"start": 106.6, "end": 108.22, "text": "bandpass filter."}, {"start": 108.22, "end": 112.91999999999999, "text": "So now let's understand how this combination will act as a bandpass filter."}, {"start": 112.91999999999999, "end": 117.36, "text": "So let's say, we have one low pass filter which is having a cutoff frequency let's say"}, {"start": 117.36, "end": 118.36, "text": "FC1."}, {"start": 118.36, "end": 125.28, "text": "And let's say we have one high pass filter which is having a cutoff frequency of FC2."}, {"start": 125.28, "end": 130.3, "text": "Now whenever we cascade this high pass and the low pass filter, then we will get an overlapping"}, {"start": 130.3, "end": 135.4, "text": "region between the individual responses of this high pass and the low pass filter."}, {"start": 135.4, "end": 139.96, "text": "And this overlapping region will act as a bandpass filter."}, {"start": 139.96, "end": 144.58, "text": "So in this way, just by cascading this high pass and the low pass filter, we can design"}, {"start": 144.58, "end": 146.68, "text": "this bandpass filter."}, {"start": 146.68, "end": 151.56, "text": "So now if you see the frequency response of this bandpass filter, you will immediately notice"}, {"start": 151.56, "end": 155.28, "text": "that this filter will have two cutoff frequencies."}, {"start": 155.28, "end": 160.2, "text": "The one is known as the lower cutoff frequency and the other frequency is known as the higher"}, {"start": 160.2, "end": 162.16, "text": "cutoff frequency."}, {"start": 162.16, "end": 167.38, "text": "And beyond these cutoff frequencies, the roll-off will be at the rate of 20 dB per decade."}, {"start": 167.38, "end": 172.66, "text": "And that is particularly true when you design this bandpass filter just by cascading the first"}, {"start": 172.66, "end": 175.24, "text": "order high pass and the low pass filter."}, {"start": 175.24, "end": 180.36, "text": "Now, the frequency difference between this cutoff frequency is known as the bandwidth of"}, {"start": 180.36, "end": 182.22, "text": "this bandpass filter."}, {"start": 182.22, "end": 187.02, "text": "So now let's see some of the parameters which defines this bandpass filter."}, {"start": 187.02, "end": 191.8, "text": "So as I said earlier, the difference between the two cutoff frequencies is known as the"}, {"start": 191.8, "end": 193.82000000000002, "text": "bandwidth of this filter."}, {"start": 193.82000000000002, "end": 199.12, "text": "And the geometric mean of these two cutoff frequencies is known as the center frequency of this bandpass"}, {"start": 199.12, "end": 200.12, "text": "filter."}, {"start": 200.12, "end": 205.88, "text": "So, for this frequency response, the center frequency will be somewhere around here."}, {"start": 205.88, "end": 209.72, "text": "So that will be the center frequency of this bandpass filter."}, {"start": 209.72, "end": 214.52, "text": "And if we see the phase response of this bandpass filter, then the phase response will look"}, {"start": 214.52, "end": 216.24, "text": "like this."}, {"start": 216.24, "end": 222.62, "text": "So as you can see, at zero frequency, the output will lead the input by a 90 degree."}, {"start": 222.62, "end": 228.4, "text": "And as we move toward the center frequency, the phase difference will gradually reduce."}, {"start": 228.4, "end": 234.06, "text": "So now, when we start moving away from this center frequency, then the output will start"}, {"start": 234.06, "end": 236.6, "text": "lagging the input signal."}, {"start": 236.6, "end": 242.68, "text": "And at f is equal to infinity, the output will lag the input by a 90 degree."}, {"start": 242.68, "end": 247.70000000000002, "text": "Alright, so now as we have seen the phase and the frequency response of this bandpass filter,"}, {"start": 247.70000000000002, "end": 251.18, "text": "so let's take one example based on this bandpass filter."}, {"start": 251.18, "end": 256.5, "text": "So in this example, we have given this filter and we have been asked to find the bandwidth of"}, {"start": 256.5, "end": 258.3, "text": "this given filter."}, {"start": 258.3, "end": 263.9, "text": "So as you can see in this example, the high pass filter and the low pass filter are cascaded."}, {"start": 263.9, "end": 267.5, "text": "And using this cascade connection, the bandpass filter has been designed."}, {"start": 267.5, "end": 272.46, "text": "So, to find the bandwidth of this filter, first of all let's find the cutoff frequency of"}, {"start": 272.46, "end": 275.5, "text": "this individual high pass and the low pass filter."}, {"start": 275.5, "end": 280.0, "text": "So, let's first of all find the cutoff frequency of this high pass filter."}, {"start": 280.0, "end": 285.04, "text": "And let's assume that the cutoff frequency of this high pass filter is fc1 and the cutoff"}, {"start": 285.04, "end": 287.4, "text": "frequency of this low pass filter is fc2."}, {"start": 287.4, "end": 293.0, "text": "Now, we know that the cutoff frequency of this high pass filter can be given by the equation"}, {"start": 293.0, "end": 297.38, "text": "1dr by 2π into RC."}, {"start": 297.38, "end": 303.4, "text": "So now, if we put the value of this resistor and capacitor, then we will find the cutoff frequency"}, {"start": 303.4, "end": 304.4, "text": "of this low pass filter."}, {"start": 304.4, "end": 309.88, "text": "So, let's see, the cutoff frequency of this low pass filter will be around 10.61 kHz."}, {"start": 309.88, "end": 317.44, "text": "So in this way, we have found this cutoff frequency of this high pass filter as 10.61 kHz."}, {"start": 317.44, "end": 321.91999999999996, "text": "So similarly, now let's find the cutoff frequency of this low pass filter."}, {"start": 321.91999999999996, "end": 326.96, "text": "So again, the cutoff frequency of this low pass filter can be given by the equation 1dr by"}, {"start": 326.96, "end": 329.0, "text": "2π into RC."}, {"start": 329.0, "end": 334.16, "text": "And if we put the value of this resistor and capacitor, then the cutoff frequency of this"}, {"start": 334.16, "end": 340.02, "text": "low pass filter will be 106.1 kHz."}, {"start": 340.02, "end": 349.06, "text": "So in this way, we have found the cutoff frequency of this low pass filter as 106.1 kHz."}, {"start": 349.06, "end": 354.96, "text": "So now, the bandwidth of this band pass filter can be defined as the difference between these"}, {"start": 354.96, "end": 357.12, "text": "two cutoff frequencies."}, {"start": 357.12, "end": 369.06, "text": "So the bandwidth of this band pass filter will be FC2-FC1 that is equal to 106.1-10.61 kHz."}, {"start": 369.06, "end": 373.94, "text": "And that is nothing but 95.5 kHz."}, {"start": 373.94, "end": 379.5, "text": "So roughly we can say that this band pass filter having a bandwidth of 100 kHz."}, {"start": 379.5, "end": 384.18, "text": "So in this example, now if you see here, we have designed this band pass filter just by"}, {"start": 384.18, "end": 388.28000000000003, "text": "cascading this passive, high pass and the low pass filter."}, {"start": 388.28000000000003, "end": 393.82, "text": "And as this filter is designed using this passive components, so the actual values of this cutoff"}, {"start": 393.82, "end": 397.62, "text": "frequencies will be slightly different from the designed values."}, {"start": 397.62, "end": 402.46000000000004, "text": "And the reason is that the input impedance of this high pass filter will affect the cutoff"}, {"start": 402.46000000000004, "end": 405.12, "text": "frequency of this low pass filter."}, {"start": 405.12, "end": 418.06, "text": "So, in this way, because of this cascade connection of this passive filters, the design frequencies"}, {"start": 418.06, "end": 421.06, "text": "and the actual cutoff frequencies will be slightly different."}, {"start": 421.06, "end": 425.28000000000003, "text": "And to avoid that, we can isolate the two stages by using the buffer."}, {"start": 425.28, "end": 430.52, "text": "So, in the last video, we have already seen that, by using this op-amp as a buffer, we"}, {"start": 430.52, "end": 433.34, "text": "can isolate the different stages of this filter."}, {"start": 433.34, "end": 437.58, "text": "So instead of using this passive low pass and the high pass filter, we can use this active"}, {"start": 437.58, "end": 439.97999999999996, "text": "low pass and the high pass filter."}, {"start": 439.97999999999996, "end": 444.23999999999995, "text": "And just by cascading these two active low pass and the high pass filter, we can design"}, {"start": 444.23999999999995, "end": 445.78, "text": "this band pass filter."}, {"start": 445.78, "end": 451.21999999999997, "text": "And by using this op-amp as a buffer, we can isolate the two different stages as well."}, {"start": 451.22, "end": 456.34000000000003, "text": "And suppose if we want the gain from this active filter, then we can configure this op-amp either"}, {"start": 456.34000000000003, "end": 459.62, "text": "in a inverting or a non-inverting configuration."}, {"start": 459.62, "end": 464.40000000000003, "text": "So in this way, not only we can isolate the two different stages, but we can also achieve"}, {"start": 464.40000000000003, "end": 466.54, "text": "the gain out of this filter."}, {"start": 466.54, "end": 472.18, "text": "So now like we have seen this band pass filter, let's see one more filter whose response is"}, {"start": 472.18, "end": 475.32000000000005, "text": "exactly opposite to that of this band pass filter."}, {"start": 475.32000000000005, "end": 480.08000000000004, "text": "So this filter is known as the band stop filter or a band reject filter."}, {"start": 480.08, "end": 485.7, "text": "So this band stop or a band reject filter rejects certain band of frequencies and it passes"}, {"start": 485.7, "end": 489.62, "text": "all other frequencies which is out of this particular band."}, {"start": 489.62, "end": 494.84, "text": "And if we see the frequency response of this band stop filter, it will look like this."}, {"start": 494.84, "end": 500.32, "text": "So like as you can see here, this band stop filter rejects a particular band of frequencies"}, {"start": 500.32, "end": 505.06, "text": "and it passes all other frequencies which is beyond this particular band."}, {"start": 505.06, "end": 509.6, "text": "So now in the earlier video of resonance in the parallel RLC circuit, we have already seen"}, {"start": 509.6, "end": 514.74, "text": "that by connecting this resistor, capacitor and inductor in a parallel, we can design this"}, {"start": 514.74, "end": 516.16, "text": "band stop filter."}, {"start": 516.16, "end": 521.06, "text": "And particularly when we take the output across this resistor, then the response of this parallel"}, {"start": 521.06, "end": 525.56, "text": "RLC circuit will be very similar to the response of this band stop filter."}, {"start": 525.56, "end": 530.48, "text": "So for more information, you can check that video on a resonance in the parallel RLC circuit."}, {"start": 530.48, "end": 535.48, "text": "But in this video, we will see that how we can design this band stop filter by using this"}, {"start": 535.48, "end": 537.5600000000001, "text": "low pass and the high pass filter."}, {"start": 537.5600000000001, "end": 541.86, "text": "So before we see that, first of all let us carefully see once again the response of this"}, {"start": 541.86, "end": 543.88, "text": "band stop filter."}, {"start": 543.88, "end": 550.0, "text": "So now if you see the response, particularly this portion, this is nothing but the response"}, {"start": 550.0, "end": 552.98, "text": "of the low pass filter."}, {"start": 552.98, "end": 565.38, "text": "So, in this way, just by adding the responses of this low pass filter and the high pass filter,"}, {"start": 565.38, "end": 568.36, "text": "we can design this band stop filter."}, {"start": 568.36, "end": 572.9200000000001, "text": "So now what we can do, we can provide the same input to this both low pass as well as"}, {"start": 572.9200000000001, "end": 574.64, "text": "the high pass filter."}, {"start": 574.64, "end": 580.76, "text": "And just by adding their individual responses, we can get this response of a band stop filter."}, {"start": 580.76, "end": 585.16, "text": "And we can easily achieve this response by using this op-amp circuit."}, {"start": 585.16, "end": 590.24, "text": "So as you can see here, this portion is nothing but the high pass filter."}, {"start": 590.24, "end": 593.7, "text": "And the lower portion is nothing but the low pass filter."}, {"start": 593.7, "end": 598.64, "text": "So as you can see here, we have given the same input to this low pass as well as the high"}, {"start": 598.64, "end": 600.38, "text": "pass filter."}, {"start": 600.38, "end": 605.92, "text": "And just by adding their individual responses by summer circuit, we can design this band stop"}, {"start": 605.92, "end": 606.92, "text": "filter."}, {"start": 606.92, "end": 611.8, "text": "So now to get more idea about this band stop filter, let's take one example."}, {"start": 611.8, "end": 617.12, "text": "So in this example, we have been given the design of this active band stop filter."}, {"start": 617.12, "end": 622.8399999999999, "text": "And in this example, we have been asked to find the stop band of this band stop filter."}, {"start": 622.8399999999999, "end": 627.68, "text": "So the stop band is nothing but the frequency band which is being rejected by this band stop"}, {"start": 627.68, "end": 628.68, "text": "filter."}, {"start": 628.68, "end": 633.36, "text": "And to find that, first of all let's find the cutoff frequency of these individual filters."}, {"start": 633.36, "end": 638.08, "text": "Let's say the cutoff frequency of this high pass filter is let's say FC1 and the cutoff"}, {"start": 638.08, "end": 641.82, "text": "frequency of this low pass filter is let's say FC2."}, {"start": 641.82, "end": 646.96, "text": "And as we know, the cutoff frequency for this high pass filter can be given by the expression"}, {"start": 646.96, "end": 650.34, "text": "1 divided by 2π into RC."}, {"start": 650.34, "end": 655.3000000000001, "text": "And if we put all the values of this resistor and capacitor, then the value of this cutoff frequency"}, {"start": 655.3, "end": 656.3, "text": "will be 994Hz."}, {"start": 656.3, "end": 660.02, "text": "So, in this way, we have found the cutoff frequency of this high pass filter is 1.59kHz."}, {"start": 660.02, "end": 664.76, "text": "Similarly, now let's find the cutoff frequency of this low pass filter."}, {"start": 664.76, "end": 669.9599999999999, "text": "So, the cutoff frequency of this low pass filter can be given by the expression 1 divided by 2.2"}, {"start": 669.9599999999999, "end": 671.5, "text": "RC."}, {"start": 671.5, "end": 676.4399999999999, "text": "And if we put all the values of this resistor and capacitor, then we will get this cutoff frequency"}, {"start": 676.44, "end": 677.44, "text": "as 994Hz."}, {"start": 677.44, "end": 685.44, "text": "So, in this way, we have found the cutoff frequency of this high pass filter is 1.59kHz."}, {"start": 685.44, "end": 690.98, "text": "And the cutoff frequency of this low pass filter is 994Hz."}, {"start": 690.98, "end": 697.44, "text": "So, the stop band can be given by FC2-FC1 that is,"}, {"start": 697.44, "end": 703.6, "text": "1590Hz-994Hz."}, {"start": 703.6, "end": 707.86, "text": "That is nothing but 596Hz."}, {"start": 707.86, "end": 714.1600000000001, "text": "So we can say that this band stop filter rejects the band of frequencies starting from roughly"}, {"start": 714.1600000000001, "end": 718.82, "text": "around 1kHz and up to 1.6kHz."}, {"start": 718.82, "end": 725.58, "text": "So this filter rejects around 600Hz of frequencies between these two cutoff frequencies."}, {"start": 725.58, "end": 728.98, "text": "And it passes all the frequencies which is beyond these cutoff frequencies."}, {"start": 728.98, "end": 734.2, "text": "So, now so far, this band pass and the band stop filters which we have discussed are the"}, {"start": 734.2, "end": 736.0400000000001, "text": "second order filters."}, {"start": 736.0400000000001, "end": 739.74, "text": "Because if you see the transfer function of these two filters, they will have two number"}, {"start": 739.74, "end": 741.94, "text": "of poles in the denominator."}, {"start": 741.94, "end": 747.22, "text": "And in another way if you see, these two filters had two number of reactive components in their"}, {"start": 747.22, "end": 748.22, "text": "circuitry."}, {"start": 748.22, "end": 752.82, "text": "So in that sense also, we can say that these two filters were the second order filters."}, {"start": 752.82, "end": 758.0, "text": "So now, if you want the sharp cutoff, then we can go for the higher order filters."}, {"start": 758.0, "end": 762.98, "text": "So I hope in this video you understood about this band pass as well as the band stop filter."}, {"start": 762.98, "end": 767.22, "text": "So if you have any question or suggestion, please let me know in the comment section below."}, {"start": 767.22, "end": 771.82, "text": "If you like this video, hit the like button and subscribe to the channel for more such videos."}, {"start": 771.82, "end": 774.84, "text": "That's good."}, {"start": 774.84, "end": 776.0, "text": "I will see you playing here."}, {"start": 776.0, "end": 777.6400000000001, "text": "Bye."}, {"start": 777.6400000000001, "end": 778.22, "text": "Cool."}, {"start": 778.22, "end": 780.2600000000001, "text": "Bye."}, {"start": 780.98, "end": 782.46, "text": "Bye."}, {"start": 782.46, "end": 783.6, "text": "Forward."}, {"start": 784.9200000000001, "end": 785.4200000000001, "text": "Bye."}, {"start": 785.4200000000001, "end": 787.2, "text": "Bye."}, {"start": 787.34, "end": 787.5, "text": "Bye."}, {"start": 787.5, "end": 787.6600000000001, "text": "Bye."}, {"start": 788.1, "end": 788.8000000000001, "text": "Bye."}, {"start": 788.8000000000001, "end": 789.98, "text": "Bye."}, {"start": 789.98, "end": 790.1400000000001, "text": "Bye."}, {"start": 790.1400000000001, "end": 790.5, "text": "Bye."}, {"start": 790.5, "end": 790.74, "text": "Bye."}, {"start": 791.0200000000001, "end": 791.84, "text": "Bye."}, {"start": 791.84, "end": 792.72, "text": "Bye."}, {"start": 792.72, "end": 793.32, "text": "Bye."}, {"start": 793.32, "end": 793.7800000000001, "text": "Bye."}, {"start": 793.7800000000001, "end": 794.0600000000001, "text": "Bye."}, {"start": 794.0600000000001, "end": 794.38, "text": "Bye."}, {"start": 794.5600000000001, "end": 795.08, "text": "Bye."}, {"start": 795.08, "end": 795.5600000000001, "text": "Bye."}, {"start": 795.5600000000001, "end": 795.9000000000001, "text": "Bye."}, {"start": 795.9000000000001, "end": 797.0, "text": "Bye."}, {"start": 797.0, "end": 797.5200000000001, "text": "Bye."}, {"start": 797.5400000000001, "end": 797.84, "text": "Bye."}, {"start": 797.84, "end": 799.48, "text": "Bye."}, {"start": 799.48, "end": 800.0600000000001, "text": "Bye."}, {"start": 800.1400000000001, "end": 800.1800000000001, "text": "Bye."}, {"start": 800.3000000000001, "end": 800.82, "text": "Bye."}, {"start": 800.9000000000001, "end": 801.8000000000001, "text": "Bye."}]}