{"video_id": "dQeNONerxEU", "url": "https://www.youtube.com/watch?v=dQeNONerxEU", "title": "dQeNONerxEU", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 20.0, "text": "Music"}, {"start": 20.0, "end": 23.0, "text": "No! God, please no! No!"}, {"start": 23.0, "end": 24.0, "text": "No!"}, {"start": 24.0, "end": 25.0, "text": "No!"}, {"start": 25.0, "end": 30.0, "text": "It needs to attach a GPS to it. Like I'll find my drone."}, {"start": 30.0, "end": 31.0, "text": "Found it!"}, {"start": 35.0, "end": 37.0, "text": "That was far as fun."}, {"start": 37.0, "end": 38.0, "text": "That was far, right?"}, {"start": 38.0, "end": 41.0, "text": "That's why I was like, I can't hear it. Where is it?"}, {"start": 41.0, "end": 42.0, "text": "I heard it that way."}, {"start": 42.0, "end": 46.0, "text": "It started going RX lost, which means that I'm about to fall out of the sky."}, {"start": 46.0, "end": 51.0, "text": "Hey guys, this is SupaFPV here, and today's video is all about this little gadget right here."}, {"start": 51.0, "end": 52.0, "text": "This little lifesaver."}, {"start": 52.0, "end": 55.0, "text": "And it is a GPS."}, {"start": 55.0, "end": 58.0, "text": "Essentially, it will do two things."}, {"start": 58.0, "end": 62.0, "text": "Show you where your drone is in relation to your start point."}, {"start": 62.0, "end": 72.0, "text": "And it can also have the function to bring back to your original location by flipping a switch on your controller."}, {"start": 72.0, "end": 74.0, "text": "So if you're interested, stick around."}, {"start": 74.0, "end": 79.0, "text": "And just before we start the video, consider subscribing if you want more content like this."}, {"start": 79.0, "end": 85.0, "text": "And if you guys have any other video ideas, please do comment down below and I'll try to work hard to make one of those ideas."}, {"start": 85.0, "end": 87.0, "text": "Or a few of those ideas or all of them."}, {"start": 87.0, "end": 93.0, "text": "So this is the BN220 dual GPS GLONASS module by Bishin."}, {"start": 93.0, "end": 94.0, "text": "And who is this meant for?"}, {"start": 94.0, "end": 98.0, "text": "This is meant for those people who are flying relatively mid to long range."}, {"start": 98.0, "end": 99.0, "text": "Long range for sure."}, {"start": 99.0, "end": 104.0, "text": "You definitely want one of these things or something more expensive like a nicer one like the BN880."}, {"start": 104.0, "end": 117.0, "text": "But for those of us like me who fly a relatively mid to half long range ish, definitely in areas like you saw in my video in the clip in the beginning where I was flying above the treetops and on top of a lake."}, {"start": 117.0, "end": 119.0, "text": "And everything kind of looked the same."}, {"start": 119.0, "end": 120.0, "text": "Even the landing areas look the same."}, {"start": 120.0, "end": 122.0, "text": "And all the trees look the same."}, {"start": 122.0, "end": 124.0, "text": "And the ridge line looked the same."}, {"start": 124.0, "end": 125.0, "text": "And I was just like, where am I?"}, {"start": 125.0, "end": 126.0, "text": "What the crap is going on?"}, {"start": 126.0, "end": 128.0, "text": "A little history on that video."}, {"start": 128.0, "end": 134.0, "text": "I was flying at the lake in Austin and I flew kind of far over the lake."}, {"start": 134.0, "end": 143.0, "text": "And then I was trying to come back and none of us in my group of seven could hear the drone to ascertain where on earth it was."}, {"start": 143.0, "end": 144.0, "text": "Was it to the right of us?"}, {"start": 144.0, "end": 145.0, "text": "Was it to the left of us?"}, {"start": 145.0, "end": 146.0, "text": "We had no clue."}, {"start": 146.0, "end": 154.0, "text": "I eventually just landed in the middle of a field and split into two parties and we just went out and searched for it."}, {"start": 154.0, "end": 159.0, "text": "And again, as my friend said, you should you should put a GPS on it, like find my phone kind of thing."}, {"start": 159.0, "end": 161.0, "text": "And that's exactly what this does."}, {"start": 161.0, "end": 168.0, "text": "So if you're interested, again, stick around and I'll show you how to put together this onto your drone and set it all up."}, {"start": 168.0, "end": 173.0, "text": "And again, this is meant for those people who fly relatively mid to long range."}, {"start": 173.0, "end": 182.0, "text": "And it's really nice to have definitely not a need to have if you're flying mid range, but definitely must have if you're flying long range."}, {"start": 182.0, "end": 190.0, "text": "Not necessarily if you're flying mid range, but if you're flying long range, you definitely want one of these or another variant of this if you want."}, {"start": 190.0, "end": 200.0, "text": "So the reason I chose the 220 over the 80 is because I don't need the additional functions of the 80 in the 220 will do just fine for my purposes."}, {"start": 200.0, "end": 206.0, "text": "So to give you a little size perspective and a little physical dimension perspective, this is it right next to a quarter."}, {"start": 206.0, "end": 215.0, "text": "It's pretty dang small and you can probably squeeze this into any part of your drone, preferably on top of your drone."}, {"start": 215.0, "end": 217.0, "text": "We'll talk about that in a little bit."}, {"start": 217.0, "end": 225.0, "text": "So what exactly comes inside the box or a slash or bag of the the the GPS module?"}, {"start": 225.0, "end": 237.0, "text": "It comes with two cables, one with connectors like four separate connectors, and then one with an actual like solid connector with all the four wires connected into one one one pole."}, {"start": 237.0, "end": 246.0, "text": "And it also comes with three M sticky double sided adhesive pad so you can put it on top of your drone or wherever you want on your drone."}, {"start": 246.0, "end": 247.0, "text": "That's all you really need in the bag."}, {"start": 247.0, "end": 252.0, "text": "But I would have liked some sort of a manual to know which wires do which."}, {"start": 252.0, "end": 256.0, "text": "But I will explain that to you guys when we start putting it onto my drone."}, {"start": 256.0, "end": 259.0, "text": "So how much does this GPS module go for this is the BN 220."}, {"start": 259.0, "end": 265.0, "text": "So the mid range one of the ones that the BUSH makes on Amazon currently it is 1489."}, {"start": 265.0, "end": 269.0, "text": "As of the time I'm making this video, I have it open up on my phone right now."}, {"start": 269.0, "end": 272.0, "text": "It's 1489."}, {"start": 272.0, "end": 273.0, "text": "It can go up."}, {"start": 273.0, "end": 276.0, "text": "I've seen it go up to like 16 bucks on Banggood."}, {"start": 276.0, "end": 283.0, "text": "I think you can get these for like 10 to 12 dollars if you want to wait the time to get it shipped to the United States or wherever you're living."}, {"start": 283.0, "end": 289.0, "text": "And then the BN 880 I believe is like 17 to 18 bucks if you want the additional functionalities that come with that."}, {"start": 289.0, "end": 293.0, "text": "And I would recommend that for like a long long range drone setup."}, {"start": 293.0, "end": 298.0, "text": "So let's hop on over to the workbench and actually put this together."}, {"start": 298.0, "end": 305.0, "text": "And let me introduce you to what each of the wires do and where you should put it on your your drone and which pads you should put it on and everything."}, {"start": 305.0, "end": 311.0, "text": "Alrighty. Now that I'm on my workbench, the audio might not sound as clear because the mic is a little distant from me."}, {"start": 311.0, "end": 318.0, "text": "But I'm going to try my best to talk as loud as I can so the mic can pick up everything and you guys can get all the information that you need."}, {"start": 318.0, "end": 321.0, "text": "So, um, here we are with my five inch drone."}, {"start": 321.0, "end": 322.0, "text": "You guys have seen this before."}, {"start": 322.0, "end": 325.0, "text": "And let's talk about placement of the GPS."}, {"start": 325.0, "end": 329.0, "text": "Alright, so the GPS people like to put it all over the quad."}, {"start": 329.0, "end": 335.0, "text": "Um, and where I'm going to be putting it is right here, but with the GPS actually facing up."}, {"start": 335.0, "end": 340.0, "text": "So on top of my actual quad, the bat, my batteries are usually about this big."}, {"start": 340.0, "end": 345.0, "text": "So, uh, I'm going to try to run a wire through that little hole around there and then mount it over here."}, {"start": 345.0, "end": 349.0, "text": "But I've seen people do, uh, putting it on top of their GoPro mount."}, {"start": 349.0, "end": 355.0, "text": "Uh, and I've seen people making 3D printed, uh, pieces so that they can mount the GPS to the back."}, {"start": 355.0, "end": 357.0, "text": "And I've also seen people putting it on their arms."}, {"start": 357.0, "end": 366.0, "text": "Um, I think the arms should be the last option because, um, if the propeller decides to just bend a little bit in a crash and you pick it up."}, {"start": 366.0, "end": 372.0, "text": "Or like you, uh, you turtle mode your, uh, your, your quad and then, um, fly back."}, {"start": 372.0, "end": 377.0, "text": "It could damage the GPS or cut the wiring and cause a short circuit."}, {"start": 377.0, "end": 379.0, "text": "So I would recommend not doing that."}, {"start": 379.0, "end": 385.0, "text": "Uh, in my situation, I think it's best that I put it here because everything's really crammed inside the, uh, quad."}, {"start": 385.0, "end": 397.0, "text": "And you don't, you do not want it to the antenna to be, um, the antenna of the GPS to be, uh, uh, interfered, uh, by the carbon of the quad."}, {"start": 397.0, "end": 405.0, "text": "So you don't really want to cram it inside because that'll, uh, that'll interfere with the signal coming from the satellites to the sensor right here."}, {"start": 405.0, "end": 414.0, "text": "Uh, so, uh, for my situation, again, I'm going to put it right there, try to run the wires through the, the top plate and, uh, hook it on into the quad."}, {"start": 414.0, "end": 423.0, "text": "Uh, but again, you could, uh, be fancy and 3d mount something, uh, or 3d print something over here, uh, or under here."}, {"start": 423.0, "end": 433.0, "text": "Uh, as long as then the satellites have like a no obstruction signal that can be, uh, reached to the, to the front of it."}, {"start": 433.0, "end": 436.0, "text": "Again, people have done over on top of, on top of their GoPro mounts."}, {"start": 436.0, "end": 442.0, "text": "People have had like loose wires, so then they could put the battery on and then put the GPS on top, which I would not suggest"}, {"start": 442.0, "end": 446.0, "text": "because in case of, uh, like the battery ripping out, you are in for a bad time."}, {"start": 446.0, "end": 448.0, "text": "Uh, so that's that."}, {"start": 448.0, "end": 451.0, "text": "Uh, so again, I'm going to put it, be putting it right here."}, {"start": 451.0, "end": 459.0, "text": "Uh, I'm going to take off the entire, uh, uh, all my, uh, screws and then I'll be back, uh, with the zoomed in perspective."}, {"start": 459.0, "end": 462.0, "text": "So we can see what exactly we're doing on the flight controller."}, {"start": 462.0, "end": 466.0, "text": "So we have everything all opened up, uh, and ready to go."}, {"start": 466.0, "end": 468.0, "text": "First off, I want to apologize for the focus."}, {"start": 468.0, "end": 475.0, "text": "I actually have it on manual focus and I believe it's in focus, but, uh, cause the, the auto focus kept, uh, screwing up on me."}, {"start": 475.0, "end": 477.0, "text": "And, uh, the table is kind of wobbly."}, {"start": 477.0, "end": 479.0, "text": "So everything's kind of, kind of weird."}, {"start": 479.0, "end": 483.0, "text": "Um, so I do want to apologize for, for any like quality issues."}, {"start": 483.0, "end": 486.0, "text": "Uh, so, uh, we, uh, let's talk about the wires real quick."}, {"start": 486.0, "end": 487.0, "text": "We have a red wire."}, {"start": 487.0, "end": 493.0, "text": "Uh, we have a green wire and then we have a white wire and a black wire."}, {"start": 493.0, "end": 494.0, "text": "Let's talk about the red wire."}, {"start": 494.0, "end": 496.0, "text": "The red wire is your five volt power."}, {"start": 496.0, "end": 500.0, "text": "So you want to wire this to a five volt pad on your flight controller."}, {"start": 500.0, "end": 504.0, "text": "You have the white wire, which is your TX pad."}, {"start": 504.0, "end": 508.0, "text": "And, uh, in, you know, it's not going to go to a TX pad."}, {"start": 508.0, "end": 509.0, "text": "It's going to go to a TX pad."}, {"start": 509.0, "end": 511.0, "text": "It's going to go to a RX pad."}, {"start": 511.0, "end": 516.0, "text": "So the TX wire, which is a white wire goes to an RX pad."}, {"start": 516.0, "end": 519.0, "text": "So then you have your black wire, which is the ground."}, {"start": 519.0, "end": 521.0, "text": "So it goes to a ground pad."}, {"start": 521.0, "end": 527.0, "text": "And then you have your green wire, which is the RX wire and it goes to the TX pad."}, {"start": 527.0, "end": 529.0, "text": "So let's talk about that again."}, {"start": 529.0, "end": 536.0, "text": "We have the red wire, which goes to the five volt white wire that goes to the RX pad because it is the TX wire."}, {"start": 536.0, "end": 543.0, "text": "The black wire goes to ground and the green wire goes to a TX pad because it's the RX wire."}, {"start": 543.0, "end": 546.0, "text": "Uh, this wire is really long."}, {"start": 546.0, "end": 551.0, "text": "So I'm probably going to shorten it out, uh, for ease of, um, application."}, {"start": 551.0, "end": 554.0, "text": "And so I won't have any extra wire sticking out or anything."}, {"start": 554.0, "end": 559.0, "text": "Um, so yeah, uh, let's talk about which pads I'm going to use and then we can get onto soldering."}, {"start": 559.0, "end": 565.0, "text": "So this right here is a diagram of my flight controller as it is right now, as you can see all the, all the, uh,"}, {"start": 565.0, "end": 568.0, "text": "ESC related stuff is right here and that's over there."}, {"start": 568.0, "end": 570.0, "text": "So we know we're in the proper orientation."}, {"start": 570.0, "end": 577.0, "text": "I have, uh, an open UART, uh, for TX5, RX5."}, {"start": 577.0, "end": 581.0, "text": "And I also have an open UART over here for TX2 and RX2."}, {"start": 581.0, "end": 585.0, "text": "So I'm going to be using these TX2 and RX2 pads over here."}, {"start": 585.0, "end": 590.0, "text": "Uh, and I am currently using the five volt as you can see, uh, for something else."}, {"start": 590.0, "end": 594.0, "text": "So I'm going to use the five volt from down here and the ground from down here."}, {"start": 594.0, "end": 596.0, "text": "Just so these two are close together."}, {"start": 596.0, "end": 597.0, "text": "Rule of thumb."}, {"start": 597.0, "end": 601.0, "text": "You always want an open UART when you, when you do this, you don't want to use a UART that's already full."}, {"start": 601.0, "end": 605.0, "text": "My, uh, my full UARTs are, uh, the Bluetooth UART."}, {"start": 605.0, "end": 610.0, "text": "Cause I do have a Bluetooth on the F722S, uh, uh, flight controller."}, {"start": 610.0, "end": 612.0, "text": "Um, UART1 is for SBUS."}, {"start": 612.0, "end": 616.0, "text": "Uh, I have UART3 taken up and UART5 is available."}, {"start": 616.0, "end": 618.0, "text": "And UART6 is for ESC telemetry."}, {"start": 618.0, "end": 627.0, "text": "Uh, I'm going to be using UART3 or sorry, I'm going to be using UART2 since that is the one that's, uh, open for me and I have nothing, uh, on there."}, {"start": 627.0, "end": 632.0, "text": "So these, this TX2 pad is right here, RX2 pad over here."}, {"start": 632.0, "end": 636.0, "text": "And I'm going to using the ground pad, which is right here."}, {"start": 636.0, "end": 638.0, "text": "And the five volt pad, which is right here."}, {"start": 638.0, "end": 641.0, "text": "Um, again, I apologize if things are out of focus."}, {"start": 641.0, "end": 648.0, "text": "Uh, hopefully it will, I can probably put it back in focus, uh, once we actually start soldering."}, {"start": 648.0, "end": 656.0, "text": "So again, just to reiterate the wire diagram, I'm sorry if I'm repeating this too often, but it is very important that you wire it the right way, the correct way."}, {"start": 656.0, "end": 665.0, "text": "So again, this TX2 pad I'm using over here is going to be going to the green wire because the green wire is, uh, an RX wire."}, {"start": 665.0, "end": 668.0, "text": "So the RX goes to the TX pad."}, {"start": 668.0, "end": 673.0, "text": "Um, and then the next pad over here is the RX2 wire for UART2."}, {"start": 673.0, "end": 681.0, "text": "Um, that I'm going to be putting the white wire there because the RX pad, uh, has the TX wire, which is the white wire."}, {"start": 681.0, "end": 691.0, "text": "Uh, and then the red wire goes to five volt and the black wire goes to ground, just like for pretty much everything, uh, you've ever soldered onto a flight controller."}, {"start": 691.0, "end": 698.0, "text": "The red is always five volt. Well, not always, but usually it is. And in this case it is, um, the red is five volt and the black is ground."}, {"start": 698.0, "end": 707.0, "text": "So I'm going to cut everything up and, uh, get to soldering. Um, and I'll do a quick montage of that and I'll see you after it's done."}, {"start": 707.0, "end": 725.0, "text": "So there you have it. I have soldered everything into place. Again, I soldered the green wire to the TX pad, white wire to the RX pad, uh, black wire to the ground."}, {"start": 725.0, "end": 732.0, "text": "Uh, and red to the five volt. So, uh, I am done essentially, uh, with the actual hardware related stuff."}, {"start": 732.0, "end": 735.0, "text": "Now let's hop on into beta flight and, uh, show you how to set everything up."}, {"start": 735.0, "end": 738.0, "text": "So we are in beta flight now, ready to do everything that we have to do on here."}, {"start": 738.0, "end": 741.0, "text": "My quad is connected on com five and we are ready to go."}, {"start": 741.0, "end": 742.0, "text": "Uh, I'm ready to go."}, {"start": 742.0, "end": 743.0, "text": "I'm ready to go."}, {"start": 743.0, "end": 744.0, "text": "I'm ready to go."}, {"start": 744.0, "end": 745.0, "text": "I'm ready to go."}, {"start": 745.0, "end": 746.0, "text": "I'm ready to go."}, {"start": 746.0, "end": 747.0, "text": "I'm ready to go."}, {"start": 747.0, "end": 748.0, "text": "I'm ready to go."}, {"start": 748.0, "end": 749.0, "text": "I'm ready to go."}, {"start": 749.0, "end": 750.0, "text": "I'm ready to go."}, {"start": 750.0, "end": 751.0, "text": "I'm ready to go."}, {"start": 751.0, "end": 754.0, "text": "Uh, I did go through, uh, about half of it."}, {"start": 754.0, "end": 756.0, "text": "Uh, and I tried recording it before."}, {"start": 756.0, "end": 758.0, "text": "Um, and I forgot to record the audio."}, {"start": 758.0, "end": 759.0, "text": "So I'm doing this all over again."}, {"start": 759.0, "end": 763.0, "text": "That's why if you see certain tabs already, uh, clicked on, uh, it's because of that."}, {"start": 763.0, "end": 768.0, "text": "So, uh, let's go on into com five connect and we have our quad here, all connected and ready."}, {"start": 768.0, "end": 771.0, "text": "Um, the GPS logo is not showing up because I don't have a battery connected."}, {"start": 771.0, "end": 774.0, "text": "If you don't connect your body, you're going to be able to connect."}, {"start": 774.0, "end": 776.0, "text": "So, uh, let's go on into the next one."}, {"start": 776.0, "end": 778.0, "text": "So, uh, let's go on into the next one."}, {"start": 778.0, "end": 780.0, "text": "So, uh, let's go on into the next one."}, {"start": 780.0, "end": 781.0, "text": "So, uh, let's go on into the next one."}, {"start": 781.0, "end": 782.0, "text": "You'll be able to do that with your battery."}, {"start": 782.0, "end": 783.0, "text": "One, two, three, three, four, three, four."}, {"start": 783.0, "end": 784.0, "text": "If you're connected, you're connected."}, {"start": 784.0, "end": 785.0, "text": "If you don't connect your battery, it won't show up."}, {"start": 785.0, "end": 786.0, "text": "Uh, so let's go on to ports because this is the first thing you have to do."}, {"start": 786.0, "end": 789.0, "text": "Um, I have mine connected to UART 2."}, {"start": 789.0, "end": 793.0, "text": "As you saw, I connected it to TX2 and RX2."}, {"start": 793.0, "end": 794.0, "text": "That is correct."}, {"start": 794.0, "end": 795.0, "text": "Correct."}, {"start": 795.0, "end": 797.0, "text": "Uh, so we go down here to sensor input."}, {"start": 797.0, "end": 801.0, "text": "We go from disable to GPS and then we change it from auto to fifty seven thousand six hundred."}, {"start": 801.0, "end": 804.0, "text": "Cause that's the one that dislikes."}, {"start": 804.0, "end": 809.0, "text": "So what we do after that is click save and reboot and you'll hear a go."}, {"start": 809.0, "end": 809.62, "text": "There it is."}, {"start": 809.74, "end": 811.62, "text": "And now we go back and click connect."}, {"start": 812.46, "end": 814.38, "text": "Now let's go on to the configuration tab."}, {"start": 814.46, "end": 816.0, "text": "This is the next tab that we have to go to."}, {"start": 816.32, "end": 817.66, "text": "You see my craft name is SuperFPV."}, {"start": 818.22, "end": 821.6, "text": "We go down here and we click the GPS toggle on."}, {"start": 821.78, "end": 822.14, "text": "All right."}, {"start": 822.2, "end": 823.02, "text": "I had it on before."}, {"start": 823.12, "end": 826.72, "text": "So I just toggled it back on because I wanted to show you it getting toggled."}, {"start": 826.72, "end": 828.96, "text": "So GPS toggle is on."}, {"start": 829.12, "end": 835.12, "text": "And we change it from NMEAA, which is most likely where it's going to be on for you guys on Betaflight 4.2.3."}, {"start": 835.86, "end": 841.8, "text": "You change it to U-blocks and auto config turned on if you have it turned off."}, {"start": 842.2, "end": 844.3, "text": "And then ground assistance type to auto detect."}, {"start": 844.54, "end": 847.72, "text": "I remember when I did it, it was at none."}, {"start": 848.12, "end": 849.76, "text": "And then I had to change it to auto detect."}, {"start": 849.76, "end": 854.08, "text": "So then we go there, do all that, and then click save and reboot."}, {"start": 854.54, "end": 859.16, "text": "So this next part, you're going to have to plug in your battery to your quad."}, {"start": 859.3, "end": 861.12, "text": "And you want to turn on your controller."}, {"start": 861.12, "end": 879.94, "text": "Once you have your controller turned on and your battery connected, you also want to set up a switch for the GPS rescue function on your Tyrannus or whatever radio you have."}, {"start": 880.34, "end": 882.68, "text": "You want to set up the switch inside the radio first."}, {"start": 882.68, "end": 889.9, "text": "I can make a separate video on that later on when we talk about setting a beta flight for the introduction to FPV series that I have going on."}, {"start": 889.9, "end": 899.0, "text": "But if you do not know how to do that, I'll link a video in the description for you guys to see how to do that."}, {"start": 899.14, "end": 903.5999999999999, "text": "And then once you're done with that, come back over here and continue."}, {"start": 903.6, "end": 908.52, "text": "So for those of you guys already done with that step, let's go into this step."}, {"start": 908.6, "end": 911.5, "text": "So you go on to your GPS rescue, click add range."}, {"start": 912.36, "end": 921.5400000000001, "text": "And usually you have to set it to auto for the flight controller to detect which specific switch that you're toggling on and off."}, {"start": 921.54, "end": 926.26, "text": "So for mine was mine was auxiliary six on my Tyrannus QX7."}, {"start": 927.36, "end": 930.26, "text": "And I want this is the on position."}, {"start": 930.54, "end": 933.0, "text": "So that means it's it'll be toggled."}, {"start": 933.54, "end": 938.8199999999999, "text": "And then you toggle on and off to get the precise location."}, {"start": 940.26, "end": 948.04, "text": "So once you have your switch set up for GPS rescue, you want to click save and then move on to the next step."}, {"start": 948.38, "end": 951.04, "text": "The next step is going into your fail save."}, {"start": 951.04, "end": 957.06, "text": "If you do not have this fail safe option, you want to click enable expert mode and then go on from there."}, {"start": 957.86, "end": 960.5999999999999, "text": "You want to stage one and then just click GPS rescue."}, {"start": 960.78, "end": 966.3, "text": "These are the values that I use because it just seems appropriate."}, {"start": 966.86, "end": 975.06, "text": "Before I had it at land, which would mean once fail safe is activated, it would just straight up drop out of the sky."}, {"start": 975.06, "end": 984.8, "text": "Not drop like this, but it would level out and then land or like drop out of the sky in like a more gentle yet pretty quick motion."}, {"start": 984.8, "end": 992.06, "text": "Now that we have a GPS, we can activate GPS rescue automatically through fail safe."}, {"start": 993.68, "end": 1001.8199999999999, "text": "It'll it'll start to fly back towards us so we can regain signal whenever the signal is lost and fail safe activates."}, {"start": 1001.82, "end": 1003.7800000000001, "text": "So that's pretty nice to have."}, {"start": 1004.1600000000001, "end": 1009.1400000000001, "text": "You don't have to do this, but I would recommend you do if since now you have a GPS."}, {"start": 1009.14, "end": 1015.74, "text": "So click save and reboot after that and then connect back into our next step, which is setting up your OSD."}, {"start": 1016.0, "end": 1017.6, "text": "And this is how my OSD looks."}, {"start": 1017.74, "end": 1024.72, "text": "I know there's a lot of information, but these are all pertinent to getting your information from your GPS onto your screen."}, {"start": 1024.72, "end": 1029.46, "text": "So all the necessary GPS related information is down here."}, {"start": 1029.54, "end": 1035.22, "text": "You have your GPS latitude and longitude, which is the the coordinates as to where your quad is at the time."}, {"start": 1035.58, "end": 1043.98, "text": "Your GPS stats shows the amount of satellites fixated onto your GPS, your specific GPS, whether it be zero or like 20."}, {"start": 1044.4, "end": 1048.26, "text": "So the higher the number, the stronger the signal and the stronger the connection."}, {"start": 1048.8600000000001, "end": 1049.6000000000001, "text": "GPS speed."}, {"start": 1049.88, "end": 1052.22, "text": "This is the speed that your quad is flying at."}, {"start": 1052.26, "end": 1053.1200000000001, "text": "It's kind of cool to see."}, {"start": 1053.12, "end": 1059.06, "text": "I would probably not keep this on at all times unless you have a quad that can go over 100 miles per hour at that."}, {"start": 1059.3999999999999, "end": 1065.2199999999998, "text": "And you need to monitor the speed that you're going at because over 100 miles per hour is illegal in the United States for your quad to be going."}, {"start": 1066.1, "end": 1071.8999999999999, "text": "I think without a ham license or whatever licenses that you need or part 107 or whatever it's called."}, {"start": 1072.4199999999998, "end": 1074.06, "text": "So that's the GPS speed."}, {"start": 1074.2199999999998, "end": 1079.1399999999999, "text": "And then home direction is very important because this is the main reason you bought a GPS to put on your quad."}, {"start": 1079.58, "end": 1081.1999999999998, "text": "It's so you know which direction is home."}, {"start": 1081.2, "end": 1084.24, "text": "This little arrow you see right here, that's the home direction."}, {"start": 1084.3400000000001, "end": 1086.5800000000002, "text": "It'll start moving towards your your home."}, {"start": 1086.98, "end": 1089.16, "text": "And then home distance is how far you are from home."}, {"start": 1089.42, "end": 1093.32, "text": "All of this information is relative except for the GPS latitude and longitude."}, {"start": 1093.42, "end": 1093.78, "text": "That's not."}, {"start": 1093.8600000000001, "end": 1097.16, "text": "That's actually like positional accuracy to where where you are."}, {"start": 1097.16, "end": 1102.96, "text": "But all of this everything else is relative to the moment you activate or arm your quad."}, {"start": 1103.1000000000001, "end": 1103.88, "text": "You got to remember that."}, {"start": 1104.2, "end": 1110.0400000000002, "text": "So every time you arm your quad your home direction changes or your your home location changes."}, {"start": 1110.1200000000001, "end": 1115.28, "text": "So if you pick it up move it like 10 feet to your right that's your new home and then arm it that's your new home direction."}, {"start": 1115.68, "end": 1118.16, "text": "And the distance changes depending on that."}, {"start": 1118.16, "end": 1123.5, "text": "So I had this right here is the GPS speed."}, {"start": 1123.5, "end": 1125.98, "text": "As you can see it's highlighting for me GPS speed."}, {"start": 1126.14, "end": 1128.3000000000002, "text": "This is the home direction."}, {"start": 1128.92, "end": 1132.92, "text": "This is the home distance as you can see is 432 meters away from home apparently."}, {"start": 1133.0600000000002, "end": 1133.94, "text": "And my name is Joe Pilot."}, {"start": 1134.0800000000002, "end": 1134.42, "text": "It's not."}, {"start": 1134.5800000000002, "end": 1135.76, "text": "It's actually supposed to be Super FPV."}, {"start": 1136.22, "end": 1137.64, "text": "And this is the satellite link."}, {"start": 1137.8000000000002, "end": 1139.48, "text": "And this is longitude and latitude."}, {"start": 1139.96, "end": 1141.3200000000002, "text": "This is how I have mine set up."}, {"start": 1141.4, "end": 1142.88, "text": "You guys can set it up whichever way you want."}, {"start": 1142.88, "end": 1145.1200000000001, "text": "And that's completely up to you."}, {"start": 1145.18, "end": 1146.2600000000002, "text": "And after that you're done."}, {"start": 1146.46, "end": 1147.5, "text": "And you click save."}, {"start": 1147.66, "end": 1154.5200000000002, "text": "Finally I want to go through the CLI tab and show you an introduction to a few of the commands that you might want to change."}, {"start": 1154.94, "end": 1155.98, "text": "There are a lot of commands."}, {"start": 1156.9, "end": 1162.92, "text": "And let me show you real quick what all the commands are by typing get gps underscore rescue."}, {"start": 1162.92, "end": 1164.94, "text": "And you have all these commands that show up."}, {"start": 1165.48, "end": 1168.38, "text": "And I only really care about three of these commands."}, {"start": 1168.38, "end": 1176.92, "text": "And that is gps rescue initial altitude, gps rescue minimum satellites, and gps rescue minimum distance to home."}, {"start": 1177.3400000000001, "end": 1178.96, "text": "Everything else I don't quite care about."}, {"start": 1179.0400000000002, "end": 1180.64, "text": "I am fine with default values."}, {"start": 1180.74, "end": 1184.0400000000002, "text": "You guys can go in and change them up if you would like."}, {"start": 1184.5400000000002, "end": 1194.1000000000001, "text": "Simply by typing set space and then whatever value it is and equals to whatever value you want as long as it's between the allowed range."}, {"start": 1194.1, "end": 1205.9199999999998, "text": "For the three that I mentioned, gps rescue initial altitude, this is the altitude that it will fly up to when you activate the gps rescue switch."}, {"start": 1206.1, "end": 1210.9199999999998, "text": "So for me it's 70 meters up in the air, which is plenty high enough for my area."}, {"start": 1211.3, "end": 1213.1399999999999, "text": "You guys can go all the way up to 100 if you want."}, {"start": 1213.14, "end": 1218.3200000000002, "text": "And then lastly, the last two would be gps rescue minimum satellites."}, {"start": 1218.74, "end": 1228.2800000000002, "text": "This is the minimum satellites that you can have before you're actually allowed to click the gps rescue switch and have everything working properly."}, {"start": 1228.5200000000002, "end": 1230.5800000000002, "text": "So yeah, the default value is 8."}, {"start": 1230.66, "end": 1237.46, "text": "I changed it to 5 because 8 seems like a decently too much amount."}, {"start": 1237.46, "end": 1250.82, "text": "And I want to be able to activate it whenever I want to activate it versus like if you have like since the default value was 8, if I had like 7 satellites, I wouldn't be able to rescue my drone."}, {"start": 1251.28, "end": 1253.76, "text": "So I wanted the lowest possible one."}, {"start": 1253.8600000000001, "end": 1254.38, "text": "It doesn't matter."}, {"start": 1254.6200000000001, "end": 1260.3, "text": "It's up to you guys if you want a stronger signal or a weaker signal when you activate gps rescue."}, {"start": 1261.18, "end": 1263.22, "text": "And then gps rescue minimum distance to home."}, {"start": 1263.22, "end": 1275.32, "text": "This is the minimum distance that you're allowed to fly before you are allowed or no, the minimum distance that you need to fly before you're allowed to flip the switch and actually activate gps rescue."}, {"start": 1275.96, "end": 1281.28, "text": "For me, I put it at the bare minimum, which is 50 just in case I'm flying in a very difficult area."}, {"start": 1281.68, "end": 1285.04, "text": "And even if I go 50 meters away from home, I have no idea where I am."}, {"start": 1285.42, "end": 1289.8, "text": "Like it's all broccoli once you're up there, you know, all the trees kind of just look like broccoli at that point."}, {"start": 1289.8, "end": 1293.24, "text": "So for me, I minimum distance to home, I did 50."}, {"start": 1293.78, "end": 1294.9199999999998, "text": "And that's about it."}, {"start": 1294.98, "end": 1302.76, "text": "Once you do all the value changes, be sure to type in save, enter, and then it'll save and restart your quad and everything."}, {"start": 1302.9199999999998, "end": 1303.2, "text": "All right."}, {"start": 1303.2, "end": 1311.1, "text": "So once you're done with all those steps, the final piece of the puzzle is to just take the drone outside and have like a free open space."}, {"start": 1311.1, "end": 1322.36, "text": "Like don't have any sort of like barrier between the GPS and the sky and then let it sit for about five minutes with the battery plugged in and it should automatically detect the satellites."}, {"start": 1322.5, "end": 1329.56, "text": "It takes a while for the first time you activate your GPS or like the first flight or the first area you're in."}, {"start": 1329.56, "end": 1337.32, "text": "It takes like about five minutes for it to find all the satellites and actually initiate your location and everything."}, {"start": 1337.82, "end": 1347.96, "text": "So I'd say like if you let's say you're in Texas and then you fly over to Atlanta and you're there, the GPS won't automatically like lock on or anything."}, {"start": 1347.96, "end": 1360.6200000000001, "text": "It will take a little while for you're going to have to do that whole initiation step where you sit outside for about five minutes with the battery plugged in and let it try and find the satellites and everything."}, {"start": 1360.8, "end": 1366.2, "text": "So if you don't see like if you're on your beta flight, it says like GPS fix false."}, {"start": 1366.64, "end": 1367.44, "text": "Don't be alarmed."}, {"start": 1367.54, "end": 1370.7, "text": "It's probably because you haven't let it sit enough for enough time."}, {"start": 1372.4, "end": 1374.8400000000001, "text": "So that that's probably the issue."}, {"start": 1375.2, "end": 1376.28, "text": "And that's it for that."}, {"start": 1376.28, "end": 1384.48, "text": "And next I'm gonna I'm gonna go out in the field and actually show you how everything works really quickly and then we'll end up the video."}, {"start": 1384.68, "end": 1385.1, "text": "Alrighty."}, {"start": 1385.22, "end": 1387.96, "text": "In this clip, you can see my entire OSD."}, {"start": 1388.1, "end": 1393.3799999999999, "text": "Everything that you're seeing you're seeing is what I saw when I was flying for the first time with the GPS on."}, {"start": 1393.96, "end": 1395.96, "text": "As you can see, I have 11 satellites connected."}, {"start": 1396.08, "end": 1397.46, "text": "Now it's 10 or 9, 8."}, {"start": 1397.56, "end": 1399.8799999999999, "text": "It just keeps fluctuating on the bottom right."}, {"start": 1399.88, "end": 1406.5400000000002, "text": "And then I have an arrow pointing to home on the bottom left with distance to home on the bottom left as well."}, {"start": 1406.5400000000002, "end": 1409.7, "text": "And the speed that I'm flying at and the top."}, {"start": 1409.7800000000002, "end": 1414.0800000000002, "text": "You can also see the longitude and latitude numbers."}, {"start": 1414.08, "end": 1417.52, "text": "So, I mean, that's pretty much it for the GPS."}, {"start": 1417.98, "end": 1425.74, "text": "Now, if I was to fly a certain distance, like, you know, quite far away and then click my GPS rescue button, it would automatically level out."}, {"start": 1426.12, "end": 1428.24, "text": "Toggle my GPS."}, {"start": 1428.36, "end": 1436.84, "text": "Like you would actually toggle the GPS rescue mode and start flying towards me after it reaches that altitude that I that I set in the CLI tab."}, {"start": 1436.84, "end": 1438.6, "text": "So, that's pretty much it."}, {"start": 1439.78, "end": 1441.0, "text": "Thank you so much for watching."}, {"start": 1441.08, "end": 1442.78, "text": "Remember to like, comment, and subscribe."}, {"start": 1443.0, "end": 1449.86, "text": "Remember, comment down below if you have any questions, as usual, pertaining to the topic at hand or anything else."}, {"start": 1449.8999999999999, "end": 1451.34, "text": "I'll be more than happy to answer anything."}, {"start": 1451.9599999999998, "end": 1458.84, "text": "And as well as please do comment down some ideas for future videos because I want to make videos that you guys want to watch."}, {"start": 1458.84, "end": 1463.34, "text": "I want to watch videos that I'd like to that I that I like to make, quote unquote."}, {"start": 1463.56, "end": 1469.6799999999998, "text": "But I want to make videos that you guys will watch even if I don't necessarily like to make them because I'm here for you guys."}, {"start": 1469.6799999999998, "end": 1474.56, "text": "So, yeah, comment down below, like, comment, subscribe, and have a good day."}]}