{"video_id": "ewYBc1jBDGM", "url": "https://www.youtube.com/watch?v=ewYBc1jBDGM", "title": "ewYBc1jBDGM", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 8.1, "text": "Hey guys! Welcome to Allotronics! I'm Gregory and in this video we are going to take a look on an IF amplifier with variable gain."}, {"start": 8.24, "end": 13.780000000000001, "text": "I designed this IF amplifier for an SSB transceiver where the gain can be controlled."}, {"start": 13.98, "end": 19.580000000000002, "text": "We are going to see it working here on the bench and we're going to go to the whiteboard to understand how it works."}, {"start": 19.68, "end": 21.54, "text": "Take your coffee and come with me."}, {"start": 22.72, "end": 26.42, "text": "So guys, here we have the prototype. I'm going to show it later."}, {"start": 26.42, "end": 31.340000000000003, "text": "And I'm using the tracking generator of the spectrum analyzer to plot here the gain."}, {"start": 31.340000000000003, "end": 36.08, "text": "So this trace here over frequency is the gain of the amplifier."}, {"start": 36.08, "end": 43.46, "text": "And you can see that if I change the control voltage, we can change the gain of the amplifier."}, {"start": 44.06, "end": 48.02, "text": "If I change the control voltage, we change the gain."}, {"start": 48.56, "end": 50.78, "text": "Let's go to the maximum gain here."}, {"start": 51.5, "end": 53.660000000000004, "text": "Around 28 dB."}, {"start": 53.66, "end": 58.58, "text": "And if we go down, we can reduce the gain."}, {"start": 58.58, "end": 61.379999999999995, "text": "Even having a gain lower than 0 dB."}, {"start": 61.379999999999995, "end": 65.78, "text": "So this amplifier can actually work as an attenuator also."}, {"start": 67.14, "end": 68.0, "text": "Look at this."}, {"start": 68.5, "end": 74.42, "text": "Here you can see the prototype using my favorite technique, the SPIDER technique, as I called."}, {"start": 74.42, "end": 79.56, "text": "We have the input signal here on this connector where we connected the tracking generator."}, {"start": 79.56, "end": 86.56, "text": "And this is the output connector where we are measuring the output power, plotting the gain on the spectrum analyzer."}, {"start": 86.64, "end": 87.98, "text": "Construction is very simple."}, {"start": 88.1, "end": 92.26, "text": "Using a single transistor, a BJT transistor, a BC547 here."}, {"start": 92.26, "end": 99.10000000000001, "text": "And what is important for this design is that we are using a diode as a variable resistor to control the gain."}, {"start": 99.10000000000001, "end": 107.4, "text": "This mouse signal resistance of the diode is being used as this mouse signal emitter resistor of the transistor."}, {"start": 107.4, "end": 118.32000000000001, "text": "And we can control this mouse signal resistance, changing the voltage over this 10k resistor here, generating an almost constant current on the diode."}, {"start": 118.32000000000001, "end": 130.64000000000001, "text": "And the other important thing of this design is the auto transformer on the output that is converting the fifth ohm impedance of the output to a much higher impedance to the collector of the transistor."}, {"start": 130.64, "end": 134.2, "text": "So we can get the maximum gain of this stage."}, {"start": 134.35999999999999, "end": 138.54, "text": "And guys, to plot the gain of this stage here, it's very easy."}, {"start": 138.66, "end": 143.32, "text": "We only need to go to the amplitude menu of the spectrum analyzer."}, {"start": 143.57999999999998, "end": 152.29999999999998, "text": "And we need to generate a reference offset of the same value as the power we are using on the tracking generator."}, {"start": 152.3, "end": 164.46, "text": "So if we are using negative 20 dB as the input power and we are offsetting the line 20 dB, we are actually plotting here the gain of this stage."}, {"start": 164.62, "end": 168.70000000000002, "text": "My cable setup here has 0.8 dB of attenuation."}, {"start": 169.5, "end": 171.08, "text": "So we can add it there."}, {"start": 171.22000000000003, "end": 176.9, "text": "And we're gonna have a little higher trace here because now we are compensating for the losses of the cable."}, {"start": 176.9, "end": 183.3, "text": "The assumption that the diode is working with a constant current only works for very high control voltage."}, {"start": 183.3, "end": 188.74, "text": "If the control voltage is very low, now the voltage drop over the diode becomes significant."}, {"start": 188.74, "end": 196.74, "text": "And of course, if we have changes in the diode temperature, we are going to have changes on the current and on the gain of this stage."}, {"start": 196.74, "end": 200.26, "text": "Here I configure this stage for a very low gain, 5 dB."}, {"start": 200.26, "end": 203.86, "text": "And take a look at what happens if I touch the diode hitting it."}, {"start": 203.86, "end": 208.58, "text": "Take a look at the gain increasing."}, {"start": 210.98000000000002, "end": 216.58, "text": "So for controlling the gain of this stage with precision, we need a constant current source."}, {"start": 216.82000000000002, "end": 224.10000000000002, "text": "Using this, I will have very precise gain control, so I can grab some data of the amplifier to show you in the next video."}, {"start": 224.10000000000002, "end": 227.94000000000003, "text": "I wanna plot the third order intercept, the 1 dB compression point."}, {"start": 227.94, "end": 235.06, "text": "And for this, we need to have very well controlled current to stabilize the gain in a precise level of the measurement."}, {"start": 235.06, "end": 239.7, "text": "And you can see that I thermocoupled the three transistors of the current source."}, {"start": 239.7, "end": 242.82, "text": "And this approach here worked very well."}, {"start": 242.82, "end": 243.94, "text": "Very well. Very nice."}, {"start": 243.94, "end": 247.06, "text": "So guys, let's understand how the circuit works."}, {"start": 247.06, "end": 250.5, "text": "And as we can see here, it's a very simple circuit."}, {"start": 250.5, "end": 254.18, "text": "A single BJT amplifier, common emitter amplifier."}, {"start": 254.18, "end": 261.7, "text": "But I played some tricks here to have its gain controlled by a voltage or actually by a current."}, {"start": 261.7, "end": 267.38, "text": "As we are using this mouse signal resistance of the diode as a variable resistor,"}, {"start": 267.38, "end": 270.82, "text": "actually the gain here is controlled by current."}, {"start": 270.82, "end": 272.02, "text": "Very interesting."}, {"start": 272.02, "end": 278.74, "text": "Because the resistance, the mouse signal resistance of the diode is proportional to current."}, {"start": 278.74, "end": 280.26, "text": "Actually, it is inverted."}, {"start": 280.26, "end": 285.06, "text": "As the current increases, the mouse signal resistance decreases."}, {"start": 285.06, "end": 287.38, "text": "We see that we have a very simple circuit."}, {"start": 287.38, "end": 294.26, "text": "We have the 5th ohm output here being transformed to a higher impedance to the collector."}, {"start": 294.26, "end": 300.09999999999997, "text": "We are going to understand why I did this and how the turn ratio of this auto transformer was"}, {"start": 300.09999999999997, "end": 300.65999999999997, "text": "chosen."}, {"start": 300.65999999999997, "end": 308.18, "text": "And we have common biasing of the transistor here with a voltage divider generating a constant voltage"}, {"start": 308.18, "end": 313.06, "text": "over the base, generating an almost constant voltage on the emitter."}, {"start": 313.06, "end": 319.14, "text": "So we can control the current of the amplifier using an emitter resistor."}, {"start": 319.14, "end": 326.74, "text": "This resistance here is controlling the stage current that I'm using here, 12 milliamps."}, {"start": 326.74, "end": 330.74, "text": "So we know that here we have 12 milliamps."}, {"start": 330.74, "end": 332.9, "text": "And why 12 milliamps guys?"}, {"start": 332.9, "end": 339.94, "text": "This comes a little more from experience because I have developed a lot of amplifiers like this one."}, {"start": 339.94, "end": 346.34, "text": "And I know really by experience by going to the bench that it works very very well with 12 milliamps."}, {"start": 346.34, "end": 353.62, "text": "Actually something between 10 and 12 milliamps works very well for this kind of transistor here."}, {"start": 353.62, "end": 358.9, "text": "And guys, before we proceed, do you know why a transistor amplifier like this one amplifies?"}, {"start": 359.54, "end": 362.26, "text": "It's actually very very easy to understand."}, {"start": 362.26, "end": 368.58, "text": "We know that by the working principle, the working behavior of the transistor, the BJT transistor,"}, {"start": 368.58, "end": 374.42, "text": "is to have a very similar current on the emitter and on the collector."}, {"start": 374.42, "end": 380.02, "text": "We know that any current that flows into the collector will flow into the emitter."}, {"start": 380.02, "end": 384.58, "text": "So any current entering the collector will go out on the emitter."}, {"start": 384.58, "end": 387.38, "text": "And we have very little current on the base."}, {"start": 387.38, "end": 395.14, "text": "So we can assume here that any current flowing here on the emitter will be flowing here on the collector."}, {"start": 395.14, "end": 401.7, "text": "And knowing this first order behavior, it's very easy to see that this setup here will amplify"}, {"start": 401.7, "end": 407.06, "text": "if we place different impedance on the emitter and on the collector."}, {"start": 407.06, "end": 410.02, "text": "Because the same current will flow on both."}, {"start": 410.02, "end": 414.74, "text": "So if we have here 39 ohms, let's say we don't have this inductor here."}, {"start": 414.74, "end": 417.38, "text": "We have here 39 ohms on the emitter."}, {"start": 417.38, "end": 425.06, "text": "Any voltage fluctuation here will generate a current fluctuation on this resistor here."}, {"start": 425.06, "end": 428.66, "text": "And this current here will flow on the collector."}, {"start": 428.66, "end": 436.42, "text": "So if I place a 10 times higher resistor here, I'm gonna have 10 times higher voltage here."}, {"start": 436.42, "end": 440.90000000000003, "text": "Because the resistor here is transforming the current on voltage."}, {"start": 440.9, "end": 444.73999999999995, "text": "And we have the same current on the collector than in the emitter."}, {"start": 444.73999999999995, "end": 451.94, "text": "So it becomes very clear that an approximation for the gain of any common emitter amplifier"}, {"start": 451.94, "end": 457.62, "text": "is the ratio between the collector impedance and the emitter impedance."}, {"start": 457.62, "end": 465.46, "text": "The emitter impedance will set the current flowing here by the fluctuation in voltage on the base."}, {"start": 465.46, "end": 469.14, "text": "Imagine the signal changing here the voltage of the base."}, {"start": 469.14, "end": 475.29999999999995, "text": "Changing in voltage of the base will appear here as a changing in voltage of the emitter."}, {"start": 475.29999999999995, "end": 476.09999999999997, "text": "Okay?"}, {"start": 476.09999999999997, "end": 482.41999999999996, "text": "Because we have a constant voltage drop, this fluctuation here of voltage will generate"}, {"start": 482.41999999999996, "end": 487.14, "text": "a current fluctuation here on the impedance of the emitter."}, {"start": 487.14, "end": 491.62, "text": "And the same current fluctuation will happen here on the collector."}, {"start": 491.62, "end": 498.74, "text": "So if the impedance are different, of course the voltage here can be higher than the input voltage."}, {"start": 498.74, "end": 499.38, "text": "Very nice."}, {"start": 499.94, "end": 503.86, "text": "Understanding this behavior, it becomes very clear what I did here."}, {"start": 503.86, "end": 508.9, "text": "I first placed an inductor in series with this resistor here."}, {"start": 508.9, "end": 516.18, "text": "So now any AC fluctuation of voltage will see a very high impedance here."}, {"start": 516.18, "end": 518.26, "text": "Much more than 10 kilo ohms."}, {"start": 518.26, "end": 523.4599999999999, "text": "Because this inductor here for AC will have very high impedance."}, {"start": 523.4599999999999, "end": 526.5, "text": "So this transistor will not work as an amplifier."}, {"start": 526.5, "end": 532.34, "text": "Because any AC voltage here will not generate fluctuations of current here,"}, {"start": 532.34, "end": 534.5799999999999, "text": "because the impedance is very high."}, {"start": 534.58, "end": 540.58, "text": "So we don't have any fluctuation of current here on the collector and we have no amplification."}, {"start": 540.58, "end": 548.26, "text": "But now we can AC couple a diode here only in the AC path using a capacitor here."}, {"start": 548.26, "end": 553.3000000000001, "text": "So voltage fluctuation on the base generates voltage fluctuation on the emitter."}, {"start": 553.3000000000001, "end": 561.5400000000001, "text": "And now this voltage fluctuation can generate an AC current flowing through the diode."}, {"start": 561.5400000000001, "end": 562.6600000000001, "text": "Very, very nice."}, {"start": 562.66, "end": 568.8199999999999, "text": "And remember, as we are biasing this diode here with a constant current,"}, {"start": 568.8199999999999, "end": 573.4599999999999, "text": "I gain control, IGC, I gain control."}, {"start": 573.4599999999999, "end": 579.06, "text": "This diode here is being biased, so it behaves like a resistor."}, {"start": 579.06, "end": 584.9, "text": "The small signal resistance of the diode, we're gonna call it here, AirD."}, {"start": 584.9, "end": 587.06, "text": "Small signal resistance of the diode."}, {"start": 587.06, "end": 591.06, "text": "Any fluctuation here in the base generates fluctuation in the emitter,"}, {"start": 591.06, "end": 596.3399999999999, "text": "and generates AC current on the small signal resistance of the diode."}, {"start": 596.3399999999999, "end": 601.06, "text": "And this fluctuation of current here is reflected back to the collector,"}, {"start": 601.06, "end": 603.8599999999999, "text": "and generates a signal here on the collector."}, {"start": 603.8599999999999, "end": 611.54, "text": "So using this arrangement here, the gain of the stage now is controlled by the resistance of the diode,"}, {"start": 611.54, "end": 617.6999999999999, "text": "that is controlled by the current flowing in the diode."}, {"start": 617.6999999999999, "end": 619.6999999999999, "text": "The DC current flowing in the diode."}, {"start": 619.6999999999999, "end": 625.6999999999999, "text": "So changing the voltage here, gain control, we change the biasing current of the diode,"}, {"start": 625.6999999999999, "end": 629.6999999999999, "text": "and we change the gain of the stage."}, {"start": 629.7, "end": 636.1800000000001, "text": "Before we understand the auto transformer here, let's think we have a constant resistance here."}, {"start": 636.1800000000001, "end": 641.46, "text": "It becomes very easy to see that the collector current pumped to the resistor here,"}, {"start": 641.46, "end": 644.1800000000001, "text": "will generate a voltage here on the collector."}, {"start": 644.18, "end": 650.42, "text": "So it's important to see that here is the impedance that matters to the collector."}, {"start": 650.42, "end": 655.54, "text": "The impedance at this node here is what matters for the collector of the transistor."}, {"start": 655.54, "end": 664.0999999999999, "text": "The gain of the stage here will be proportional to this impedance over the small signal resistance of the diode."}, {"start": 664.1, "end": 671.86, "text": "So the gain of the stage will be approximated by a constant, a non-ideality constant here,"}, {"start": 671.86, "end": 678.4200000000001, "text": "times the impedance of the collector over the small signal resistance of the diode."}, {"start": 678.4200000000001, "end": 682.82, "text": "That is a value proportional to the IGC."}, {"start": 682.82, "end": 688.1, "text": "If we change the current, we change the small signal resistance and we change the gain of the stage."}, {"start": 688.1, "end": 692.82, "text": "This is the gain from the base to the collector, from a signal applied here on the base,"}, {"start": 692.82, "end": 695.38, "text": "to this node here of the transistor."}, {"start": 695.38, "end": 700.1, "text": "Now let's understand why I placed here an auto transformer."}, {"start": 700.1, "end": 708.74, "text": "We can see that this capacitor here is shorting this node, so this node here actually is an AC ground, okay?"}, {"start": 709.7, "end": 717.7800000000001, "text": "And we have less turns here on the upper winding of the auto transformer than here on the bottom winding of the auto transformer."}, {"start": 717.78, "end": 729.14, "text": "So as we're gonna connect here in that side a load that has 5th ON, we have the 5th ON connected to the lower part of the auto transformer."}, {"start": 729.14, "end": 731.78, "text": "We call this the cold side."}, {"start": 731.78, "end": 735.3, "text": "Cold side because it is connected to the GND, to the ground."}, {"start": 735.3, "end": 738.42, "text": "Here on the collector we have a higher impedance."}, {"start": 738.42, "end": 743.14, "text": "So here on the collector we have a higher impedance than 5th ON."}, {"start": 743.14, "end": 744.9799999999999, "text": "And this will make sense now."}, {"start": 744.9799999999999, "end": 750.9799999999999, "text": "To bias the transistor to 12mA, I choose here to have 0.5V here,"}, {"start": 750.9799999999999, "end": 754.9799999999999, "text": "500mV of drop from the 8V supply here,"}, {"start": 754.9799999999999, "end": 756.9799999999999, "text": "and also to have here 0.5V."}, {"start": 756.9799999999999, "end": 760.9799999999999, "text": "So the voltage available here on the collector is 7V."}, {"start": 760.98, "end": 767.14, "text": "This voltage here is 7.5V."}, {"start": 767.14, "end": 773.0600000000001, "text": "The biasing voltage is the average of voltage, the DC level."}, {"start": 773.0600000000001, "end": 777.78, "text": "We have 7.5V here on the collector, 0.5V here on the emitter."}, {"start": 777.78, "end": 782.1, "text": "So we see that the voltage excursion here can be around 7V."}, {"start": 782.1, "end": 787.38, "text": "The transistor here can have its collector changed by 7V."}, {"start": 787.38, "end": 791.46, "text": "And we know that the biasing current is 12mA."}, {"start": 791.46, "end": 795.94, "text": "And for linearity reasons, I don't want the current to go to 0."}, {"start": 795.94, "end": 802.4200000000001, "text": "I want at least 2mA of current always flowing on the transistor."}, {"start": 802.4200000000001, "end": 807.86, "text": "So we can have 7V of variation and 10mA of variation."}, {"start": 807.86, "end": 814.1800000000001, "text": "Because from 12, the minimum current possible here can be only 2mA."}, {"start": 814.1800000000001, "end": 818.42, "text": "And of course guys, understanding the maximum current and voltage"}, {"start": 818.42, "end": 821.38, "text": "we can have here on the collector of the transistor,"}, {"start": 821.38, "end": 826.98, "text": "we can calculate the ideal load impedance that the collector needs to see."}, {"start": 826.98, "end": 830.34, "text": "And of course, it is the voltage over the current."}, {"start": 830.34, "end": 838.1, "text": "So the ideal Z collector will be 7V over 10mA."}, {"start": 838.1, "end": 840.98, "text": "And of course, this is 700 ohms."}, {"start": 840.98, "end": 842.1800000000001, "text": "Very interesting guys."}, {"start": 842.1800000000001, "end": 846.5, "text": "In the case of connecting 5立 directly to the collector of the transistor,"}, {"start": 846.5, "end": 849.7800000000001, "text": "we would be saturating the transistor much earlier."}, {"start": 849.7800000000001, "end": 853.62, "text": "Because the biasing condition will not have current enough"}, {"start": 853.62, "end": 858.26, "text": "to generate the maximum possible voltage drop here on the collector,"}, {"start": 858.26, "end": 860.5, "text": "to have the maximum output power."}, {"start": 860.5, "end": 861.38, "text": "Very interesting."}, {"start": 861.38, "end": 865.0600000000001, "text": "So using the proper impedance here on the collector,"}, {"start": 865.0600000000001, "end": 868.26, "text": "we're gonna have the maximum power on the output,"}, {"start": 868.26, "end": 875.7, "text": "because we are using all the current and all the voltage available on the biasing condition."}, {"start": 875.7, "end": 877.22, "text": "Very, very, very interesting."}, {"start": 877.22, "end": 881.5400000000001, "text": "And to have a transformation from 5立 to 700立,"}, {"start": 881.5400000000001, "end": 886.6600000000001, "text": "I choose here a ratio of 3 and here 7."}, {"start": 886.6600000000001, "end": 889.0600000000001, "text": "I'm not reaching exactly 700."}, {"start": 889.0600000000001, "end": 893.3000000000001, "text": "Probably we could use here 8, an N of 8."}, {"start": 893.3000000000001, "end": 894.82, "text": "But I use it 7."}, {"start": 894.82, "end": 897.14, "text": "All the other components here guys,"}, {"start": 897.14, "end": 901.46, "text": "this voltage divider here is setting a constant voltage on the base"}, {"start": 901.46, "end": 904.1, "text": "to have the constant voltage here on the emitter,"}, {"start": 904.1, "end": 906.6600000000001, "text": "the average voltage, the biasing voltage."}, {"start": 906.66, "end": 912.3399999999999, "text": "We have this resistor here setting the 12 mA biasing current,"}, {"start": 912.3399999999999, "end": 918.5, "text": "the inductor is isolating the resistor here from AC fluctuations,"}, {"start": 918.5, "end": 923.14, "text": "and in this way we can deviate all the fluctuations of current in the emitter"}, {"start": 923.14, "end": 927.78, "text": "directly to this mouse signal resistance of the diode here."}, {"start": 927.78, "end": 928.9, "text": "Very, very interesting."}, {"start": 928.9, "end": 931.62, "text": "And the autotransformer is transforming the impedance,"}, {"start": 931.62, "end": 934.66, "text": "the low impedance output to a higher impedance here,"}, {"start": 934.66, "end": 938.26, "text": "a proper impedance for the functioning of the transistor."}, {"start": 938.26, "end": 941.6999999999999, "text": "This voltage drop here, this resistance here guys,"}, {"start": 941.6999999999999, "end": 948.02, "text": "the 39立 resistor is only here to help a little more stabilizing the stage."}, {"start": 948.02, "end": 954.5799999999999, "text": "Because think with me, if the temperature here changes and the transistor tries to sink more current,"}, {"start": 954.58, "end": 960.26, "text": "the voltage here will drop and the biasing voltage will also drop to compensate a little."}, {"start": 960.26, "end": 970.26, "text": "So we use this technique where we get the voltage from the biasing divider from a voltage drop here of a series resistance."}, {"start": 970.26, "end": 974.26, "text": "This needs to be a very low resistor to have very low voltage drop here,"}, {"start": 974.26, "end": 981.14, "text": "so we are not losing power here, available power of the signal, of the output signal."}, {"start": 981.14, "end": 988.18, "text": "And here I use a 39 because I was already using 39 here on the emitter, so I use the same value here."}, {"start": 988.18, "end": 997.7, "text": "And this resistor also works as a filter, isolating a little fluctuations of voltage noise from the power supply into the stage,"}, {"start": 997.7, "end": 1003.1400000000001, "text": "and also fluctuations from this stage to the power supply."}, {"start": 1003.1400000000001, "end": 1007.86, "text": "So if we have a lot of these stages in cascade, as an example,"}, {"start": 1007.86, "end": 1015.0600000000001, "text": "it's very nice to have this air-sea filter here to isolate a little more all these stages."}, {"start": 1015.0600000000001, "end": 1017.94, "text": "Well guys, thank you for watching the video, I hope you like it."}, {"start": 1017.94, "end": 1020.74, "text": "If so, subscribe to the channel, give it a thumbs up."}, {"start": 1020.74, "end": 1025.86, "text": "And remember you can support the channel becoming a Patreon, link here on the description."}, {"start": 1025.86, "end": 1029.06, "text": "I see you in the next video of Aulatronics."}]}