{"video_id": "9fYzb1g8tzw", "url": "https://www.youtube.com/watch?v=9fYzb1g8tzw", "title": "9fYzb1g8tzw", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 8.0, "text": "Hello and welcome to the video. This is a quick video on this new quad from Darwin FPV."}, {"start": 8.24, "end": 15.02, "text": "This is the CineApe 25. Now I've looked at a few other quads from Darwin FPV and I'm always"}, {"start": 15.02, "end": 19.62, "text": "impressed because unlike some of the other people out there making these kind of ready-to-fly things,"}, {"start": 20.1, "end": 26.38, "text": "the Darwin FPV stuff is a little bit less expensive. So it's kind of in the price range"}, {"start": 26.38, "end": 31.04, "text": "of a lot more pilots but they do put a lot of thought and love into these things and this"}, {"start": 31.04, "end": 36.76, "text": "25 is the latest one. So I thought I'd get it in and we'll have a go. Now this is available in a"}, {"start": 36.76, "end": 42.54, "text": "couple of different versions. It comes with Walksnail and I've got the analog version here."}, {"start": 42.879999999999995, "end": 48.8, "text": "So it's been a while since I've reviewed an analog quad but lots of you pilots out there I know"}, {"start": 48.8, "end": 55.2, "text": "are still flying analog. Other 60% of all my viewers last time we did a poll are still flying analog and"}, {"start": 55.2, "end": 61.620000000000005, "text": "waiting for digital HD and maybe making a choice in the spring. So let me unbox this and go through"}, {"start": 61.620000000000005, "end": 65.58, "text": "the specs, talk about some of the cool stuff. Let's give it a fly and see what it's like."}, {"start": 66.68, "end": 71.2, "text": "So the big thing with this is this is like that kind of big whoop style where it has a high strength"}, {"start": 71.2, "end": 76.5, "text": "one-piece injection molded prop guard. Very useful because it means that you can bounce off stuff."}, {"start": 76.78, "end": 81.4, "text": "I've been very happy flying much closer into obstacles with this knowing that if I hit something"}, {"start": 81.4, "end": 86.9, "text": "it's just going to bounce off it rather than destroy a prop potentially snap an arm. Battery life claimed"}, {"start": 86.9, "end": 92.66000000000001, "text": "on this is up to nine minutes. We'll see what that is in a moment. I think nine minutes is optimistic,"}, {"start": 92.96000000000001, "end": 98.42, "text": "gentle flying potentially without any kind of action camera installed. So again this is the Darwin FPV"}, {"start": 98.42, "end": 106.64000000000001, "text": "Cine Ape 25. It's an X style layout. Six bladed props. Wheelbase is 112 millimeters. Dimensions of this"}, {"start": 106.64, "end": 113.02, "text": "thing isn't particularly big. It's a nice size for flying around large indoor environments and also"}, {"start": 113.02, "end": 120.46000000000001, "text": "flying outside as well. So it's about 160 by 160 by 43 millimeters. Flight controller on this is an F411"}, {"start": 120.46000000000001, "end": 129.48, "text": "base thing and it does have 30 amp 3 to 4S ESCs. I'm running mine on 4S here. Again as I said in the"}, {"start": 129.48, "end": 135.1, "text": "introduction this happens to be the analog version. Comes with a Caddx ant. Not a fan of the ant"}, {"start": 135.1, "end": 140.66, "text": "unfortunately but we'll see how it performs here in a moment with a 600 milliwatt analog VTX. But"}, {"start": 140.66, "end": 146.18, "text": "incitingly there is also a HD version which is the Caddx walk snail one which comes with the Avatar"}, {"start": 146.18, "end": 153.35999999999999, "text": "Mini 1S that I looked at recently which is a nice unit and I'm tempted maybe to put my one of those"}, {"start": 153.35999999999999, "end": 164.85999999999999, "text": "in here. Motors are 1504 3600 kV and those propellers are HQ prop T63 MMX6 propellers. Recommended"}, {"start": 164.86, "end": 172.42000000000002, "text": "battery for this is an 850 milliamp power 4S pack. They reckon you'll get about nine minutes hovering"}, {"start": 172.42000000000002, "end": 177.42000000000002, "text": "time. Realistically I think you're going to get a little bit less and I'll talk about what I got."}, {"start": 177.54000000000002, "end": 183.02, "text": "I'm using a slightly smaller battery to make it a little bit more nimble. I'm using a 650 milliamp"}, {"start": 183.02, "end": 189.24, "text": "power battery rather than the recommended 850. So let's have a very quick look at the configuration."}, {"start": 189.24, "end": 196.42000000000002, "text": "Now I can plug it into the computer. Again diff and dump going to be down below. So let's first of all"}, {"start": 196.42000000000002, "end": 201.52, "text": "plug the thing in and turn on expert mode. Have a quick look at the tabs. Ports are configured for"}, {"start": 201.52, "end": 206.10000000000002, "text": "this so the only thing we have is the serial receiver. I've got mine running on SBUS which is"}, {"start": 206.10000000000002, "end": 211.98000000000002, "text": "how it comes by default. Mine didn't come with a receiver and we've also got smart audio for the VTX as"}, {"start": 211.98, "end": 220.44, "text": "well. Configuration 8k gyro 4k pid loop frequencies. CPU load is pretty high running about 52% there at"}, {"start": 220.44, "end": 226.06, "text": "the bottom but then it's an F4 base flight controller. This is how it's set up. Pretty standard stuff here."}, {"start": 226.62, "end": 234.67999999999998, "text": "Power and battery is set like this. Seems to work okay. Failsafe is set to drop which is what you want."}, {"start": 234.68, "end": 242.84, "text": "Pid tuning as you'll see in a moment from the flying is very relaxed and gentle but for a kind"}, {"start": 242.84, "end": 249.56, "text": "of a filming mini quad like this that's exactly what you want. Although you can get quite a turn"}, {"start": 249.56, "end": 256.36, "text": "of speed out of this thing it can hoop around when you need to. Receiver again set for SBUS by default."}, {"start": 256.5, "end": 262.5, "text": "This is how it comes. You could also set it up for other stuff as well but the little cable that comes"}, {"start": 262.5, "end": 270.7, "text": "on it is kind of designed to be plugged or soldered onto an SBUS receiver. Modes are set like this. I"}, {"start": 270.7, "end": 274.34, "text": "would definitely come in here and play with the modes. This is a slightly unusual way to do it."}, {"start": 274.66, "end": 279.62, "text": "Basically auxiliary one arms it and puts it into angle so they're not expecting you to use horizon"}, {"start": 279.62, "end": 284.32, "text": "even though you can flip and roll. On-screen display looks like this. I'd definitely come in here and move"}, {"start": 284.32, "end": 290.86, "text": "things around. Everyone has their own particular way of doing it. Video transmitter for my analog version"}, {"start": 290.86, "end": 297.22, "text": "here is all set up and the tables all loaded. It's pretty much ready to rock and roll. Again dump and"}, {"start": 297.22, "end": 304.90000000000003, "text": "diff are down below if you want to go and have a look. In terms of flying. Flying is an awful lot of fun."}, {"start": 305.3, "end": 311.84000000000003, "text": "The noise level from those multi-related props is a little bit higher than I would like. It's very very"}, {"start": 311.84000000000003, "end": 317.44, "text": "kind of a high wind buzz which does mean that even when it's a reasonable distance away from you"}, {"start": 317.44, "end": 323.4, "text": "you can still hear it and if you blip the throttle then everyone in the field that you're in is going to hear it as well."}, {"start": 323.76, "end": 329.7, "text": "But it does give it quite a little bit of punch. Hovering at below 50% throttle and I'm getting about"}, {"start": 329.7, "end": 336.65999999999997, "text": "four and a half minutes out of a 650 milliamp hour pack without an action camera. I'm getting just under"}, {"start": 336.65999999999997, "end": 342.24, "text": "four minutes with an action camera. Something like a peanut or something like the Runcam Thumb Pro on the nose."}, {"start": 342.24, "end": 347.42, "text": "Obviously you're going to get a little bit more flight time if you use that 850 milliamp hour pack"}, {"start": 347.42, "end": 353.64, "text": "that's recommended. Tune is nice and gentle as we've already looked at and it does have the ability"}, {"start": 353.64, "end": 359.58, "text": "for crisp rolls and flips if you really want to. I don't think that's what it's designed for but it"}, {"start": 359.58, "end": 366.48, "text": "does show you how nimble it can be if you want to fly it in horizon or rate mode to get some more"}, {"start": 366.48, "end": 371.24, "text": "aggressive filming in tighter spaces where those protected props are going to come in handy."}, {"start": 371.24, "end": 376.88, "text": "The one thing that's letting it down is unfortunately the image from that Caddx Ant."}, {"start": 377.16, "end": 381.78000000000003, "text": "I kind of already alluded to this but I'm not a fan of the Caddx Ant. I don't think it's a particularly"}, {"start": 381.78000000000003, "end": 388.5, "text": "good camera. I don't think that it does a great job and it's performing in exactly the same way here"}, {"start": 388.5, "end": 393.5, "text": "on this model. So for me if I was getting one of these I would probably swap that out with something"}, {"start": 393.5, "end": 399.5, "text": "else or ideally I think the walks now version of this would be my preferred version and it's going to"}, {"start": 399.5, "end": 405.84, "text": "be a little bit more expensive but walks now in that 1S kit is going to give you a much nicer view"}, {"start": 405.84, "end": 410.62, "text": "and allow you to fly very close to and around stuff while still being able to see it clearly."}, {"start": 410.88, "end": 416.18, "text": "You can see here that even though I'm flying around the goal posts I'm not really getting a clear view"}, {"start": 416.18, "end": 422.1, "text": "until I'm pretty close and if I'm moving at speed I'm already going to hit it before I can correct and"}, {"start": 422.1, "end": 427.24, "text": "get out of the way. There is also a little bit of noise from the VTX here and there is a cap"}, {"start": 427.24, "end": 433.76000000000005, "text": "fitted already so they have obviously tried to sort that out but there is a little bit of"}, {"start": 433.76000000000005, "end": 438.90000000000003, "text": "interruption and problem with noise. So there's a lot of things that I like here. I like the size,"}, {"start": 439.02000000000004, "end": 443.90000000000003, "text": "I like the design, I like the optional foam bumper strip that can go around the outside that comes in"}, {"start": 443.90000000000003, "end": 448.38, "text": "the box. That means if you are flying it indoors and you bump into stuff not only you're not going to"}, {"start": 448.38, "end": 454.12, "text": "damage the quad you're also not going to damage the thing you've bumped into. Easy to get this under"}, {"start": 454.12, "end": 461.3, "text": "250 grams if that's important to you. With my 650 gram battery and the model itself I'm getting under"}, {"start": 461.3, "end": 467.64, "text": "250. Now in lots of places as soon as you add a camera the whole 250 limit kind of becomes a moot"}, {"start": 467.64, "end": 472.88, "text": "point but if that's important to you it's good to know that you can. There is obviously a room for a"}, {"start": 472.88, "end": 478.0, "text": "small action camera at the front. Again it's not a massive amount of room and it doesn't have a huge"}, {"start": 478.0, "end": 484.06, "text": "carrying capacity so Runcam Thumb Pro or something like Yucadex Peanut would be my go-tos for this."}, {"start": 484.54, "end": 488.7, "text": "Also quite a fan of the fact that they're not asking ridiculous money for this. The price of"}, {"start": 488.7, "end": 493.1, "text": "everything has gone up thanks to all the issues that we've had over the past two or three years"}, {"start": 493.1, "end": 498.4, "text": "and it does mean that more pilots can afford to get their hands on a nicely built well put together"}, {"start": 498.4, "end": 504.54, "text": "model like this. I do like the fact that they've also made the frame very easy to take apart"}, {"start": 504.54, "end": 509.58000000000004, "text": "just with one hex driver you can kind of take out a handful of screws and the whole kind of middle"}, {"start": 509.58000000000004, "end": 514.8000000000001, "text": "tower drops out which gives you access to everything if you want to play around."}, {"start": 515.62, "end": 520.2, "text": "But even though the onboard USB connector for the flight controller is hidden away inside the model"}, {"start": 520.2, "end": 524.34, "text": "you don't have to take it apart in order to plug it in. They're very cleverly thought of that and"}, {"start": 524.34, "end": 529.24, "text": "there is a USB-C connector hidden away here at the front of the model underneath where you would"}, {"start": 529.24, "end": 534.44, "text": "mount an action cam. Just peel back the rubber grommet and you can plug it into your computer and do the"}, {"start": 534.54, "end": 539.5999999999999, "text": "configuration from here. That's a really smart design decision. So there's only a couple of"}, {"start": 539.5999999999999, "end": 545.14, "text": "things to be aware of with this. First of all I'm not a fan of the FPV performance in this analog setup."}, {"start": 545.56, "end": 552.3199999999999, "text": "The HD FPV option would be my choice or potentially replacing that Caddx ant with something else."}, {"start": 552.9599999999999, "end": 559.74, "text": "It is wired for SBUS by default and lots of pilots will want to put CRSF on there so maybe that should"}, {"start": 559.74, "end": 565.74, "text": "be a consideration for Darwin FPV when they're building these things in future give you that"}, {"start": 565.74, "end": 571.16, "text": "option. It has a linear antenna at the back so be aware of that. Ideally what you want are linear"}, {"start": 571.16, "end": 577.78, "text": "antennas on your goggles. I think for the extra weight I'd personally preferred some form of very"}, {"start": 577.78, "end": 585.12, "text": "small lollipop style circular polarized. And those six blades do make for quite a high whine and quite an"}, {"start": 585.12, "end": 590.66, "text": "inefficient creation of thrust. It does keep the model nice and small but it does mean that you get"}, {"start": 590.66, "end": 596.0, "text": "shorter flight times and there is that extra little bit of noise as you're flying around. And the other"}, {"start": 596.0, "end": 601.88, "text": "thing of course is that unfortunately although Darwin FPV are obviously working very hard to keep the price"}, {"start": 601.88, "end": 607.34, "text": "within the range of most pilots because the price of the components going up the price of this stuff"}, {"start": 607.34, "end": 614.24, "text": "is as well. So in summary this is a very nice little quad. This is a great option if you want to have"}, {"start": 614.24, "end": 618.92, "text": "something that you can fly around outside, fly around indoors. The setup's really nice. The only"}, {"start": 618.92, "end": 624.8, "text": "thing that's letting this down is the performance of that FPV setup. Thank you for spending your time"}, {"start": 624.8, "end": 629.54, "text": "today watching that video. You can find me in all the usual places on social media and if you're trying"}, {"start": 629.54, "end": 634.62, "text": "to learn about a subject then check out the playlist. All of my videos are organized into easy to follow"}, {"start": 634.62, "end": 639.12, "text": "playlists that if you're trying to learn a topic will take you from the basics right the way through to"}, {"start": 639.12, "end": 641.12, "text": "some pretty advanced stuff."}]}