{"video_id": "CAYKno16weE", "url": "https://www.youtube.com/watch?v=CAYKno16weE", "title": "CAYKno16weE", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 9.36, "text": "So in this video I'm going to be talking about how you can choose the correct size capacitor and full bridge rectifier to convert AC into DC power."}, {"start": 9.36, "end": 31.2, "text": "So in a previous video I was discussing transformers and also I stated the fact I needed to rectify the AC power from my transformer here to DC for an up and coming project."}, {"start": 31.2, "end": 50.379999999999995, "text": "And that's what we're going to discuss in this video. I'm going to discuss how you can choose the correct capacitor and also full bridge rectifier and I'm going to go into a little bit of basic detail what these components do and how you can choose the correct voltage and capacitance etc for your specific application."}, {"start": 50.94, "end": 56.78, "text": "So let's get into the video. So the first component I'm going to talk about is the full bridge rectifier."}, {"start": 56.78, "end": 64.14, "text": "So what is a full bridge rectifier? Well in a nutshell its job is to convert AC to DC power."}, {"start": 64.8, "end": 71.56, "text": "If we look at the top of this example you can see we've got in two corners hyphen squiggle marks."}, {"start": 72.14, "end": 79.18, "text": "This is for the AC power input. Doesn't matter which side goes to live or neutral or the output from your transformer."}, {"start": 79.18, "end": 88.62, "text": "And then on the other two corners we've got a plus and minus symbol and this is for our now rectified DC power output."}, {"start": 89.26, "end": 97.04, "text": "So our input power would go on these two junctions here and then we'd get DC power between these two points here."}, {"start": 97.72, "end": 101.68, "text": "But looking at this package it's a bit confusing to see what's going on."}, {"start": 101.68, "end": 108.80000000000001, "text": "What's inside a full bridge rectifier like that is actually a set of diodes in this configuration."}, {"start": 109.74000000000001, "end": 116.48, "text": "So a full bridge rectifier is nothing more than four diodes configured to rectify AC power into DC."}, {"start": 117.34, "end": 128.16, "text": "So much like the package over here that's a full bridge rectifier we have two inputs for AC and then we get positive and negative on these two outputs here."}, {"start": 128.16, "end": 138.16, "text": "And in a nutshell a diode if you don't know what it does is a semiconductor which allows electricity to flow in one direction and then blocks it coming back from the other."}, {"start": 139.3, "end": 146.6, "text": "So now let's move on to how to choose the correct diode or full bridge rectifier for your application."}, {"start": 147.0, "end": 154.96, "text": "So this is the full bridge rectifier I chose to rectify the power output from my transformer I showed earlier for my up and coming project."}, {"start": 154.96, "end": 160.04000000000002, "text": "And now I want to discuss how I went about choosing this full bridge rectifier."}, {"start": 160.44, "end": 172.48000000000002, "text": "We need to look at how much voltage it can handle, how much current it can handle as well as how much heat is going to be generated when max current is passing through this full bridge rectifier."}, {"start": 173.02, "end": 179.38, "text": "So we need to find the data sheet for whatever full bridge rectifier or indeed diode you choose to use."}, {"start": 179.82, "end": 183.34, "text": "So now let's go have a look at the data sheet for this full bridge rectifier."}, {"start": 183.34, "end": 186.68, "text": "So here I have the data sheet for my full bridge rectifier."}, {"start": 186.94, "end": 198.06, "text": "If we scroll down we're going to take a look at the maximum reverse voltage, maximum average forward current and forward voltage drop."}, {"start": 198.38, "end": 199.82, "text": "And this is all the symbols for them."}, {"start": 200.08, "end": 204.18, "text": "VRRM, IF and also VF."}, {"start": 205.38, "end": 207.92000000000002, "text": "So let's start off by looking at the voltage."}, {"start": 207.92, "end": 217.23999999999998, "text": "So once the power has been rectified, my full bridge rectifier is going to output 70 volts DC or thereabout."}, {"start": 217.77999999999997, "end": 220.92, "text": "And I typically like to add around 20 to 30% headroom."}, {"start": 221.94, "end": 227.0, "text": "So I am looking for a full bridge rectifier that is around about 100 volts or more."}, {"start": 227.56, "end": 229.72, "text": "And the model I bought is a Dash 01."}, {"start": 229.72, "end": 234.22, "text": "So I bought a full bridge rectifier that is rated for 100 volts."}, {"start": 234.44, "end": 235.56, "text": "So we're all good there."}, {"start": 236.2, "end": 240.9, "text": "The next thing to look at is how much current we're going to need to draw from our full bridge rectifier."}, {"start": 241.46, "end": 245.98, "text": "Now my transformer can output 10 amps continuous."}, {"start": 246.76, "end": 250.96, "text": "And again I typically like to add about 20 to 30% headroom minimum."}, {"start": 250.96, "end": 255.06, "text": "So the model I bought is a GBPC15."}, {"start": 255.46, "end": 258.46000000000004, "text": "So therefore it's rated for 15 amps continuous."}, {"start": 259.16, "end": 260.88, "text": "So again we're all good there."}, {"start": 261.5, "end": 265.58, "text": "The next thing we need to look at is the forward voltage drop or VF."}, {"start": 266.38, "end": 269.04, "text": "Now this is rated at 1.1 volts."}, {"start": 269.2, "end": 270.76, "text": "Now what is a forward voltage drop?"}, {"start": 271.28000000000003, "end": 275.98, "text": "Well any diode typically has a voltage drop across it."}, {"start": 275.98, "end": 282.40000000000003, "text": "So what that means is if we put power through it we're going to get slightly less power out of it."}, {"start": 282.56, "end": 284.0, "text": "We're going to get a voltage drop."}, {"start": 284.08000000000004, "end": 286.14000000000004, "text": "And in this case it's 1.1 volts."}, {"start": 286.72, "end": 288.68, "text": "Now why is this important to consider?"}, {"start": 289.46000000000004, "end": 290.58000000000004, "text": "Well two things."}, {"start": 290.96000000000004, "end": 296.42, "text": "If you expected to put in 5 volts to your full bridge rectifier and you're going to get 5 volts out."}, {"start": 296.96000000000004, "end": 298.24, "text": "That's sadly not the case."}, {"start": 298.42, "end": 303.88, "text": "If you put 5 volts in you're going to get 3.9 volts out."}, {"start": 303.88, "end": 307.34, "text": "You're going to see that 1.1 volt drop."}, {"start": 308.04, "end": 310.0, "text": "Irrespective of the input voltage."}, {"start": 311.02, "end": 318.6, "text": "Also we need to look at how much heat we're going to need to dissipate from the full bridge rectifier."}, {"start": 318.84, "end": 320.98, "text": "We might have to consider adding a heat sink."}, {"start": 321.74, "end": 326.26, "text": "So we all know that voltage times current equals watts."}, {"start": 326.26, "end": 335.52, "text": "So what I'm going to do is calculate how many watts of heat is going to be generated if I pass the full 15 amps of current through my full bridge rectifier."}, {"start": 335.82, "end": 341.32, "text": "So to calculate that I'm going to first enter in my VF or forward voltage drop."}, {"start": 341.53999999999996, "end": 344.94, "text": "Which in this case for my full bridge rectifier is 1.1 volts."}, {"start": 345.52, "end": 350.08, "text": "And I'm going to times that by the maximum current of the full bridge rectifier."}, {"start": 350.2, "end": 351.56, "text": "In this case 15 amps."}, {"start": 351.56, "end": 353.06, "text": "I'm going to hit equals."}, {"start": 353.86, "end": 361.54, "text": "And therefore we're going to get 16.5 watts of heat generated from our full bridge rectifier at maximum current."}, {"start": 362.02, "end": 363.36, "text": "And this isn't to be ignored."}, {"start": 363.5, "end": 369.86, "text": "That is going to be quite a significant amount of heat if it's sustained for a long time at 15 amps."}, {"start": 369.94, "end": 373.44, "text": "So we should consider adding a heat sink to our full bridge rectifier."}, {"start": 373.44, "end": 379.84, "text": "We can also see that the manufacturer had in mind that this full bridge rectifier is going to generate a bit of heat."}, {"start": 379.98, "end": 382.7, "text": "By the fact that we've got a metal surface here."}, {"start": 383.3, "end": 389.74, "text": "And what we can do is get a heat sink and we can bolt this full bridge rectifier to it with a bit of thermal compound."}, {"start": 389.96, "end": 396.04, "text": "To help dissipate the heat generated when we're pulling the full load through this full bridge rectifier."}, {"start": 396.46, "end": 398.94, "text": "So now let's move on to capacitors."}, {"start": 398.94, "end": 408.36, "text": "So the type of capacitors we're going to be shopping for to smooth out the power from our full bridge rectifier are called electrolytic capacitors."}, {"start": 408.92, "end": 412.72, "text": "Now this capacitor has two ratings listed here."}, {"start": 413.18, "end": 416.26, "text": "50 volts and 4700 microfarads."}, {"start": 416.76, "end": 418.18, "text": "So let's discuss these figures."}, {"start": 418.18, "end": 423.8, "text": "So 50 volts is the peak voltage this capacitor is rated to handle."}, {"start": 423.96, "end": 427.7, "text": "Any more than that and you risk damaging or even exploding the capacitor."}, {"start": 428.02, "end": 429.0, "text": "Which can be quite fun."}, {"start": 429.7, "end": 432.36, "text": "But not if you want a reliable power supply."}, {"start": 432.6, "end": 433.68, "text": "Then it's bad."}, {"start": 434.54, "end": 444.78000000000003, "text": "So again we're going to be looking for a capacitor that is around about 20 to 30% rated higher voltage than the voltage we're going to be running."}, {"start": 444.78, "end": 450.96, "text": "So in my case it makes sense to buy a capacitor that's rated for 100 volts or higher."}, {"start": 451.34, "end": 453.64, "text": "Next up we're going to be looking at capacity."}, {"start": 453.9, "end": 459.08, "text": "So 4700 microfarads is the capacitance of this capacitor I've got here."}, {"start": 459.32, "end": 462.64, "text": "But how do we choose what size capacitor we need?"}, {"start": 463.05999999999995, "end": 469.09999999999997, "text": "Well this is based on the frequency of the AC power rectifying."}, {"start": 469.1, "end": 476.02000000000004, "text": "The amount of current we're going to be drawing as well as the acceptable voltage drop."}, {"start": 476.58000000000004, "end": 483.62, "text": "So when power is rectified into DC after our full bridge rectifier it's not actually smooth."}, {"start": 484.22, "end": 487.08000000000004, "text": "There's momentary lapses where there's no power."}, {"start": 487.84000000000003, "end": 491.90000000000003, "text": "And what that means is we've got power, no power, power, no power."}, {"start": 491.9, "end": 494.5, "text": "And we're going to not get a smooth voltage."}, {"start": 494.73999999999995, "end": 496.29999999999995, "text": "It's going to have ripples in it."}, {"start": 496.97999999999996, "end": 502.26, "text": "The capacitor's job is to smooth out those ripples so that we get much more stable power."}, {"start": 502.62, "end": 505.9, "text": "So let's discuss how to choose the right size capacitor."}, {"start": 506.32, "end": 509.46, "text": "So here is the formula for calculating our capacitance."}, {"start": 510.29999999999995, "end": 515.68, "text": "Current times half cycle time divided by acceptable voltage drop equals microfarads."}, {"start": 516.48, "end": 518.12, "text": "So let's break this down."}, {"start": 518.12, "end": 526.18, "text": "First off we need to establish whether our wall outlet outputs AC power at 50 or 60 hertz."}, {"start": 527.18, "end": 530.08, "text": "Now here in New Zealand it is 50 hertz AC."}, {"start": 530.7, "end": 533.96, "text": "So my half cycle time is 10 milliseconds."}, {"start": 535.32, "end": 540.28, "text": "Next off we need to work out what our acceptable voltage drop is going to be."}, {"start": 540.28, "end": 549.64, "text": "So for my application the peak voltage I'm going to get after rectification is 70.5 volts DC."}, {"start": 550.3399999999999, "end": 555.02, "text": "And the minimum acceptable voltage I can have is 65."}, {"start": 555.36, "end": 558.74, "text": "So this gives me a difference of 5.5 volts DC."}, {"start": 559.3399999999999, "end": 561.18, "text": "So let's break this down."}, {"start": 561.76, "end": 563.3199999999999, "text": "Let's use this as an example."}, {"start": 563.32, "end": 568.88, "text": "In this example I'm drawing 10 amps of current maximum."}, {"start": 569.5600000000001, "end": 571.4000000000001, "text": "So I'll put in 10 amps in my calculator."}, {"start": 572.0, "end": 574.5, "text": "I'm going to times that by my half cycle time."}, {"start": 574.6, "end": 576.7600000000001, "text": "So in this example I'm going to use 8.3."}, {"start": 577.58, "end": 579.48, "text": "So times it by 8.3."}, {"start": 579.6, "end": 580.24, "text": "Hit equals."}, {"start": 581.0400000000001, "end": 584.5400000000001, "text": "And then my acceptable voltage drop is 5.5."}, {"start": 584.54, "end": 588.02, "text": "So I'm going to divide 83 by 5.5."}, {"start": 588.8199999999999, "end": 594.42, "text": "And then we get a microfarad capacity of 15,090 microfarads."}, {"start": 594.88, "end": 601.66, "text": "So chances are the capacitance you require is not going to be found on that off-the-shelf capacitor."}, {"start": 601.9599999999999, "end": 606.9399999999999, "text": "You might turn up an obscure number like 1,111 microfarads."}, {"start": 607.06, "end": 608.88, "text": "And you're not going to find that on a capacitor."}, {"start": 609.3399999999999, "end": 610.1999999999999, "text": "So what do we do?"}, {"start": 610.2, "end": 613.6400000000001, "text": "Well we buy a capacitor that's rated higher than we need."}, {"start": 613.96, "end": 616.84, "text": "But is closest to what we need to save on money."}, {"start": 617.22, "end": 620.2800000000001, "text": "When it comes to wiring your electrolytic capacitors."}, {"start": 620.74, "end": 622.84, "text": "Make sure you wire them the correct way."}, {"start": 622.96, "end": 626.0, "text": "Because most electrolytic capacitors are polarity sensitive."}, {"start": 626.6400000000001, "end": 627.6600000000001, "text": "And if you get it backwards."}, {"start": 628.26, "end": 631.6600000000001, "text": "Then chances are you're going to have a nasty explosion on your hands."}, {"start": 631.84, "end": 633.7800000000001, "text": "Which does add a bit of drama in your life."}, {"start": 633.88, "end": 636.3000000000001, "text": "But does make for a rather poor power supply."}, {"start": 637.0400000000001, "end": 638.0200000000001, "text": "So other than that."}, {"start": 638.12, "end": 639.3000000000001, "text": "Thank you very much for watching."}, {"start": 639.3, "end": 642.4599999999999, "text": "If you have any other questions drop them down in the comment section below."}, {"start": 642.9799999999999, "end": 645.7199999999999, "text": "And it would also be much appreciated if you can give the video a like."}, {"start": 646.26, "end": 646.54, "text": "Other than that."}, {"start": 646.62, "end": 647.5799999999999, "text": "Thank you very much for watching."}, {"start": 647.6999999999999, "end": 648.54, "text": "I'll see you in the next video."}, {"start": 648.66, "end": 649.14, "text": "Bye for now."}]}