{"video_id": "s0dNRe0XWJ8", "url": "https://www.youtube.com/watch?v=s0dNRe0XWJ8", "title": "s0dNRe0XWJ8", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 5.2, "text": "If you don't know who Chris Rosser is, get with the times. He is an aerospace engineer who is"}, {"start": 5.2, "end": 10.72, "text": "tearing up the world of FPV with his information on frame resonance analysis,"}, {"start": 11.14, "end": 15.82, "text": "PID tuning, frame design, just bringing an academic and professional engineering perspective"}, {"start": 15.82, "end": 22.7, "text": "to a field that all too often is made up of yahoos like me who just try things and see what works"}, {"start": 22.7, "end": 29.26, "text": "and talk about it. But he's an actual professional. And that's why I'm so excited today to be making"}, {"start": 29.26, "end": 36.260000000000005, "text": "this video. Because he has just released two videos. One on how to tune filters in Betaflight"}, {"start": 36.260000000000005, "end": 44.120000000000005, "text": "and then the other on the beginning of PID tuning, how to tune PD and feed forward. Chris's tutorials"}, {"start": 44.120000000000005, "end": 52.760000000000005, "text": "have really laid out PID tuning and filter tuning in a very simple and understandable way that I"}, {"start": 52.760000000000005, "end": 58.040000000000006, "text": "think that most everybody could follow. Well, many people could follow without necessarily having a"}, {"start": 58.04, "end": 62.12, "text": "deep, deep understanding of PID tuning and filtering. So what we're going to do today is we're going to"}, {"start": 62.12, "end": 67.44, "text": "go through those steps on my perfect freestyle build that I just finished building. And we're"}, {"start": 67.44, "end": 70.96, "text": "going to see if we can work out a PID tune. I'm Joshua Bardwell and you're going to learn something today."}, {"start": 79.16, "end": 83.2, "text": "Before we dive into this video, you should know that some of the things Chris Rosser recommends"}, {"start": 83.2, "end": 88.92, "text": "that you do are explicitly disagreed with by, well, Kevin Plazier, the emu flight dev specifically spoke"}, {"start": 88.92, "end": 94.04, "text": "out against one of the decisions that Chris makes. And the other decisions Chris makes are different"}, {"start": 94.04, "end": 99.42, "text": "from the Betaflight defaults. And the reason the Betaflight defaults are the way that they are"}, {"start": 99.42, "end": 107.44, "text": "is that some people who don't use the defaults will have flyaways or smoked motors. So don't just dive in"}, {"start": 107.44, "end": 113.53999999999999, "text": "and follow these steps. This is not a safe for everyone PID tuning process. You need to pay attention"}, {"start": 113.53999999999999, "end": 119.08, "text": "to the gotchas and caveats. And if you do not meet all the qualifications of step one, do not proceed"}, {"start": 119.08, "end": 124.64, "text": "to step two, three, four, five, six, seven, go back and stop and get step one right. This is a really"}, {"start": 124.64, "end": 132.64, "text": "aggressive tune at the end and your quad will fly amazing if it can handle it. Enough said."}, {"start": 132.64, "end": 145.1, "text": "When the oneiden is working, when the"}, {"start": 145.1, "end": 150.79999999999998, "text": "mosquitoes work together are very beautiful, I don't know how toень effect the heights of the"}, {"start": 150.79999999999998, "end": 156.7, "text": "most ratherigiousarius. Interesting to help one is the Ter towards Bernardino,"}, {"start": 156.7, "end": 159.77999999999997, "text": "that means this isn't something that is natural for you. And with his ProfIO,"}, {"start": 159.94, "end": 161.78, "text": "Whoooa!"}, {"start": 162.02, "end": 163.08, "text": "Whoooa!"}, {"start": 163.08, "end": 165.34, "text": "Whoa!"}, {"start": 167.4, "end": 170.4, "text": "Whoooa!"}, {"start": 171.76, "end": 172.96, "text": "Whoooo!"}, {"start": 174.66, "end": 175.66, "text": "Whoooa!"}, {"start": 175.66, "end": 180.18, "text": "Whoooa!"}, {"start": 180.18, "end": 185.9, "text": "Whoooa!"}, {"start": 185.9, "end": 187.08, "text": "Whooooa!"}, {"start": 187.08, "end": 187.98, "text": "Whooa!"}, {"start": 187.98, "end": 188.42000000000002, "text": "Whoooa!"}, {"start": 188.42000000000002, "end": 189.3, "text": "Whoooa!"}, {"start": 189.3, "end": 200.66000000000003, "text": "That's a pretty good PID tune."}, {"start": 201.16000000000003, "end": 202.22, "text": "Let's see how I got there."}, {"start": 202.8, "end": 206.78, "text": "The very first thing Chris tells you to do in his filter tuning video, and this is the"}, {"start": 206.78, "end": 212.74, "text": "beginning of every PID tune, is to make sure your aircraft is mechanically sound."}, {"start": 212.74, "end": 218.86, "text": "So often people reach out to me asking for a PID tuning solution to a mechanical issue."}, {"start": 219.3, "end": 223.04000000000002, "text": "And I like to say it's like trying to hike on a sprained ankle."}, {"start": 223.98000000000002, "end": 228.36, "text": "You could get some crutches and you could sort of limp along, but the real thing to do is"}, {"start": 228.36, "end": 232.72, "text": "to heal up your sprained ankle and then come at it from a healthy perspective."}, {"start": 232.88000000000002, "end": 238.52, "text": "And if your quadcopter is not mechanically sound, then you can't really start PID tuning"}, {"start": 238.52, "end": 242.08, "text": "effectively or you're going to be PID tuning around the problem and it's going to really"}, {"start": 242.08, "end": 242.68, "text": "hold you back."}, {"start": 242.68, "end": 246.26000000000002, "text": "Now Chris has some suggestions for specific things that you want to check because when"}, {"start": 246.26000000000002, "end": 248.94, "text": "I say mechanically sound, what does that even mean?"}, {"start": 249.3, "end": 250.92000000000002, "text": "So you definitely want to check these things."}, {"start": 251.16000000000003, "end": 256.24, "text": "These are, this is a really, really excellent summary of like the top five or six things"}, {"start": 256.24, "end": 258.64, "text": "that need to be right about your frame."}, {"start": 258.64, "end": 263.04, "text": "The only thing I would add to this is you want to check your frame for cracks."}, {"start": 263.44, "end": 266.92, "text": "Like if you have an arm that's beginning to delaminate or a bottom plate that's beginning"}, {"start": 266.92, "end": 269.04, "text": "to crack, this could be very easy to overlook."}, {"start": 269.48, "end": 273.1, "text": "But when you start trying to PID tune, it can make a problem that can't be solved."}, {"start": 273.1, "end": 276.96000000000004, "text": "And you just got to kind of just look at it and make sure you don't have any cracks or anything."}, {"start": 276.96000000000004, "end": 280.76000000000005, "text": "The next thing Chris advises is to fly the quad on default PIDs and log."}, {"start": 280.90000000000003, "end": 282.38, "text": "And that's what we've got here."}, {"start": 282.76000000000005, "end": 286.42, "text": "But before we do that, let's talk about the quad itself."}, {"start": 286.8, "end": 292.72, "text": "You're going to want to fly your quad in the same setup, in the same situation as it'll"}, {"start": 292.72, "end": 293.8, "text": "be flown in real life."}, {"start": 293.8, "end": 296.90000000000003, "text": "So if you're going to be flying in real life with a GoPro on, you're going to want"}, {"start": 296.90000000000003, "end": 298.1, "text": "to tune with a GoPro on."}, {"start": 298.22, "end": 302.0, "text": "If you're going to be flying in real life with a 1300 milliamp hour pack, you're going"}, {"start": 302.0, "end": 303.88, "text": "to want to tune with a 1300 milliamp hour pack."}, {"start": 304.3, "end": 306.32, "text": "Every tune will have a little bit of flexibility."}, {"start": 307.06, "end": 312.40000000000003, "text": "Like taking the GoPro, unless you tune to the absolute edge of performance, you'll be able"}, {"start": 312.40000000000003, "end": 317.24, "text": "to fly the quad with a GoPro on or off or switch between a 1000 milliamp hour and a 1250"}, {"start": 317.24, "end": 320.66, "text": "milliamp hour pack without making too many changes in the tune."}, {"start": 320.66, "end": 326.86, "text": "But the further you push the tune toward that nth degree of perfection, the less flexibility"}, {"start": 326.86, "end": 328.74, "text": "you'll have to change things about the quad."}, {"start": 329.08000000000004, "end": 333.08000000000004, "text": "So you may want, after you get a good tune, you may want to test it out with different"}, {"start": 333.08000000000004, "end": 335.28000000000003, "text": "batteries or with or without the GoPro."}, {"start": 335.64000000000004, "end": 339.86, "text": "The one thing I am going to point out to you though is you can see I am not flying brand"}, {"start": 339.86, "end": 340.40000000000003, "text": "new props."}, {"start": 340.92, "end": 346.8, "text": "And I would recommend, unless you are going to be 100% scrupulous about flying on brand"}, {"start": 346.8, "end": 350.62, "text": "new props every time, if you ever feel like you might need to turtle mode and come home"}, {"start": 350.62, "end": 353.5, "text": "on a broken or a bent prop, fly with some beat up props."}, {"start": 353.62, "end": 354.56, "text": "Do your tuning that way."}, {"start": 354.82, "end": 357.22, "text": "And that way you will build in just a little bit of headroom."}, {"start": 357.62, "end": 360.44, "text": "Your quad will just fly that much better when you have clean props, new props."}, {"start": 360.68, "end": 364.32, "text": "But if you ever do break a prop or bend a prop, you won't immediately smoke a motor."}, {"start": 364.42, "end": 366.82, "text": "So let's put the quad up in the air and do our first test flight."}, {"start": 367.02, "end": 372.86, "text": "And Chris's video has instructions for how to set up your black box logging and for how"}, {"start": 372.86, "end": 377.28000000000003, "text": "to get the black box logs off the quad and import them into black box viewer."}, {"start": 377.46000000000004, "end": 381.0, "text": "So link in the video description to Chris's video if you need instructions for how to do"}, {"start": 381.0, "end": 381.22, "text": "that."}, {"start": 381.38, "end": 386.24, "text": "As we do the tuning flight, we're going to make sure that it includes a lot of full stick"}, {"start": 386.24, "end": 393.40000000000003, "text": "360 rolls, full stick 360 flips and yaw spins, as well as some gradual ramps from zero to full"}, {"start": 393.40000000000003, "end": 393.84000000000003, "text": "throttle."}, {"start": 393.84, "end": 398.14, "text": "And we're going to want to make those ramps smooth and gradual so any resonance in the"}, {"start": 398.14, "end": 400.02, "text": "frame gets a good chance to come out."}, {"start": 400.09999999999997, "end": 403.78, "text": "We're not just going to do full throttle punches and we're going to want to hold at full throttle"}, {"start": 403.78, "end": 404.97999999999996, "text": "and ramp back down."}, {"start": 405.47999999999996, "end": 410.84, "text": "Now at this point, if your motors don't sound completely smooth on the stock beta flight"}, {"start": 410.84, "end": 411.4, "text": "defaults."}, {"start": 411.4, "end": 413.84, "text": "Oh, that's what we're flying on, the stock beta flight defaults."}, {"start": 414.05999999999995, "end": 417.34, "text": "1.0 on all the filter sliders, 1.0 on all the pin sliders."}, {"start": 417.82, "end": 423.47999999999996, "text": "If anything doesn't sound completely smooth, if you have any signs of vibration or gyro problems,"}, {"start": 423.48, "end": 425.76, "text": "go back to step one, you have a mechanical issue."}, {"start": 426.06, "end": 429.02000000000004, "text": "At least for 5 inch mini quads and smaller."}, {"start": 429.58000000000004, "end": 435.42, "text": "If you're flying like a 7 inch or a 10 inch or a 13 inch frame, the default filtering from"}, {"start": 435.42, "end": 438.70000000000005, "text": "beta flight may not be right for you and you may need to tweak it, but that's a topic for"}, {"start": 438.70000000000005, "end": 439.24, "text": "another video."}, {"start": 439.24, "end": 446.0, "text": "So let's open up this black box log in black box viewer and we're using Mark Spatz's presets"}, {"start": 446.0, "end": 449.22, "text": "for these different views, all these different views here."}, {"start": 449.22, "end": 453.42, "text": "They can be downloaded from theuavtech.com."}, {"start": 453.8, "end": 457.54, "text": "I'll put a link to that down in the video description, as well as if you need to know how to download"}, {"start": 457.54, "end": 460.64000000000004, "text": "and open them, I'll link to a video that shows how to do that."}, {"start": 460.86, "end": 464.22, "text": "But what we want to see is the gyro scaled."}, {"start": 465.5, "end": 466.68, "text": "And we're going to click there."}, {"start": 467.22, "end": 468.44000000000005, "text": "And that brings up this."}, {"start": 468.62, "end": 470.64000000000004, "text": "We're going to just go ahead and expand that."}, {"start": 470.64, "end": 474.44, "text": "And we're going to change from frequency to frequency versus throttle."}, {"start": 474.86, "end": 477.78, "text": "And this graph looks really freaking good."}, {"start": 478.08, "end": 481.44, "text": "Let's just turn that up a little bit so we can see it a little better."}, {"start": 481.9, "end": 485.41999999999996, "text": "We have a small amount of resonance around 200 hertz."}, {"start": 485.8, "end": 486.56, "text": "Nothing too extreme."}, {"start": 486.64, "end": 489.03999999999996, "text": "A little bit of resonance here, lower than that."}, {"start": 489.04, "end": 493.52000000000004, "text": "But on roll, there's nothing crazy that jumps out."}, {"start": 494.52000000000004, "end": 497.70000000000005, "text": "On pitch, we can see a little more resonance."}, {"start": 499.84000000000003, "end": 501.44, "text": "But nothing too bad."}, {"start": 501.54, "end": 502.92, "text": "Nothing higher than about 200 hertz."}, {"start": 503.42, "end": 509.72, "text": "And on yaw, again, just a little bit of resonance at 200 hertz and the normal amount of motor noise."}, {"start": 509.98, "end": 512.34, "text": "Based on the fact that my black box log looks pretty clean,"}, {"start": 512.34, "end": 515.9, "text": "and Chris actually looked at a black box log of a previous flight that I did,"}, {"start": 516.1600000000001, "end": 518.26, "text": "which had similar characteristics to this."}, {"start": 518.6800000000001, "end": 524.3000000000001, "text": "Chris made some filter recommendations that were more or less the same as his suggestions here for clean builds."}, {"start": 524.62, "end": 528.5400000000001, "text": "So we're going to go ahead and implement these filter suggestions as shown here,"}, {"start": 528.6, "end": 529.4200000000001, "text": "and then we'll move on."}, {"start": 529.6600000000001, "end": 531.0, "text": "We'll go to the PID tuning tab."}, {"start": 531.46, "end": 532.62, "text": "We'll go to Filter Settings."}, {"start": 533.26, "end": 535.5, "text": "Chris says to turn off the gyro low-pass filters"}, {"start": 535.5, "end": 538.7800000000001, "text": "because if you're doing RPM filtering and dynamic filtering,"}, {"start": 539.1, "end": 541.74, "text": "you probably can get away with not having any gyro filtering."}, {"start": 541.74, "end": 543.46, "text": "They will do a sufficient job."}, {"start": 543.74, "end": 550.5600000000001, "text": "Chris suggests 0, 250, 100, and 400 for the dynamic notch filter."}, {"start": 550.94, "end": 559.02, "text": "And he suggests a single static bi-quad filter at 100 hertz to help clean up the D-turn."}, {"start": 560.04, "end": 561.12, "text": "And we'll go ahead and save that."}, {"start": 561.58, "end": 565.94, "text": "But the next thing Chris has to do is to find your maximum D gain."}, {"start": 566.1800000000001, "end": 570.12, "text": "And this is a really great way to approach PID tuning."}, {"start": 570.12, "end": 573.94, "text": "A lot of times people used to approach PID tuning by finding the P gain first"}, {"start": 573.94, "end": 576.04, "text": "and then tuning D as best they could."}, {"start": 576.28, "end": 582.12, "text": "But mechanical filters, D gain, then P actually makes a lot more sense"}, {"start": 582.12, "end": 586.0600000000001, "text": "because you want your D gains to be as high as they need to be."}, {"start": 586.06, "end": 593.4799999999999, "text": "You'll always get a better flying quad with high D gains up to the point where you'll start to get flyaways or smoke motors."}, {"start": 593.78, "end": 599.6199999999999, "text": "So you want to push your D gains as high as they can be while still having acceptably cool motors"}, {"start": 599.6199999999999, "end": 604.8599999999999, "text": "and acceptably low risk of flyaway and then find the P balance that works best for you there."}, {"start": 605.0, "end": 607.3, "text": "And that'll probably give you a good flying quad."}, {"start": 607.3, "end": 611.1999999999999, "text": "As Chris said, the more D gain you have, the hotter your motors will get,"}, {"start": 611.26, "end": 613.76, "text": "the more likely you are to get oscillations, especially if you've been to prop."}, {"start": 614.54, "end": 619.02, "text": "So it is really a question of your tolerance as to how much risk you're willing to get."}, {"start": 619.3, "end": 621.52, "text": "A lot of racers will fly ultra-high D gains."}, {"start": 621.62, "end": 624.56, "text": "The quad is practically on the limit of smoking a motor at all times,"}, {"start": 624.66, "end": 626.68, "text": "but they have a really, really sharp flying quad."}, {"start": 626.68, "end": 630.0999999999999, "text": "For a typical freestyle or a casual pilot,"}, {"start": 630.4599999999999, "end": 633.56, "text": "you may want to give up just a little bit of that flight feel and performance"}, {"start": 633.56, "end": 636.4, "text": "for less risk of damaging your equipment."}, {"start": 636.8599999999999, "end": 641.8, "text": "Chris gives a range of recommended D gains for people flying a 5-inch freestyle"}, {"start": 641.8, "end": 646.06, "text": "from stock of around 30, which is really conservative,"}, {"start": 646.3199999999999, "end": 650.3599999999999, "text": "up to 45+, which has a much higher risk of smoking motors."}, {"start": 650.68, "end": 654.3, "text": "I will say, these are fine guidelines, but even these may be a little conservative."}, {"start": 654.3, "end": 659.1999999999999, "text": "I've had, like, I've personally played around with PID tuning on this build"}, {"start": 659.1999999999999, "end": 665.3, "text": "and had D gains at 50 or 55+, without really seeming to have much sign of smoked motors,"}, {"start": 665.4799999999999, "end": 667.0999999999999, "text": "but everybody's build is going to be different."}, {"start": 667.28, "end": 669.12, "text": "But before we start doing our test flights,"}, {"start": 669.3, "end": 671.9399999999999, "text": "we're going to go in and make this change in the CLI."}, {"start": 672.42, "end": 675.8, "text": "And I'm not really sure why Betaflight does this."}, {"start": 676.5999999999999, "end": 682.52, "text": "Betaflight, by default, limits the PID controller to 40% of its maximum authority."}, {"start": 682.52, "end": 686.9399999999999, "text": "And if it exceeds that, then, well, it's not allowed to exceed that."}, {"start": 687.4, "end": 692.22, "text": "So, we're going to set PID sum limit equals 1,000, which is 100%."}, {"start": 692.22, "end": 695.68, "text": "There's probably a good reason why Betaflight has you do this."}, {"start": 695.8199999999999, "end": 697.68, "text": "I'm sure they didn't just do it for no reason."}, {"start": 698.5799999999999, "end": 702.4, "text": "So, maybe something bad will happen to some people if they make this change."}, {"start": 702.66, "end": 704.1999999999999, "text": "But if you're trying to get a really good PID tune,"}, {"start": 704.46, "end": 707.06, "text": "this is definitely something you should start with."}, {"start": 707.06, "end": 709.68, "text": "And then what we're going to do is we're going to go out and fly"}, {"start": 709.68, "end": 712.9599999999999, "text": "and we're just going to try to make the motors as hot as possible"}, {"start": 712.9599999999999, "end": 716.7199999999999, "text": "by doing sharp turns, by doing full throttle punches,"}, {"start": 716.92, "end": 719.92, "text": "and we're going to listen for signs of runaway,"}, {"start": 720.3599999999999, "end": 723.3199999999999, "text": "signs of warbling, oscillation, unsmooth motors,"}, {"start": 723.7199999999999, "end": 726.68, "text": "or we're going to feel for hot motors at the end of each flight."}, {"start": 727.04, "end": 731.3, "text": "And we're going to turn up the master multiplier gradually, 0.1 to 0.2 at a time,"}, {"start": 731.4799999999999, "end": 734.9, "text": "and try to find the point where that starts to happen, then back off."}, {"start": 734.9, "end": 737.84, "text": "And I'm going to do something in the interest of time."}, {"start": 738.54, "end": 740.84, "text": "Normally, what Chris suggests is to raise the master"}, {"start": 740.84, "end": 743.4599999999999, "text": "in little increments of 0.1 or 0.2."}, {"start": 743.6999999999999, "end": 745.12, "text": "I'm going to make a bigger jump,"}, {"start": 745.36, "end": 748.28, "text": "and then if I overshoot, I'm going to work my way back."}, {"start": 748.48, "end": 750.38, "text": "I don't necessarily suggest you do that."}, {"start": 751.36, "end": 752.5, "text": "I'm going to be a little careful here,"}, {"start": 752.6, "end": 753.84, "text": "because if I have gone too far,"}, {"start": 753.92, "end": 756.84, "text": "the quad could want to fly away or something dumb like that."}, {"start": 758.92, "end": 760.04, "text": "Motors aren't complaining."}, {"start": 760.18, "end": 761.96, "text": "I don't hear any signs of them complaining."}, {"start": 764.9, "end": 774.42, "text": "Little hitch there."}, {"start": 777.1999999999999, "end": 778.1999999999999, "text": "Little hitches there."}, {"start": 778.28, "end": 779.28, "text": "You see those little hitches?"}, {"start": 782.86, "end": 784.48, "text": "Yeah, so that's too far."}, {"start": 785.86, "end": 787.14, "text": "Sorry, my mom's going."}, {"start": 787.14, "end": 800.22, "text": "All right, so we had little hitches there."}, {"start": 800.9399999999999, "end": 802.4399999999999, "text": "Motors still aren't super hot,"}, {"start": 802.74, "end": 804.66, "text": "but that's too far."}, {"start": 805.24, "end": 808.42, "text": "Let's try dialing that back down a little bit."}, {"start": 808.42, "end": 812.9599999999999, "text": "Here on PID tuning."}, {"start": 813.66, "end": 815.0999999999999, "text": "We're just going to knock that down."}, {"start": 815.16, "end": 816.56, "text": "Oh, I need to disable D-Man."}, {"start": 816.64, "end": 817.4399999999999, "text": "I forgot to do that."}, {"start": 817.9399999999999, "end": 819.14, "text": "I don't think that..."}, {"start": 819.14, "end": 820.3199999999999, "text": "Yeah, I need to disable D-Man."}, {"start": 820.42, "end": 821.18, "text": "I forgot that step."}, {"start": 821.38, "end": 822.02, "text": "That's also stuff."}, {"start": 822.3399999999999, "end": 824.06, "text": "We're going to take that down to 1.4,"}, {"start": 824.06, "end": 826.86, "text": "and we're going to see how we do."}, {"start": 832.12, "end": 833.9, "text": "Let's see if 1.4 clears that up."}, {"start": 833.9599999999999, "end": 835.04, "text": "Also, we've disabled D-Man,"}, {"start": 835.04, "end": 836.16, "text": "which I should have done first."}, {"start": 838.54, "end": 839.8399999999999, "text": "Tiny little hitch there."}, {"start": 853.8399999999999, "end": 854.78, "text": "Littlest of hitches"}, {"start": 854.78, "end": 856.8399999999999, "text": "if I do extended full throttle punches."}, {"start": 857.3199999999999, "end": 858.6999999999999, "text": "I feel like this is a good place"}, {"start": 858.6999999999999, "end": 859.48, "text": "for me to be, though."}, {"start": 861.62, "end": 863.5999999999999, "text": "Remember, we are a little bit on bed props,"}, {"start": 863.6, "end": 865.14, "text": "so on clean props,"}, {"start": 865.62, "end": 866.1800000000001, "text": "fresh props,"}, {"start": 866.26, "end": 867.36, "text": "that probably would go away."}, {"start": 870.86, "end": 873.02, "text": "But I feel like if I just do normal flying,"}, {"start": 873.46, "end": 874.62, "text": "none of that will come out."}, {"start": 888.8000000000001, "end": 889.62, "text": "No, see?"}, {"start": 889.62, "end": 890.12, "text": "No."}, {"start": 890.12, "end": 890.62, "text": "See?"}, {"start": 890.62, "end": 893.88, "text": "Already..."}, {"start": 893.88, "end": 897.72, "text": "I feel like we're flying really good."}, {"start": 898.08, "end": 900.6, "text": "Even just tuning that master slider"}, {"start": 900.6, "end": 902.88, "text": "has made a big freaking difference."}, {"start": 903.14, "end": 905.24, "text": "I mean, so often when I fly,"}, {"start": 905.38, "end": 908.66, "text": "I just fly on the defaults."}, {"start": 908.72, "end": 909.22, "text": "I'm like, whatever."}, {"start": 909.4, "end": 910.18, "text": "I just want to get in the air."}, {"start": 910.82, "end": 912.82, "text": "Just freaking turning this up"}, {"start": 912.82, "end": 915.44, "text": "has made such a big difference."}, {"start": 915.66, "end": 917.7, "text": "It's still pretty smooth."}, {"start": 917.7, "end": 923.12, "text": "Like, you can see that there's no hitches here."}, {"start": 924.26, "end": 925.5400000000001, "text": "Even if I do a big punch,"}, {"start": 925.6, "end": 926.46, "text": "it's only if I do"}, {"start": 926.46, "end": 929.36, "text": "a really extreme punch"}, {"start": 929.36, "end": 931.72, "text": "that I start to see those little blips."}, {"start": 931.96, "end": 933.88, "text": "So I feel like this is a good place to be."}, {"start": 933.88, "end": 942.74, "text": "Oh, yeah."}, {"start": 942.74, "end": 944.1, "text": "So next,"}, {"start": 944.48, "end": 946.86, "text": "we'll start to dial in our V-game."}, {"start": 951.14, "end": 951.98, "text": "Oh."}, {"start": 952.14, "end": 953.56, "text": "So good."}, {"start": 953.56, "end": 966.6199999999999, "text": "That's so good."}, {"start": 967.3599999999999, "end": 968.04, "text": "Damn, son."}, {"start": 969.4799999999999, "end": 970.28, "text": "That's so good."}, {"start": 970.28, "end": 973.78, "text": "Whew."}, {"start": 974.04, "end": 975.4, "text": "That quad's flying real good,"}, {"start": 975.4599999999999, "end": 976.18, "text": "ain't it, folks?"}, {"start": 976.3199999999999, "end": 977.14, "text": "Oh, man."}, {"start": 977.3399999999999, "end": 978.54, "text": "Boy, I bet you can't wait"}, {"start": 978.54, "end": 980.04, "text": "to see the rest of this process."}, {"start": 981.0, "end": 981.36, "text": "Whew."}, {"start": 983.52, "end": 983.92, "text": "Yeah."}, {"start": 984.54, "end": 986.06, "text": "It's going to be a multi-parter."}, {"start": 986.36, "end": 987.26, "text": "This is part one."}, {"start": 988.04, "end": 989.9, "text": "I'm going to upload the rest of it"}, {"start": 989.9, "end": 990.68, "text": "to the channel"}, {"start": 990.68, "end": 992.42, "text": "over the subsequent days."}, {"start": 992.42, "end": 992.88, "text": "Don't worry."}, {"start": 992.98, "end": 993.54, "text": "It's all shot."}, {"start": 993.62, "end": 994.1, "text": "It's all done."}, {"start": 994.16, "end": 995.5, "text": "I just got to finish editing it."}, {"start": 995.78, "end": 997.56, "text": "But I wanted to give you part one today"}, {"start": 997.56, "end": 998.3399999999999, "text": "just to get it out."}, {"start": 998.34, "end": 1000.12, "text": "There will be links down in the video description"}, {"start": 1000.12, "end": 1001.1, "text": "to part two"}, {"start": 1001.1, "end": 1001.9200000000001, "text": "and if there's,"}, {"start": 1002.0, "end": 1002.9, "text": "I think it's going to be two"}, {"start": 1002.9, "end": 1003.76, "text": "or maybe three parts."}, {"start": 1004.12, "end": 1005.34, "text": "But there will be links down below."}, {"start": 1005.48, "end": 1006.22, "text": "Or, hey, you know,"}, {"start": 1006.3000000000001, "end": 1007.12, "text": "you could get subscribed"}, {"start": 1007.12, "end": 1009.22, "text": "and hit that notification bell"}, {"start": 1009.22, "end": 1010.12, "text": "if you wanted to be sure"}, {"start": 1010.12, "end": 1010.96, "text": "to not miss it."}, {"start": 1011.02, "end": 1011.44, "text": "I mean, you know,"}, {"start": 1011.46, "end": 1012.14, "text": "it's up to you."}, {"start": 1014.14, "end": 1014.46, "text": "Yeah."}, {"start": 1015.58, "end": 1016.1, "text": "See you tomorrow."}]}