{"video_id": "sF0KOVWj9p8", "url": "https://www.youtube.com/watch?v=sF0KOVWj9p8", "title": "sF0KOVWj9p8", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 11.38, "text": "Sometimes when building circuits mistakes can happen, which can be a reverse voltage,"}, {"start": 11.38, "end": 17.8, "text": "a voltage applied to the wrong pin, components failing due to their age or wrong usage or"}, {"start": 17.8, "end": 20.82, "text": "you simply accidentally short something."}, {"start": 20.82, "end": 26.52, "text": "No matter the cause, the now appearing overcurrent is the root of all evil that needs to get"}, {"start": 26.52, "end": 31.36, "text": "stopped so that nothing explodes or burns down completely."}, {"start": 31.36, "end": 37.34, "text": "To do that I think pretty much everyone is familiar with such glass fuses that you just"}, {"start": 37.34, "end": 43.04, "text": "put in series to your circuit and as soon as too much current is flowing the thin metal"}, {"start": 43.04, "end": 47.5, "text": "inside of it melts and thus interrupts the current flow."}, {"start": 47.5, "end": 51.78, "text": "Only problem is that replacing such fuses can be cumbersome."}, {"start": 51.78, "end": 57.9, "text": "It can get expensive if you are testing stuff and constantly destroy them and in case of"}, {"start": 57.9, "end": 64.7, "text": "enclosed electronics like your smartphone there is simply no way to replace such a fuse."}, {"start": 64.7, "end": 71.62, "text": "The solution to all these problems though are resettable fuses like these ones which I often"}, {"start": 71.62, "end": 74.94, "text": "feel like not many people know about."}, {"start": 74.94, "end": 80.34, "text": "So in this video I will show you exactly how to use them and with what limitations they"}, {"start": 80.34, "end": 81.78, "text": "come with."}, {"start": 81.78, "end": 88.10000000000001, "text": "Because even though they are resettable and thus reusable they are certainly not perfect."}, {"start": 88.10000000000001, "end": 98.52000000000001, "text": "Let's get started!"}, {"start": 98.52000000000001, "end": 102.02000000000001, "text": "This video is sponsored by Mauser Electronics."}, {"start": 102.02000000000001, "end": 107.9, "text": "Now truth be told I've been searching for fitting resettable fuses for a while on the internet."}, {"start": 107.9, "end": 113.86, "text": "Mauser was the only seller that not only came with a big selection of them but most of them"}, {"start": 113.86, "end": 120.04, "text": "were also in stock, I could easily filter for preferences and best of all they sell to"}, {"start": 120.04, "end": 124.66000000000001, "text": "private people like you and me and not just companies."}, {"start": 124.66000000000001, "end": 130.98000000000002, "text": "I have been ordering my components from them since 2018 and I can tell you for sure that they"}, {"start": 130.98, "end": 134.1, "text": "have all the components you could ever need."}, {"start": 134.1, "end": 139.78, "text": "And you usually receive them within 3 or sometimes even only 2 days."}, {"start": 139.78, "end": 145.42, "text": "So feel free to check out Mauser Electronics if I piqued your interest."}, {"start": 145.42, "end": 150.66, "text": "Now first off if you want to use resettable fuses then you always have the choice between the"}, {"start": 150.66, "end": 157.74, "text": "through hole ones that I feel like are easier to use and small SMD ones which you probably"}, {"start": 157.74, "end": 162.4, "text": "already have seen on devices like the Raspberry Pi."}, {"start": 162.4, "end": 168.88, "text": "Sometimes resettable fuses are also known as a multi fuse, poly fuse or poly switch but"}, {"start": 168.88, "end": 174.78, "text": "if we want to be technically correct then they are actually called PPTC which stands for"}, {"start": 174.78, "end": 182.66, "text": "Polymeric Positive Temperature Coefficient device and wait a minute PTCs are actually quite"}, {"start": 182.66, "end": 184.36, "text": "popular."}, {"start": 184.36, "end": 189.32, "text": "What they do and what their name basically implies is that they increase their resistance when"}, {"start": 189.32, "end": 191.16, "text": "they get hotter."}, {"start": 191.16, "end": 197.46, "text": "You can actually find their relative the NTC aka Negative Temperature Coefficient on lots"}, {"start": 197.46, "end": 204.04, "text": "of 3D printers because they decrease their resistance when their temperature rises and thus they both"}, {"start": 204.04, "end": 206.82, "text": "can be used to measure temperature."}, {"start": 206.82, "end": 211.73999999999998, "text": "But back to the resettable fuse which does in fact increase its resistance when temperature"}, {"start": 211.73999999999998, "end": 218.95999999999998, "text": "rises but it still features lots of differences to normal PTCs or NTCs."}, {"start": 218.95999999999998, "end": 224.57999999999998, "text": "So as a practical example let's say I got a circuit that normally draws around 500mA at"}, {"start": 224.57999999999998, "end": 231.82, "text": "12V like this RGB LED strip right here and I want to protect it from shorts so that the"}, {"start": 231.82, "end": 235.26, "text": "fitting power supply does not get damaged."}, {"start": 235.26, "end": 241.44, "text": "Now to choose a suitable resettable fuse we only have to worry about 4 crucial properties"}, {"start": 241.44, "end": 248.0, "text": "and those are the maximum voltage and current as well as the hold current and trip current."}, {"start": 248.0, "end": 253.57999999999998, "text": "And I think the maximum voltage and current is pretty self explanatory meaning that if you"}, {"start": 253.57999999999998, "end": 258.21999999999997, "text": "exceed them you basically risk damaging your fuse."}, {"start": 258.22, "end": 265.34000000000003, "text": "The hold and trip current is a tiny bit more complicated but still pretty easy to understand."}, {"start": 265.34000000000003, "end": 270.70000000000005, "text": "The hold current basically stands for the current that can flow continuously without having to"}, {"start": 270.70000000000005, "end": 274.44000000000005, "text": "worry about that the fuse will ever trip."}, {"start": 274.44000000000005, "end": 280.48, "text": "And the trip current of course is the current that needs to flow so that the fuse will activate"}, {"start": 280.48, "end": 283.54, "text": "and thus interrupt the over current."}, {"start": 283.54, "end": 285.14000000000004, "text": "Pretty simple."}, {"start": 285.14, "end": 291.32, "text": "So with these 4 rough values in mind for my circuit I went on to a search on Mauser Electronics"}, {"start": 291.32, "end": 300.9, "text": "and decided on this PPTC that can do 60V and 40A max and comes with a hold current of 0.5A and"}, {"start": 300.9, "end": 303.62, "text": "a trip current of 1A."}, {"start": 303.62, "end": 308.78, "text": "And if you are asking yourself right now why not use a fuse with slightly higher ratings for"}, {"start": 308.78, "end": 315.0, "text": "a bit of wiggle room then just wait a few more minutes for a little revelation."}, {"start": 315.0, "end": 321.5, "text": "Because first off it was time for a small experiment in which I simulated my to be protected circuit"}, {"start": 321.5, "end": 327.68, "text": "with a constant load to which I of course added my resettable fuse in series and powered it"}, {"start": 327.68, "end": 330.22, "text": "all with 12V."}, {"start": 330.22, "end": 335.56, "text": "Now by slowly increasing the current flow through my fuse I also directly measured and wrote"}, {"start": 335.56, "end": 338.22, "text": "down the voltage drop across it."}, {"start": 338.22, "end": 344.06, "text": "Because those electrical values give us insight about the power the fuse wastes which directly"}, {"start": 344.06, "end": 350.44000000000005, "text": "determines its temperature and also what resistance it currently possesses."}, {"start": 350.44000000000005, "end": 357.1, "text": "So first big stop was the hold current of 500mA at which point only a small voltage drop across"}, {"start": 357.1, "end": 363.72, "text": "the fuse occurred that at some point also did not increase anymore meaning the temperature"}, {"start": 363.72, "end": 369.6, "text": "of the fuse was stable and thus it would never trip at this point."}, {"start": 369.6, "end": 376.16, "text": "Next was the trip current of 1A and here the voltage drop did in fact increase over time until"}, {"start": 376.16, "end": 382.1, "text": "the fuse ultimately reached its high resistance state in which my constant load could no longer"}, {"start": 382.1, "end": 385.88, "text": "draw 1A and thus turned off."}, {"start": 385.88, "end": 391.56, "text": "Now you might be thinking that these 22-6 seconds it took for the fuse to activate are way too"}, {"start": 391.56, "end": 400.58000000000004, "text": "long but as a comparison let's see how a 1A rated glass fuse would react to 1A of current."}, {"start": 400.58000000000004, "end": 407.32000000000005, "text": "And yes we could sit here forever because the glass fuse would never trip and even at 2A it"}, {"start": 407.32, "end": 413.88, "text": "still took way longer to activate once again in direct comparison to the resettable fuse."}, {"start": 413.88, "end": 420.44, "text": "So yeah PPTCs are a bit slow but traditional fuses are even slower."}, {"start": 420.44, "end": 426.44, "text": "But getting back to topic because next to truly investigate the trip occurrence I added a big"}, {"start": 426.44, "end": 432.5, "text": "power resistor as a load that would normally draw around 1.2A."}, {"start": 432.5, "end": 438.82, "text": "And by the way these 3 components I added in parallel to the fuse are just a trip indicator"}, {"start": 438.82, "end": 444.06, "text": "which lights up as soon as the fuse enters its high resistance state."}, {"start": 444.06, "end": 450.26, "text": "Ok so now with the resettable fuse in place the big current the resistor normally draws got"}, {"start": 450.26, "end": 455.56, "text": "quickly limited to only around 103mA."}, {"start": 455.56, "end": 461.26, "text": "But wait a minute shouldn't a fuse cut down the flowing current to nothing like a normal"}, {"start": 461.26, "end": 463.56, "text": "glass fuse would do?"}, {"start": 463.56, "end": 469.94, "text": "Well such PPTCs cannot do that because they are basically just resistors whose resistance"}, {"start": 469.94, "end": 475.76, "text": "increases drastically at the trip current because of the rising temperature."}, {"start": 475.76, "end": 481.04, "text": "That does not mean they are useless though because such a drastic current reduction can definitely"}, {"start": 481.04, "end": 487.58000000000004, "text": "prevent exploding capacitors, smoking transistors or even save battery packs when things go"}, {"start": 487.58000000000004, "end": 489.96000000000004, "text": "accidentally wrong."}, {"start": 489.96000000000004, "end": 495.84000000000003, "text": "And speaking of battery packs PPTCs also often get used with them since they drip when they"}, {"start": 495.84000000000003, "end": 502.98, "text": "get hot and battery packs definitely love to get hot when they are not handled correctly."}, {"start": 502.98, "end": 509.1, "text": "But getting back to the trip event at which point a so called leakage current keeps flowing"}, {"start": 509.1, "end": 515.4200000000001, "text": "that basically keeps the fuse hot enough so that it stays in its high resistance state."}, {"start": 515.4200000000001, "end": 520.9, "text": "I also did some additional measurements in this state to find out that no matter what input"}, {"start": 520.9, "end": 528.88, "text": "voltage gets applied the resettable fuse basically creates a power loss of around 1.2W which is"}, {"start": 528.88, "end": 532.72, "text": "quite a bit more than what the datasheet claims."}, {"start": 532.72, "end": 538.86, "text": "And speaking of datasheet this is a good time to try out a PPTC with slightly higher ratings."}, {"start": 538.86, "end": 546.44, "text": "Like this one that holds at 0.9A and triggers at 1.8A."}, {"start": 546.44, "end": 550.74, "text": "I pretty much did the same tests and measurements as before."}, {"start": 550.74, "end": 557.26, "text": "And the differences are that the bigger fuse features less power losses during normal operation"}, {"start": 557.26, "end": 560.9, "text": "but wastes more power when it got tripped."}, {"start": 560.9, "end": 565.4, "text": "So the choice is up to you what is more important for you."}, {"start": 565.4, "end": 571.28, "text": "Now the last thing we have to take a look at is the area between the hold and trip current."}, {"start": 571.28, "end": 576.9, "text": "And here the resettable fuse can trigger but does not have to."}, {"start": 576.9, "end": 584.52, "text": "For example at 700mA the voltage drop and thus temperature only increases very slowly."}, {"start": 584.52, "end": 590.9, "text": "Meaning eventually this fuse might drip if the ambient temperature is also high."}, {"start": 590.9, "end": 597.72, "text": "But at 900mA the voltage and temperature increases way faster and thus the fuse tripped in my"}, {"start": 597.72, "end": 602.8, "text": "case after around 1 minute and 42 seconds."}, {"start": 602.8, "end": 608.42, "text": "This typical time to trip diagram given by the datasheet can also help you out a lot regarding"}, {"start": 608.42, "end": 610.66, "text": "those questions."}, {"start": 610.66, "end": 616.98, "text": "And by the way the PPTC also becomes rather quickly conductive again as soon as the current"}, {"start": 616.98, "end": 618.66, "text": "decreases."}, {"start": 618.66, "end": 624.4599999999999, "text": "But after tripping once its resistance will take quite a long time until it will reach"}, {"start": 624.4599999999999, "end": 627.4599999999999, "text": "its initial value once again."}, {"start": 627.4599999999999, "end": 632.02, "text": "And with that being said you should now be familiar with most of the basics when it comes"}, {"start": 632.02, "end": 634.3399999999999, "text": "to resettable fuses."}, {"start": 634.34, "end": 640.26, "text": "And yes they are definitely a good fit for the LED strip example we started with and they"}, {"start": 640.26, "end": 645.2800000000001, "text": "are also a standard when it comes to many other protection tasks."}, {"start": 645.2800000000001, "end": 652.4, "text": "Of course traditional fuses are a bit more efficient, meaning they produce less power losses."}, {"start": 652.4, "end": 658.22, "text": "But then again E-fuses which I presented you in a previous video pretty much come with the"}, {"start": 658.22, "end": 662.1, "text": "same low power losses as traditional fuses."}, {"start": 662.1, "end": 668.08, "text": "And even better they do trip in a way more precise and fast way, since they do not rely"}, {"start": 668.08, "end": 674.08, "text": "on a rising temperature that burns a metal or increases a resistance."}, {"start": 674.08, "end": 681.22, "text": "But then again such an E-fuse is a bit more complicated to set up, it is more expensive and also not"}, {"start": 681.22, "end": 683.78, "text": "resettable by itself."}, {"start": 683.78, "end": 689.72, "text": "They can also only be used for limited voltage and current range, while the resettable fuses"}, {"start": 689.72, "end": 696.16, "text": "can handle quite a bit more and traditional fuses are beasts in that regard."}, {"start": 696.16, "end": 701.52, "text": "What I am trying to say here is that each one of these fuse types is tailored to a specific"}, {"start": 701.52, "end": 707.4, "text": "application and I feel like with this video coming to an end you should now have a very"}, {"start": 707.4, "end": 710.76, "text": "good idea when to use which one."}, {"start": 710.76, "end": 714.38, "text": "I hope you enjoyed it and learned something new."}, {"start": 714.38, "end": 719.34, "text": "If so consider supporting me through Patreon to keep the show going."}, {"start": 719.34, "end": 725.9399999999999, "text": "As always don't forget to like, share, subscribe and hit the notification bell."}, {"start": 725.9399999999999, "end": 729.88, "text": "Stay creative and I will see you next time!"}]}