{"video_id": "u40kX1DYKdA", "url": "https://www.youtube.com/watch?v=u40kX1DYKdA", "title": "u40kX1DYKdA", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.32, "end": 5.44, "text": "If you have ever worked with electronics, you've likely heard about decoupling capacitors."}, {"start": 7.2, "end": 10.8, "text": "But do you know why they are so important? In this video,"}, {"start": 10.8, "end": 14.48, "text": "we will delve into them and their significance in electronics design."}, {"start": 21.04, "end": 25.92, "text": "In electronics, different parts of a circuit can create noise or electrical disturbances"}, {"start": 25.92, "end": 31.76, "text": "that can affect the performance of other parts of the circuits. This noise can be caused by various"}, {"start": 31.76, "end": 38.08, "text": "factors such as switching of transistors, voltage spikes, electromagnetic interference, and so on."}, {"start": 40.160000000000004, "end": 45.36, "text": "The coupling capacitors are used to suppress this noise by providing a low impedance path to ground"}, {"start": 45.36, "end": 53.120000000000005, "text": "for high frequency noise. These are two circuits to demonstrate the presence of noise. First,"}, {"start": 53.12, "end": 60.32, "text": "an LM7805 voltage regulator which receives the voltage and stabilizes it to 5V DC."}, {"start": 61.599999999999994, "end": 69.52, "text": "And with this 555 timer, generating an square wave at 123Hz, which is considered low frequency."}, {"start": 70.88, "end": 77.03999999999999, "text": "For the input of the regulator, I am using a switching mode power supply adjusted at 9V DC."}, {"start": 77.04, "end": 85.04, "text": "By looking into the output with the multimeter, everything appears normal, with an average output of 5V."}, {"start": 86.4, "end": 92.4, "text": "If we look with the oscilloscope, indeed it appears around 5V. Good."}, {"start": 93.76, "end": 101.36000000000001, "text": "But if we look close there, the line looks fuzzy. This is electrical noise, mainly generated by the power"}, {"start": 101.36, "end": 108.64, "text": "supply, but also by the regulator itself, internally switching at high speed trying to stabilize the output voltage."}, {"start": 109.92, "end": 117.68, "text": "This noise includes a ripple, seen as a high frequency AC component superimposed on the DC signal,"}, {"start": 117.68, "end": 123.36, "text": "which can cause problems in certain applications, in this case more than 900 mV."}, {"start": 123.36, "end": 131.12, "text": "If we add some load at the output, let's say this LED with a resistance, guess what happens?"}, {"start": 132.64, "end": 140.0, "text": "Ouch! The regulator gets more stressed due to the load, and the output noise goes even higher,"}, {"start": 140.0, "end": 146.72, "text": "almost 2V peak to peak. This noise is also getting back to the power rail of the circuit."}, {"start": 146.72, "end": 154.64, "text": "I am enabling the second channel of the scope to see both signals. See the blue line, how the noise"}, {"start": 154.64, "end": 161.44, "text": "increases as I connect the LED, which means that other components on the same circuit will be affected"}, {"start": 161.44, "end": 170.56, "text": "as well. The datasheet recommends adding one capacitor of 0.22uF at the input, and an optional one at the output."}, {"start": 170.56, "end": 177.6, "text": "The first is the decoupling capacitor because it decouples or isolates this component from the rest,"}, {"start": 178.16, "end": 189.36, "text": "in this case from the power supply. I will use this film capacitor of 0.33uF, which is the closest one that I have."}, {"start": 191.6, "end": 200.24, "text": "Oh, perfect! The new readings of the peak to peak noise is around 150mV. We have an improvement here."}, {"start": 201.52, "end": 208.88, "text": "Great! Now let's analyze the 5F5 timer. The signal looks like a classic square wave,"}, {"start": 209.92000000000002, "end": 217.28, "text": "but if we zoom in we see this spike on the left, and lots of noise with it. For this circuit the input"}, {"start": 217.28, "end": 227.68, "text": "is 9V, the peak is more than 6V, that's 54%. Hmm, for reference it is too much."}, {"start": 227.68, "end": 233.76000000000002, "text": "I am adding two capacitors at the power lines of the integrated circuit to see the effect."}, {"start": 235.52, "end": 242.16, "text": "Why too? And how did I know the values of each of them? Well, because they are prescribed in the"}, {"start": 242.16, "end": 250.8, "text": "datasheet of the manufacturer. The final square wave looks much cleaner. The readings this time for the"}, {"start": 250.8, "end": 258.56, "text": "noise amplitude is only 400mV. Compared with the previous one, it is way lower. Perfect!"}, {"start": 259.6, "end": 263.44, "text": "What if we connect the output of the regulator to power the 5F5 timer?"}, {"start": 263.44, "end": 270.8, "text": "We do this by connecting the ground line and then the output of the regulator, this pin 3,"}, {"start": 272.08, "end": 277.84, "text": "to the power line of the 5F5 timer. That means that we are accumulating the power supply,"}, {"start": 277.84, "end": 286.08, "text": "the regulator and the 5F5 timer in series. And actually this is a common array for many circuits."}, {"start": 288.96, "end": 293.28, "text": "The shape of the square wave reflects the accumulated noise from the power source"}, {"start": 293.28, "end": 299.67999999999995, "text": "and from the regulator. So imagine having this kind of behavior in more complex circuits."}, {"start": 299.68, "end": 308.32, "text": "This is a ripple and noise. Notice this tilted section of the wave. That is not right. We can measure"}, {"start": 308.32, "end": 317.68, "text": "more than 900mV. This is 20% of 5V. Now let's go ahead to add the decoupling capacitor to the input of the regulator."}, {"start": 317.68, "end": 333.04, "text": "Now we have like 500mV of peak to peak noise. Things are getting better. That's good."}, {"start": 334.64, "end": 338.64, "text": "Now adding the first of the two decoupling capacitors of the 5F5 timer."}, {"start": 338.64, "end": 346.4, "text": "First with 0.1uF5 timer. First with 0.1uF5 timer. Or 104 code for a ceramic capacitor."}, {"start": 347.2, "end": 353.76, "text": "Which should remove higher frequencies. This gives like 140mV for the noise."}, {"start": 356.24, "end": 364.15999999999997, "text": "Now adding the electrolytic capacitor of 1uF5 timer. This one should remove the lower frequencies from the"}, {"start": 364.16, "end": 373.92, "text": "noise. Hmm. This one is only helping to fix the left side of the shape. But not for reducing the overall noise."}, {"start": 375.20000000000005, "end": 382.72, "text": "Anyway we leave it as it is prescribed by the datasheet. Our final signal is squared and flat at the bottom"}, {"start": 382.72, "end": 390.88, "text": "and at the top. And not that thick. And the final noise gives 140mV equivalent to 2.8%."}, {"start": 390.88, "end": 399.44, "text": "That's a more acceptable value. Not bad. But what if we need a cleaner output signal?"}, {"start": 400.48, "end": 405.84, "text": "First, let's remember that a breadboard is not the best way to measure and eliminate electrical noise."}, {"start": 406.56, "end": 412.56, "text": "However, there are several techniques that can be used. But those depend on condition of circuit."}, {"start": 412.56, "end": 422.16, "text": "That includes frequency, amplitude, power, peak amplitude, external interference, radio frequencies,"}, {"start": 422.16, "end": 430.0, "text": "nominal voltage, tolerances, cost, and many others. But those are not covered in this video."}, {"start": 431.04, "end": 436.16, "text": "Ok, now we have a practical idea of why decoupling capacitors are so important."}, {"start": 436.16, "end": 440.32000000000005, "text": "I hope you liked this video."}, {"start": 440.32000000000005, "end": 441.12, "text": "Knock knock."}, {"start": 445.52000000000004, "end": 445.76000000000005, "text": "That's f..."}, {"start": 445.76000000000005, "end": 447.76000000000005, "text": "That's 50..."}, {"start": 447.76000000000005, "end": 449.84000000000003, "text": "That's good."}, {"start": 449.84000000000003, "end": 451.04, "text": "Good."}, {"start": 451.04, "end": 452.24, "text": "Good."}, {"start": 452.24, "end": 454.16, "text": "Milliballs per..."}, {"start": 454.16, "end": 455.76000000000005, "text": "But what..."}, {"start": 455.76000000000005, "end": 457.76000000000005, "text": "But what if..."}, {"start": 457.76, "end": 473.36, "text": "What if..."}, {"start": 473.36, "end": 475.59999999999997, "text": "So that partir."}, {"start": 475.59999999999997, "end": 477.76, "text": "This is not a little too much about d lij"}, {"start": 477.76, "end": 478.8, "text": "bad mão."}, {"start": 478.8, "end": 480.76, "text": "So that this is still a little too much about all of the miroczyños."}, {"start": 480.76, "end": 482.18, "text": "That permitir."}, {"start": 482.24, "end": 483.56, "text": "And it can be Mauricio."}]}