{"video_id": "yPwYNUDkkZs", "url": "https://www.youtube.com/watch?v=yPwYNUDkkZs", "title": "yPwYNUDkkZs", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.16, "end": 3.84, "text": "If you are one of those who think that diodes are very simple,"}, {"start": 3.84, "end": 6.4, "text": "I must say that you are completely wrong."}, {"start": 6.96, "end": 12.48, "text": "It is really unfair to think that diodes are very simple components and they can only rectify"}, {"start": 12.48, "end": 18.56, "text": "current. In this video, I will talk about diodes and their application, not inner structure or"}, {"start": 18.56, "end": 26.0, "text": "chemistry, and introduce three main types of diodes with eight applications of them in circuits."}, {"start": 26.0, "end": 28.080000000000002, "text": "Please stay with me in the rest of this video."}, {"start": 28.08, "end": 36.8, "text": "Diodes! These little components are so tricky. They put out of sight their talent. Maybe they"}, {"start": 36.8, "end": 43.28, "text": "are afraid of being used in your project. But don't worry, I will reveal their secret in few minutes."}, {"start": 43.92, "end": 48.16, "text": "To begin with, I am going to take a brief look at ideal diode."}, {"start": 50.8, "end": 57.68, "text": "This is a schematic symbol of a diode. It has two pins, anode or positive and cathode or negative."}, {"start": 57.68, "end": 65.68, "text": "There is a line in the cathode side of real diodes to specify a negative or cathode side. Look here,"}, {"start": 65.68, "end": 69.28, "text": "this silver line here and this one."}, {"start": 69.28, "end": 76.72, "text": "This diode specifies the cathode side by a black line."}, {"start": 80.56, "end": 89.36, "text": "If you change this line to a shape like S, first letter of Schottky, it becomes a Schottky diode"}, {"start": 89.36, "end": 99.12, "text": "schematic symbol like this. And if you replace this line with a shape like Z, first letter of Zener,"}, {"start": 99.12, "end": 106.96000000000001, "text": "it becomes a Zener diode schematic symbol. And if you surround the diode symbol with a circle,"}, {"start": 106.96, "end": 115.52, "text": "it becomes an LED symbol. This component will allow current to flow in this direction from its"}, {"start": 115.52, "end": 122.55999999999999, "text": "anode to its cathode and it will block current in opposite direction. If you put voltage to diode in"}, {"start": 122.55999999999999, "end": 129.2, "text": "right order, I mean positive voltage to anode pin and negative voltage to cathode pin, then your diode"}, {"start": 129.2, "end": 136.48, "text": "is in forward bias setup and will allow current to flow. But if you put voltage in opposite direction,"}, {"start": 136.48, "end": 143.67999999999998, "text": "then your diode is in reverse bias setup and will block current from flowing. First application of"}, {"start": 143.67999999999998, "end": 150.0, "text": "diodes came from this definition. Application number one, using diode as rectifier."}, {"start": 150.0, "end": 156.79999999999998, "text": "Diodes can pass electricity only in one direction. If you put a diode in an alternative current path,"}, {"start": 156.8, "end": 161.68, "text": "it will allow electricity in one direction and block opposite direction."}, {"start": 171.44, "end": 177.84, "text": "Look here, this is a half-wave rectifier. It just passed positive half of sinusoidal wave"}, {"start": 177.84, "end": 185.84, "text": "and block negative part. Look at this diode carefully. If you apply this yellow signal on anode pin of this"}, {"start": 185.84, "end": 189.92000000000002, "text": "diode, you will get this blue signal on the cathode pin."}, {"start": 200.24, "end": 212.48000000000002, "text": "This is a full wave rectifier. I am gonna test it."}, {"start": 212.48, "end": 220.39999999999998, "text": "This is a full wave rectifier. This is a full wave rectifier."}, {"start": 220.39999999999998, "end": 226.88, "text": "And this is a full wave rectifier which pass either negative or positive part of waveform to output,"}, {"start": 226.88, "end": 233.35999999999999, "text": "and in the same time, convert negative wave to positive. A full wave rectifier works like this."}, {"start": 233.35999999999999, "end": 239.51999999999998, "text": "This yellow signal is input sinusoidal wave, and the blue one is output of rectifier. You see,"}, {"start": 239.52, "end": 244.0, "text": "negative part is reflected to positive side by rectifier."}, {"start": 244.0, "end": 250.32000000000002, "text": "It seems easy, but you have to be careful in selecting proper diode. These are three important"}, {"start": 250.32000000000002, "end": 256.32, "text": "parameters to consider in selecting diode. All of these parameters are available in data sheet."}, {"start": 256.32, "end": 263.36, "text": "In data sheet of every diode, it is available to check how much voltage the diode will tolerant in reverse"}, {"start": 263.36, "end": 270.88, "text": "by a setup. For example, if you are going to rectify AC power in United States by a half wave rectifier,"}, {"start": 270.88, "end": 278.0, "text": "you can use these, but you can't use these because of shortage of reverse blocking voltage."}, {"start": 278.0, "end": 284.8, "text": "Contrary to what most newbies think, application of diodes is not limited to rectification."}, {"start": 285.28000000000003, "end": 290.72, "text": "Second application of diodes is my favorite. Application number two."}, {"start": 290.72, "end": 296.40000000000003, "text": "Using diode for reverse polarity protection to protect or product from inverted polarity."}, {"start": 296.40000000000003, "end": 303.84000000000003, "text": "Think about your product. The result of all those efforts can be lost with just a small mistake."}, {"start": 303.84000000000003, "end": 310.0, "text": "If the user connects power supply in wrong polarity, main parts of your circuit will blow up."}, {"start": 310.64000000000004, "end": 317.04, "text": "Microcontrollers, regulators, ICs, and other stuff. But you can prevent the disaster"}, {"start": 317.04, "end": 323.92, "text": "with a tiny and cheap Schottky diode. Why Schottky diodes? How to do that? I will explain."}, {"start": 327.84000000000003, "end": 334.88, "text": "This circuit here presents your main design and here is power input. You must connect your power supply"}, {"start": 334.88, "end": 341.52000000000004, "text": "in right polarity. I mean positive side here and negative side here. Connecting wrong polarity,"}, {"start": 341.52, "end": 348.79999999999995, "text": "even for a very short period of time, will blow up whole project. But if you use a Schottky diode here"}, {"start": 348.79999999999995, "end": 356.24, "text": "in this way, it will protect entire project from reverse polarity. You may ask why Schottky diode is"}, {"start": 356.24, "end": 364.0, "text": "used here. Because Schottky diode drop very low portion of input voltage, for example 0.2 volts. If you"}, {"start": 364.0, "end": 372.96, "text": "use an ordinary diode here, it will drop around 0.7 volts of power supply. But Schottky diode drops only 0.2 volts."}, {"start": 372.96, "end": 379.68, "text": "Sometimes you need to use a rechargeable backup battery in your project to ensure the device"}, {"start": 379.68, "end": 387.84, "text": "work when power is down. There are many solutions, but using a diode is one of most simple and cheap"}, {"start": 387.84, "end": 395.59999999999997, "text": "approaches. Third application of diodes in circuits is to connect battery and power supply together."}, {"start": 396.15999999999997, "end": 401.28, "text": "Application number three. Using diodes to connect multiple power sources."}, {"start": 408.64, "end": 416.15999999999997, "text": "Here is most simple way to connect backup battery to power source. Look here, ground of battery and ground"}, {"start": 416.16, "end": 423.6, "text": "of main power source are connected together here. There is a diode here which connects 12 volts of battery"}, {"start": 423.6, "end": 431.92, "text": "to 12 volts of main power source. When power source is up, voltage difference on anode and cutout of this"}, {"start": 431.92, "end": 440.64000000000004, "text": "diode is about 0 or even negative voltage and diode is off and the device will work with external power source."}, {"start": 440.64, "end": 448.71999999999997, "text": "But when external power source is down, battery power will flow through the diode and keep the circuit working."}, {"start": 448.71999999999997, "end": 455.59999999999997, "text": "I believe you are thinking about charging this battery. Yes, this is a real concern. We need a battery"}, {"start": 455.59999999999997, "end": 462.88, "text": "charging circuit here to charge the battery when the external power is up. I will explain how to do it in"}, {"start": 462.88, "end": 470.4, "text": "one of my next videos. You saw diodes can pass electricity in one direction. This is very first definition all of"}, {"start": 470.4, "end": 477.2, "text": "us learn diodes with. But I recommend to change this definition to a voltage-oriented definition"}, {"start": 477.2, "end": 481.76, "text": "to better understand some parameters. Voltage-based definition is this."}, {"start": 482.47999999999996, "end": 490.56, "text": "Diods can conduct voltage from their anode pin to their cutout. I mean, if you apply DC voltage to anode pin"}, {"start": 490.56, "end": 499.52, "text": "of a diode, it will conduct voltage to a cutout pin. But if you apply voltage to a cutout pin, anode pin of a diode"}, {"start": 499.52, "end": 506.64, "text": "will not affect it. Be careful, it is a serious danger to grab a diode from a cutout and plug the anode pin to outlet."}, {"start": 507.35999999999996, "end": 516.3199999999999, "text": "As said, diodes cannot conduct voltage from cutout to anode, but I mean DC voltage in circuit, not AC power line and your body."}, {"start": 516.3199999999999, "end": 525.52, "text": "In an ideal diode, the voltage comes intact from anode to cutout. But in a real diode, a portion of voltage stays on diode,"}, {"start": 525.52, "end": 532.48, "text": "and remaining voltage passes and goes to cutout. This feature brings us fourth application of diodes."}, {"start": 532.48, "end": 536.64, "text": "Application number 4. Using Diodes to Reduce Voltage"}, {"start": 536.64, "end": 544.48, "text": "Assume that you need 4.3 volts somewhere in your project, but main voltage in your circuit is 5 volts."}, {"start": 544.48, "end": 550.3199999999999, "text": "For example, you need to run DF Player Module to play music or sound effects in your project."}, {"start": 550.32, "end": 558.48, "text": "Since this module works with 4.3 volts, you have to provide this voltage for that. What you can do?"}, {"start": 560.32, "end": 568.5600000000001, "text": "First thing I think about is using an adjustable voltage regulator and set it on 4.3 volts. Actually,"}, {"start": 568.5600000000001, "end": 575.44, "text": "this is best method to do such a project, but using regulators increase project cost. In some cases,"}, {"start": 575.44, "end": 583.2800000000001, "text": "you can use drop voltage of a diode to reduce voltage. You may ask how much voltage a diode can drop."}, {"start": 583.2800000000001, "end": 590.8000000000001, "text": "It depends on diode type, ambient temperature, and current flowing through diode. But impact of ambient"}, {"start": 590.8000000000001, "end": 597.84, "text": "temperature and current is ignorable in many cases because of that we consider diode type only."}, {"start": 597.84, "end": 605.0400000000001, "text": "Diodes usually are made of silicon or germanium. Silicon diodes drop voltage around 0.7 volts and"}, {"start": 605.0400000000001, "end": 612.48, "text": "germanium or Schottky diodes drop lower, around 0.2 volts. Exact draft voltage is available on data sheet"}, {"start": 612.48, "end": 620.8000000000001, "text": "of each part number. For example, look at this data sheet. Draft voltage of 1N5822 diode in room temperature"}, {"start": 620.8, "end": 633.28, "text": "and current equal to 3A is 0.52 volts. And look at this one. Draft voltage of 1N4007 diode in room temperature"}, {"start": 633.28, "end": 644.4799999999999, "text": "and current equal to 1A is 1V. And our last example, 1N4148 diode. Let's look better at this diode and its"}, {"start": 644.48, "end": 652.72, "text": "forward voltage. This is forward voltage graph from data sheet of 1N4148 diode. In first sight,"}, {"start": 652.72, "end": 660.16, "text": "it is clear that the forward voltage is a function of temperature and current flowing through diode."}, {"start": 660.8000000000001, "end": 670.16, "text": "Let's consider this point. Here, the temperature is 30 degrees and current is equal to 10 milliampers."}, {"start": 670.16, "end": 679.36, "text": "In this point, forward voltage is around 0.7 volts. By increasing current, forward voltage will get"}, {"start": 679.36, "end": 687.76, "text": "bigger. This approach for reducing voltage is not best way, but it has its own advantages. It is super"}, {"start": 687.76, "end": 695.36, "text": "simple and cheap. And you can use a bunch of diodes in series to reduce more and more voltage. But you"}, {"start": 695.36, "end": 702.5600000000001, "text": "have to be careful. If you use many diodes in series to reduce more voltage, impact of current on voltage"}, {"start": 702.5600000000001, "end": 711.36, "text": "drop will be impressive. Let's go to 5th application of diodes. Application number 5. Using Diodes as Flyback."}, {"start": 711.36, "end": 717.92, "text": "With a little experiment in electronics, you may have seen a diode attached to every relay in circuits."}, {"start": 717.92, "end": 724.64, "text": "This diode is called by many names. Flyback, Flywheel, Snobber, Suppressor, Clamp, and some other names."}, {"start": 725.1999999999999, "end": 731.92, "text": "Some of new builds don't use this diode in their design because they think it is useless. But this"}, {"start": 731.92, "end": 738.72, "text": "is one of the most important things to do in your circuit design. By placing a diode in parallel with"}, {"start": 738.72, "end": 746.8, "text": "relay or other inductive loads, spikes produced by them will be eliminated. By removing this diode from"}, {"start": 746.8, "end": 750.0799999999999, "text": "your design, be ready for awful things in your project."}, {"start": 756.3199999999999, "end": 763.3599999999999, "text": "Look here. One flywheel diode stands beside its relay and connected to it in parallel."}, {"start": 763.36, "end": 771.6800000000001, "text": "Catode pin of diode is toward VCC. In this circuit, I am using a tactile switch to connect or disconnect"}, {"start": 771.6800000000001, "end": 779.12, "text": "the diode to see its impact. I am gonna use my function generator to turn the relay on or off 5 times"}, {"start": 779.12, "end": 795.68, "text": "per second and use my oscilloscope to see what is happening in collector pin of transistor."}, {"start": 795.68, "end": 816.2399999999999, "text": "Catode pin of diode is toward VCC. In this circuit, the diode will enter the circuit and eliminate the"}, {"start": 816.24, "end": 828.8, "text": "spike. This is magic of diodes. Look here. The spike is gone. This is the magic of diode. If you refuse to use this diode here,"}, {"start": 828.8, "end": 833.8399999999999, "text": "the microcontroller in your circuit will reset every time the relay switches off."}, {"start": 833.8399999999999, "end": 842.56, "text": "It is not just relays. All types of inductive loads make spikes like DC motors, buzzers, solenoids, etc."}, {"start": 842.56, "end": 847.12, "text": "And it is strongly recommended to use a flywheel diode beside them."}, {"start": 848.0, "end": 854.16, "text": "Till now, we just considered ordinary diodes. It is time to introduce Zener diodes."}, {"start": 854.8, "end": 862.4, "text": "Zener diodes are same as ordinary diodes in forward bias, but they act different in reverse bias."}, {"start": 862.4, "end": 869.28, "text": "Zener diodes have a precise reverse voltage and this characteristic brings us next application of"}, {"start": 869.28, "end": 874.7199999999999, "text": "diodes. Application number 6. Using Zener diodes for regulating voltage."}, {"start": 874.7199999999999, "end": 883.8399999999999, "text": "Let's consider a 18V Zener diode. It means in reverse bias setup, it will block current by voltages under 18V"}, {"start": 883.84, "end": 893.6800000000001, "text": "and start to pass current by voltages over 18V. And it will do its best to keep voltage on itself at 18V."}, {"start": 894.32, "end": 897.44, "text": "Notice that we are talking about ideal Zener diode."}, {"start": 902.24, "end": 910.5600000000001, "text": "Look here. This is simple Zener diode circuit. Zener diodes are generally used with a resistor in series to"}, {"start": 910.56, "end": 918.16, "text": "limit current and protect Zener diode from blowing up and to make reference voltage here at this point."}, {"start": 919.28, "end": 927.3599999999999, "text": "But this resistor limits reference voltage power either. I mean this point cannot provide so much current."}, {"start": 927.3599999999999, "end": 930.4799999999999, "text": "So we need to amplify current on this point."}, {"start": 931.1199999999999, "end": 938.9599999999999, "text": "There are so many ways to do that. But one of the most easy and handy way is to use a BJT transistor,"}, {"start": 938.96, "end": 947.44, "text": "which is explained in this card. And another way is to use an off-amp. I will explain this one in one of my next videos."}, {"start": 948.0, "end": 954.72, "text": "Application of Zener diodes is not limited to making reference voltages. They sometimes used for"}, {"start": 954.72, "end": 962.64, "text": "protecting circuits from over voltage. Let's see it. Application number 7. Using a Zener diode to protect"}, {"start": 962.64, "end": 969.4399999999999, "text": "circuits from over voltage. There are so many ways to protect circuits from over voltage. But one of the most"}, {"start": 969.4399999999999, "end": 977.12, "text": "simple example of them is to use a single Zener diode. You may wonder how it is possible. Let's see example."}, {"start": 983.1999999999999, "end": 988.96, "text": "This is a sample circuit. You can use a Zener diode here with a fuse like this."}, {"start": 988.96, "end": 998.0, "text": "If voltage in power supply remains in right value, for example 12V, Zener diode in reverse bias will"}, {"start": 998.0, "end": 1006.24, "text": "remain off. But if over voltage happens here in power supply, Zener diode will pass lots of current"}, {"start": 1006.24, "end": 1013.76, "text": "to keep voltage here on 12V and this current will burn the fuse and save whole project."}, {"start": 1013.76, "end": 1021.2, "text": "A single Zener diode in cooperation with a fuse can save whole project. This is amazing."}, {"start": 1022.3199999999999, "end": 1030.8, "text": "So let's go to next type of diodes. Light emitting diodes or LEDs. Don't look at LEDs like simple or"}, {"start": 1030.8, "end": 1038.48, "text": "trite components. They are used for many purposes. Lighting up, showing device status, showing parameters,"}, {"start": 1038.48, "end": 1046.0, "text": "helping plants to grow, or even communication. These are most important applications of LEDs."}, {"start": 1046.0, "end": 1053.52, "text": "But I am gonna talk about my favorite. Application number 8. Using LEDs for remote communication."}, {"start": 1054.24, "end": 1062.48, "text": "LEDs are used for emitting lights, even invisible lights, like infrared or ultraviolet. Most of remote"}, {"start": 1062.48, "end": 1069.92, "text": "controllers these days are using infrared pulses to communicate with devices. Let's see how they work."}, {"start": 1069.92, "end": 1078.08, "text": "This is a simple remote controller. If I press any button, it will make infrared pulses here with this IR LED."}, {"start": 1078.08, "end": 1078.64, "text": "Look here."}, {"start": 1078.64, "end": 1091.2800000000002, "text": "If you look at your TV remote controller, you cannot see anything. But here pulses are visible. Because"}, {"start": 1092.5600000000002, "end": 1096.64, "text": "these pulses are visible to camera, even your cell phone camera."}, {"start": 1096.64, "end": 1103.5200000000002, "text": "We saw pulses. But how they work? How we can use a remote controller in our project?"}, {"start": 1104.24, "end": 1111.0400000000002, "text": "There are IR remote receiver components out in market in various shapes, types, and part numbers."}, {"start": 1111.0400000000002, "end": 1119.3600000000001, "text": "But one of the most popular one is this. With three pins. Two of them are for powering of the component,"}, {"start": 1119.36, "end": 1130.32, "text": "and third one is for data. This is sample circuit of three-pin infrared receiver."}, {"start": 1135.9199999999998, "end": 1141.52, "text": "If I press any button on remote controller, pulses come into LED and we can see it."}, {"start": 1149.36, "end": 1159.36, "text": "In one of my next videos, I will fully explain IR remote controllers and receivers, and will make"}, {"start": 1159.36, "end": 1167.12, "text": "a simple project with them to demonstrate how exactly they work. So, that's it. We considered"}, {"start": 1167.12, "end": 1173.4399999999998, "text": "three main types of diodes with eight applications of them. Even though there are other types of diodes"}, {"start": 1173.44, "end": 1180.56, "text": "with other applications, I think it's enough for now. I hope you enjoy it. Thanks for watching. If you"}, {"start": 1180.56, "end": 1194.96, "text": "like this video, make sure to subscribe for more. Here. Hit this button."}]}