{"video_id": "BYvTEfNAi38", "url": "https://www.youtube.com/watch?v=BYvTEfNAi38", "title": "BYvTEfNAi38", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.44, "end": 4.62, "text": "There are two really important questions in control systems engineering."}, {"start": 5.22, "end": 8.040000000000001, "text": "Is your system controllable, and is it observable?"}, {"start": 8.72, "end": 11.18, "text": "Now, assuming you have a good linear model of your system,"}, {"start": 11.38, "end": 14.84, "text": "you can answer both of those questions using some simple matrix operations"}, {"start": 14.84, "end": 18.28, "text": "and the A, B, and C matrices of your state space model."}, {"start": 19.3, "end": 21.96, "text": "My experience, though, is in the aerospace industry,"}, {"start": 22.2, "end": 26.740000000000002, "text": "and I'll be honest, I've never actually used these equations at my job to analyze my system."}, {"start": 26.74, "end": 31.58, "text": "Now, I'm not saying other industries or other systems within aerospace won't use them."}, {"start": 31.82, "end": 33.62, "text": "It's just for the projects I've worked on,"}, {"start": 33.78, "end": 36.839999999999996, "text": "we've relied mostly on just having a good understanding of the system"}, {"start": 36.839999999999996, "end": 41.839999999999996, "text": "and then reasoning through the design to determine whether it was controllable or observable."}, {"start": 42.76, "end": 46.28, "text": "But with that being said, in order to develop that intuition,"}, {"start": 46.62, "end": 50.2, "text": "you have to have an understanding of the concept of controllability and observability."}, {"start": 50.459999999999994, "end": 54.519999999999996, "text": "And part of gaining that understanding comes from studying these equations."}, {"start": 54.52, "end": 57.160000000000004, "text": "So they're worth spending some time on."}, {"start": 57.980000000000004, "end": 59.78, "text": "Just not in this video."}, {"start": 60.160000000000004, "end": 63.120000000000005, "text": "We're not going to cover them at all, and I think with good reason."}, {"start": 63.68000000000001, "end": 67.88, "text": "I feel that Steve Brunton already has done a fantastic job describing the math"}, {"start": 67.88, "end": 71.78, "text": "behind these equations in his Control Bootcamp series that I've linked to below."}, {"start": 72.10000000000001, "end": 74.36, "text": "And rather than just duplicate what he's already done,"}, {"start": 74.62, "end": 78.44, "text": "I want to approach this topic from a more intuitive and conceptual direction."}, {"start": 78.44, "end": 83.82, "text": "That way, combined with the math, you'll have a deeper understanding of controllability and observability"}, {"start": 83.82, "end": 86.86, "text": "that I think will help you be a better control systems engineer."}, {"start": 87.52, "end": 89.64, "text": "I'm Brian, and welcome to a MATLAB Tech Talk."}, {"start": 90.7, "end": 95.78, "text": "To begin, let's look at what control system design requires at a very high level."}, {"start": 96.16, "end": 98.24, "text": "It starts with the system that you want to control."}, {"start": 98.88, "end": 104.25999999999999, "text": "And you're able to poke and prod the system with actuators that impart control forces and energy."}, {"start": 104.26, "end": 108.9, "text": "And then you can measure specific states of the system, like voltage, position, and temperature,"}, {"start": 109.24000000000001, "end": 112.06, "text": "with sensors that produce the output of the system."}, {"start": 112.98, "end": 116.24000000000001, "text": "And controller design comes down to figuring out how to use the sensor data,"}, {"start": 116.72, "end": 119.62, "text": "along with a reference signal or some kind of command,"}, {"start": 119.98, "end": 122.28, "text": "to generate the correct actuator commands."}, {"start": 122.76, "end": 124.80000000000001, "text": "And that's essentially all we're trying to do."}, {"start": 125.46000000000001, "end": 130.42000000000002, "text": "However, your controller design is bound to fail if your system doesn't have the appropriate actuators"}, {"start": 130.42, "end": 132.42, "text": "that can affect the right parts of the system,"}, {"start": 132.78, "end": 136.64, "text": "or if you don't have the appropriate sensors in place that can measure the right states."}, {"start": 137.29999999999998, "end": 141.0, "text": "Without both of those, you won't be able to adequately influence the system."}, {"start": 141.29999999999998, "end": 142.56, "text": "It won't be controllable."}, {"start": 142.95999999999998, "end": 144.94, "text": "Or you won't know how the system is changing."}, {"start": 145.39999999999998, "end": 146.66, "text": "It won't be observable."}, {"start": 147.61999999999998, "end": 153.6, "text": "In this way, controllability and observability are conditions of how the system works with the actuators"}, {"start": 153.6, "end": 158.7, "text": "and sensors, and it's not tied to a specific control technique like PID or pole placement."}, {"start": 159.14, "end": 163.79999999999998, "text": "If it's uncontrollable, you have to address that problem by changing the system or the actuators."}, {"start": 164.14, "end": 166.79999999999998, "text": "And the same goes for observability and the sensors."}, {"start": 168.4, "end": 171.48, "text": "Let's look at sort of a formal written definition of the two."}, {"start": 172.29999999999998, "end": 177.28, "text": "Controllability means that there exist control signals which allows the system to reach any state"}, {"start": 177.28, "end": 178.64, "text": "in a finite amount of time."}, {"start": 179.1, "end": 180.95999999999998, "text": "This is also called reachability."}, {"start": 180.96, "end": 186.52, "text": "Now, an important thing to realize is that controllability does not mean that the state"}, {"start": 186.52, "end": 190.3, "text": "must be maintained or held at that condition, just that it can be reached."}, {"start": 190.92000000000002, "end": 195.9, "text": "Now, to understand what this means, let's look at a nicely constrained problem like a monorail."}, {"start": 196.38, "end": 199.42000000000002, "text": "There are two states, position and velocity."}, {"start": 199.92000000000002, "end": 203.86, "text": "And we'll assume that the monorail is controllable, so by accelerating and braking,"}, {"start": 204.0, "end": 206.36, "text": "the monorail can get to any position on the track,"}, {"start": 206.36, "end": 210.08, "text": "and it can speed up to any velocity within the state space."}, {"start": 210.96, "end": 212.44, "text": "Here's the key about reachability."}, {"start": 212.92000000000002, "end": 215.74, "text": "Not only can each state variable be achieved individually,"}, {"start": 216.12, "end": 218.54000000000002, "text": "each combination of variables can also be achieved."}, {"start": 219.02, "end": 223.3, "text": "For example, we could accelerate in a way that could get us to a position of 1 kilometer"}, {"start": 223.3, "end": 225.18, "text": "at 50 kilometers per hour."}, {"start": 225.64000000000001, "end": 227.76000000000002, "text": "Hence, it can reach that state in the state space."}, {"start": 228.06, "end": 231.66, "text": "However, it should be obvious that it's physically impossible to maintain that state."}, {"start": 231.8, "end": 236.4, "text": "This is why controllability requires the system to be able to reach a state,"}, {"start": 236.4, "end": 238.26000000000002, "text": "but not necessarily maintain it."}, {"start": 240.14000000000001, "end": 242.26000000000002, "text": "Okay, let's move on to observability."}, {"start": 243.22, "end": 246.68, "text": "Observability means that all states can be known from the outputs of the system."}, {"start": 247.3, "end": 250.06, "text": "That is, we can know the value of every state in the system"}, {"start": 250.06, "end": 253.22, "text": "by using an appropriate selection of sensors and sensor locations."}, {"start": 254.04000000000002, "end": 255.84, "text": "Now, a quick side note about this, though."}, {"start": 256.18, "end": 258.26, "text": "As I mentioned in the last video on pole placement,"}, {"start": 258.26, "end": 262.26, "text": "it's impractical to impose the requirement that you know every state in a system."}, {"start": 262.68, "end": 266.96, "text": "There's just too many, and most don't impact the system in any meaningful way."}, {"start": 267.53999999999996, "end": 270.5, "text": "For example, the temperature of the monorail is a state,"}, {"start": 270.71999999999997, "end": 274.48, "text": "but knowing it is not necessary for controlling the position and velocity."}, {"start": 275.15999999999997, "end": 278.42, "text": "So when I say states, I'm really referring to all critical states."}, {"start": 278.92, "end": 282.68, "text": "And often the critical states are the ones that are in the state vector of your model,"}, {"start": 282.98, "end": 286.71999999999997, "text": "since your goal in modeling is usually to include only the relevant dynamics"}, {"start": 286.72, "end": 288.14000000000004, "text": "and leave out the rest."}, {"start": 288.68, "end": 292.74, "text": "Therefore, for observability, we want to know every state in our state vector."}, {"start": 293.98, "end": 296.3, "text": "Okay, with these definitions out of the way,"}, {"start": 296.46000000000004, "end": 299.96000000000004, "text": "let's see if we can make more sense of these concepts by looking at a few examples."}, {"start": 300.56, "end": 303.54, "text": "For now, let's ditch the constrained monorail problem"}, {"start": 303.54, "end": 306.34000000000003, "text": "and look at the higher dimensional state space of a car."}, {"start": 306.92, "end": 309.36, "text": "We'll say the states we care about are the xy position,"}, {"start": 309.64000000000004, "end": 312.48, "text": "the xy velocity, and the yaw angle and yaw rate."}, {"start": 312.96000000000004, "end": 316.06, "text": "And let's say for our sensors, we have a speedometer to measure velocity,"}, {"start": 316.06, "end": 319.24, "text": "and our eyes to assess pretty much everything else."}, {"start": 319.84, "end": 323.44, "text": "The actuators are the steering wheel and the gas and brake pedals."}, {"start": 324.04, "end": 327.64, "text": "It's essentially the actuators and sensors that you're using when you drive your car,"}, {"start": 327.8, "end": 329.86, "text": "and we can reason that with this setup,"}, {"start": 330.1, "end": 332.44, "text": "we'd be able to control the car to a specific position,"}, {"start": 332.6, "end": 334.72, "text": "at a given velocity and yaw angle."}, {"start": 335.7, "end": 338.32, "text": "Let's look at the concept of observability first"}, {"start": 338.32, "end": 341.3, "text": "and start with an extreme example to help illustrate its importance."}, {"start": 341.9, "end": 345.0, "text": "We remove all sensor information by closing our eyes."}, {"start": 345.0, "end": 347.8, "text": "This has the effect of zeroing out the C matrix,"}, {"start": 348.1, "end": 351.18, "text": "and basically we have no way of knowing any of the states."}, {"start": 351.68, "end": 354.82, "text": "You don't know where you are, what speed you're going, or the direction you're facing."}, {"start": 355.4, "end": 359.96, "text": "And let's assume for this example that you can't feel acceleration or hear the engine or anything."}, {"start": 360.68, "end": 362.24, "text": "Now, you can still control the car."}, {"start": 362.52, "end": 366.76, "text": "This hasn't been impacted since you're able to move the steering wheel and press on the pedals."}, {"start": 366.76, "end": 372.65999999999997, "text": "So, in this way, lack of observability made it so you can't control the car"}, {"start": 372.65999999999997, "end": 375.3, "text": "in the sense that you can't drive it safely to a destination."}, {"start": 375.94, "end": 379.98, "text": "However, the car is controllable within the definition that we said earlier."}, {"start": 380.36, "end": 384.52, "text": "So, that's something to keep in mind when you're talking about control and controllability."}, {"start": 385.3, "end": 387.44, "text": "Now, let's imagine the opposite situation."}, {"start": 387.86, "end": 390.08, "text": "We remove the steering wheel and the pedals,"}, {"start": 390.28, "end": 392.64, "text": "which has the effect of zeroing out the B matrix."}, {"start": 392.64, "end": 396.08, "text": "You can imagine how this could happen if you hit a large icy patch"}, {"start": 396.08, "end": 399.7, "text": "and the car skids along with no effect from steering or braking."}, {"start": 400.59999999999997, "end": 403.21999999999997, "text": "Even though you can't affect the state of the car,"}, {"start": 403.71999999999997, "end": 406.74, "text": "this system is still observable since you can watch the speedometer"}, {"start": 406.74, "end": 409.21999999999997, "text": "and you can track your position by looking outside."}, {"start": 410.14, "end": 415.34, "text": "So, you can see how it's necessary to have a system that is capable of being observed and controlled."}, {"start": 415.74, "end": 416.71999999999997, "text": "They work together."}, {"start": 416.72, "end": 422.82000000000005, "text": "I mean, it should be pretty obvious that without any actuators or without any sensors,"}, {"start": 423.08000000000004, "end": 424.54, "text": "your system is doomed to fail."}, {"start": 424.90000000000003, "end": 429.98, "text": "But what might not be obvious at first is that even a system that is partially uncontrollable"}, {"start": 429.98, "end": 432.3, "text": "or unobservable is still troublesome."}, {"start": 433.0, "end": 435.72, "text": "Imagine trying to drive your car with the steering wheel detached."}, {"start": 436.18, "end": 438.6, "text": "Even though you can still change its speed with the pedals,"}, {"start": 439.0, "end": 443.48, "text": "I bet you'd consider that an uncontrollable car since you'd have no way to change the yaw state."}, {"start": 443.48, "end": 447.28000000000003, "text": "And this is a common sentiment with all control systems."}, {"start": 447.84000000000003, "end": 453.1, "text": "If any one critical state is uncontrollable, then the entire system is deemed to be uncontrollable."}, {"start": 453.56, "end": 458.42, "text": "And if any one critical state is unobservable, then the entire system is deemed to be unobservable."}, {"start": 459.62, "end": 463.58000000000004, "text": "Okay, let's now focus on what it means to observe a state."}, {"start": 464.14000000000004, "end": 467.26, "text": "Clearly, directly measuring a state is one way of knowing it."}, {"start": 467.72, "end": 471.34000000000003, "text": "However, we don't have to measure every state to infer its value."}, {"start": 471.34, "end": 477.17999999999995, "text": "Being able to estimate a state using available information is good enough to claim that the system is observable."}, {"start": 477.76, "end": 484.64, "text": "For example, with the monorail, we wouldn't have to install a speedometer and a position sensor in order to know both of those states."}, {"start": 485.34, "end": 491.52, "text": "Velocity can be estimated by differentiating position, and position can be estimated by integrating velocity."}, {"start": 492.12, "end": 495.35999999999996, "text": "So you'd only need to measure one of those states and you can infer the other."}, {"start": 495.36, "end": 501.2, "text": "This is why a system can still be observable even if the output y isn't full state."}, {"start": 501.66, "end": 505.44, "text": "That is, it doesn't contain a direct measurement of every state variable."}, {"start": 506.86, "end": 510.66, "text": "Estimating states is a good way to reduce the hardware complexity of your system."}, {"start": 511.34000000000003, "end": 518.1, "text": "Strategically measure only the necessary states with sensors, and then just estimate the rest using an observer, like a Kalman filter."}, {"start": 518.1, "end": 526.26, "text": "With that being said, even if you can estimate a state, some states could be highly sensitive to modeling and measurement errors."}, {"start": 526.78, "end": 531.82, "text": "For example, differentiating a noisy position creates an even noisier velocity."}, {"start": 532.28, "end": 536.96, "text": "Or a small bias in velocity measurement would cause an ever-growing error in position."}, {"start": 537.5400000000001, "end": 538.94, "text": "So we have this trade-off."}, {"start": 538.94, "end": 550.2, "text": "Observations can be sensitive to errors, but adding additional sensors all over your system can be expensive in cost, or weight, or complexity, or whatever metric it is that's important to your design."}, {"start": 550.9000000000001, "end": 553.46, "text": "So we need to find a way to balance that trade-off."}, {"start": 553.98, "end": 557.58, "text": "Which states should we measure, and which states should we estimate?"}, {"start": 557.58, "end": 568.9200000000001, "text": "Now if your system is difficult to reason through, the observability equations provide a methodical way to assess whether the states can be observed from the given outputs, and a measure of their effectiveness."}, {"start": 569.5400000000001, "end": 573.6, "text": "So you do have a way of determining whether you have the right sensors in the right places."}, {"start": 574.74, "end": 580.48, "text": "There are a few more things that I want to cover here, and to do so let's consider a flexible cantilevered beam."}, {"start": 580.48, "end": 588.54, "text": "If you imagine pulling down on the end of the beam and letting it flick back up, it'll vibrate in some way that's governed by the mechanical properties of the beam."}, {"start": 588.9200000000001, "end": 592.5, "text": "And it'll eventually come to rest on its own after all of the energy has been damped out."}, {"start": 593.28, "end": 598.32, "text": "Now your job is to develop an active damping system that will stop the vibration faster."}, {"start": 598.94, "end": 606.14, "text": "You have access to accelerometers to measure the motion, and actuators that move a countermass with a damper to remove energy from the system."}, {"start": 606.14, "end": 613.02, "text": "And for simplicity, we'll say that a sensor and actuator comes in a single package, so they have to be placed in the same location."}, {"start": 613.46, "end": 616.46, "text": "But where you place them along the beam is up to you."}, {"start": 617.14, "end": 622.8199999999999, "text": "Well, with the exception that you can't place it at the tip of the beam due to other engineering constraints."}, {"start": 623.5, "end": 628.46, "text": "So the question is, where should you place it, and how does that placement affect controllability and observability?"}, {"start": 629.12, "end": 633.72, "text": "Well, we might reason that the beam motion will be larger the closer we get to the tip of the beam."}, {"start": 633.72, "end": 639.0400000000001, "text": "So if we place our hardware as close as we can to the end, it would produce the most motion for the sensor."}, {"start": 639.44, "end": 643.5, "text": "So it'll be easier to sense and allow the actuator to damp more energy."}, {"start": 644.24, "end": 646.1600000000001, "text": "And visually, this looks like it might work."}, {"start": 647.46, "end": 652.1600000000001, "text": "However, the motion of the beam consists of contributions from a number of distinct bending modes."}, {"start": 652.5600000000001, "end": 655.76, "text": "The first bending mode waves up and down, maybe like you'd expect."}, {"start": 656.1, "end": 659.78, "text": "And then the second and third modes have slightly more complicated mode shapes."}, {"start": 659.78, "end": 667.1, "text": "But the thing to notice is that our sensor and actuator location is placed directly at a node for the second bending mode."}, {"start": 668.0, "end": 673.18, "text": "In this case, our original ideal placement is fantastic for the first and third bending modes,"}, {"start": 673.4, "end": 678.38, "text": "but makes the second bending mode both unobservable, since the sensor wouldn't measure any motion,"}, {"start": 678.76, "end": 682.52, "text": "and uncontrollable, since the actuator would have no impact on this mode."}, {"start": 682.52, "end": 690.8, "text": "If we designed a controller with this hardware location, we'd find that no matter how hard we tuned the controller or came up with fancy mathematics,"}, {"start": 691.28, "end": 693.98, "text": "the beam would still vibrate at the second bending mode."}, {"start": 694.84, "end": 700.22, "text": "So rather than adding a second sensor and actuator at a location that's ideal for the second mode,"}, {"start": 700.68, "end": 707.78, "text": "a cheaper alternative might be to just move the sensor and actuator to a place that can observe and control all of the critical bending modes."}, {"start": 707.78, "end": 715.0799999999999, "text": "In doing this, however, we've reduced our ability to control the first mode and increased the cost of actuation,"}, {"start": 715.4599999999999, "end": 720.24, "text": "since the beam doesn't physically move as much at this new location for the first bending mode."}, {"start": 720.6999999999999, "end": 725.86, "text": "That is, it takes more effort for our actuator to dump the first mode from this location than it would the other."}, {"start": 726.3199999999999, "end": 731.12, "text": "So we get the benefit of handling the first three bending modes, but at the expense of effectiveness."}, {"start": 731.78, "end": 733.86, "text": "Perhaps that's a good compromise, though."}, {"start": 733.86, "end": 742.88, "text": "Okay, hopefully you now have a better understanding of why controllability and observability are concepts that you need to understand and consider"}, {"start": 742.88, "end": 746.92, "text": "when analyzing your system and your actuators and your sensors."}, {"start": 747.54, "end": 752.62, "text": "Now, the equations I showed earlier provide a systematic way of assessing everything I just talked about."}, {"start": 753.04, "end": 754.86, "text": "They can check for observability and controllability."}, {"start": 755.88, "end": 759.98, "text": "They can help you think about the most effective places to add sensors and actuators,"}, {"start": 759.98, "end": 764.32, "text": "and to determine which states you should measure and which you should just estimate."}, {"start": 765.02, "end": 771.0, "text": "And again, I do think it's important to understand these equations in detail and how you can perform these analyses in MATLAB,"}, {"start": 771.22, "end": 776.76, "text": "because even if you don't use them, it will be a good foundation on which you can build your intuition."}, {"start": 777.76, "end": 783.0, "text": "MathWorks has put together a page with links to videos and other resources showing how to analyze controllability"}, {"start": 783.5600000000001, "end": 786.14, "text": "and, in general, work with states-based models."}, {"start": 786.14, "end": 792.74, "text": "And if you want to learn more about why these equations work, definitely check out Steve Brunton's Control Boot Camp videos."}, {"start": 793.12, "end": 796.04, "text": "Links are in the description for everything I just talked about."}, {"start": 796.66, "end": 800.38, "text": "Now, if you don't want to miss the next Tech Talk video, don't forget to subscribe to this channel."}, {"start": 800.86, "end": 806.04, "text": "Also, if you want to check out my channel, Control System Lectures, I cover more control theory topics there as well."}, {"start": 806.04, "end": 808.38, "text": "Thanks for watching, and I'll see you next time."}]}