{"video_id": "hpeKrMG-WP0", "url": "https://www.youtube.com/watch?v=hpeKrMG-WP0", "title": "hpeKrMG-WP0", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.96, "end": 5.5600000000000005, "text": "In this video, I'm going to introduce state space equations, the model representation"}, {"start": 5.5600000000000005, "end": 7.5600000000000005, "text": "of choice for modern control."}, {"start": 7.5600000000000005, "end": 10.72, "text": "However, before we begin, a quick warning."}, {"start": 10.72, "end": 14.08, "text": "We're not going to go into depth on the mathematics of state space."}, {"start": 14.08, "end": 17.52, "text": "After this video, you're probably not going to be able to write out the equations for"}, {"start": 17.52, "end": 19.56, "text": "any arbitrary system."}, {"start": 19.56, "end": 23.86, "text": "But what I think you will get is a good intuitive understanding of these equations, which can"}, {"start": 23.86, "end": 27.32, "text": "be a foundation that you can build on as you learn more."}, {"start": 27.32, "end": 30.96, "text": "At the very least, it might clear up a few lingering questions you might have."}, {"start": 30.96, "end": 33.0, "text": "So with that in mind, let's get to it."}, {"start": 33.0, "end": 37.120000000000005, "text": "I'm Brian, and welcome to a MATLAB Tech Talk."}, {"start": 37.120000000000005, "end": 41.26, "text": "I think an interesting thing about dynamic systems is that they can be represented by"}, {"start": 41.26, "end": 43.519999999999996, "text": "ordinary differential equations."}, {"start": 43.519999999999996, "end": 47.92, "text": "This is because they have this property that how the system is changing at any given time"}, {"start": 47.92, "end": 50.32, "text": "is a function of its current state."}, {"start": 50.32, "end": 54.5, "text": "If we zip through the derivation for a spring-mass system real quick, you can see we end up with"}, {"start": 54.5, "end": 56.44, "text": "a differential equation."}, {"start": 56.44, "end": 62.339999999999996, "text": "Now the way that the system is changing, acceleration, is a function of the current state, position."}, {"start": 62.339999999999996, "end": 66.1, "text": "If this dynamic system was initialized with some energy, it would continue to move on its"}, {"start": 66.1, "end": 71.38, "text": "own because of this relationship between the derivative of the state and the state itself."}, {"start": 71.38, "end": 76.52, "text": "Think about initializing this system by stretching the spring and letting it go."}, {"start": 76.52, "end": 81.44, "text": "Acceleration changes velocity, which changes position, and then that changes acceleration again."}, {"start": 81.44, "end": 86.34, "text": "And it's going to oscillate back and forth without you having to add any external inputs."}, {"start": 86.34, "end": 91.1, "text": "Since there's no damping in this system, the energy is conserved, and this acceleration-velocity-position"}, {"start": 91.1, "end": 93.84, "text": "cycle will continue forever."}, {"start": 93.84, "end": 98.9, "text": "For any arbitrary dynamic system, if we look at how the energy changes by analyzing the relationship"}, {"start": 98.9, "end": 103.66, "text": "between its states and their derivatives, we can make claims about things like the stability"}, {"start": 103.66, "end": 104.92, "text": "of the system."}, {"start": 104.92, "end": 107.06, "text": "Is the energy being dissipated over time?"}, {"start": 107.06, "end": 108.62, "text": "Then the system is stable."}, {"start": 108.62, "end": 112.28, "text": "And the faster the energy is dissipated, the more stable it is."}, {"start": 112.28, "end": 117.30000000000001, "text": "If the energy is growing unbounded over time, even for just a part of it, then the system"}, {"start": 117.30000000000001, "end": 119.88, "text": "as a whole is unstable."}, {"start": 119.88, "end": 123.69999999999999, "text": "Energy is an inherent property of a system simply from the way that the states and their"}, {"start": 123.69999999999999, "end": 126.47999999999999, "text": "derivatives are connected to each other."}, {"start": 126.47999999999999, "end": 130.9, "text": "The way the system moves, however, can also be influenced by external energy being added"}, {"start": 130.9, "end": 132.7, "text": "or removed over time."}, {"start": 132.7, "end": 137.18, "text": "So the derivatives of a dynamic system are a function of both the current state as well"}, {"start": 137.18, "end": 139.6, "text": "as any external inputs."}, {"start": 139.6, "end": 144.98, "text": "In state space, representation is simply a repackaging of the high-order differential equations into"}, {"start": 144.98, "end": 149.84, "text": "a set of first-order differential equations that focus on this relationship."}, {"start": 149.84, "end": 153.62, "text": "This repackaging can make the system easier to analyze because we can look at the underlying"}, {"start": 153.62, "end": 158.4, "text": "behavior of the interconnected system as well as how the system is affected by external"}, {"start": 158.4, "end": 164.18, "text": "inputs, even multiple external inputs, which is really powerful."}, {"start": 164.18, "end": 168.76, "text": "There are also a lot of control techniques that are built on state space models, like Kalman"}, {"start": 168.76, "end": 175.1, "text": "filtering, LQR control, robust control, and model predictive control to just name a few."}, {"start": 175.1, "end": 179.62, "text": "There are also numerical solution benefits when simulating your system as a state space model,"}, {"start": 179.62, "end": 184.16, "text": "since you build the vector of the derivatives first and then integrate the whole vector to"}, {"start": 184.16, "end": 185.54, "text": "get the states."}, {"start": 185.54, "end": 189.34, "text": "So all in all, they're pretty awesome and worth learning."}, {"start": 189.34, "end": 193.44, "text": "Now let's take a moment to look at the state space equations in more detail and try to make"}, {"start": 193.44, "end": 195.29999999999998, "text": "a little sense of them."}, {"start": 195.29999999999998, "end": 200.74, "text": "For this, we'll focus on the continuous form for a linear time-invariant system."}, {"start": 200.74, "end": 202.4, "text": "There are two equations."}, {"start": 202.4, "end": 206.18, "text": "The first one is the state equation, which we've already developed a little intuition"}, {"start": 206.18, "end": 212.18, "text": "around, and the second equation is the output equation, which I'll get to in just a bit."}, {"start": 212.18, "end": 216.26000000000002, "text": "State space representation is built around the state vector x."}, {"start": 216.26000000000002, "end": 219.24, "text": "This is a vector of all of the state variables."}, {"start": 219.24, "end": 224.46, "text": "And how the state vector changes, or the derivative of the state vector, is a linear combination"}, {"start": 224.46, "end": 229.10000000000002, "text": "of the current state plus a linear combination of the external inputs."}, {"start": 229.1, "end": 233.06, "text": "In this way, we're not trying to look at the entire dynamics of the system end-to-end like"}, {"start": 233.06, "end": 237.82, "text": "we would with a high-order differential equation or a transfer function, but rather focus on"}, {"start": 237.82, "end": 243.42, "text": "the dynamics of each state variable, and how those variables relate to each other."}, {"start": 243.42, "end": 247.51999999999998, "text": "How does the first state change as a function of all of the states and all of the inputs?"}, {"start": 247.51999999999998, "end": 250.98, "text": "How does the second state change as a function of all of the states and inputs?"}, {"start": 250.98, "end": 252.2, "text": "And so on."}, {"start": 252.2, "end": 255.98, "text": "And since we're only ever looking at the first derivative of each state, we end up with"}, {"start": 255.98, "end": 258.76, "text": "a set of first-order differential equations."}, {"start": 258.76, "end": 263.59999999999997, "text": "What we're left with is a system of linear equations that we can package into matrix form."}, {"start": 263.59999999999997, "end": 267.65999999999997, "text": "And if linear algebra is good for anything, it's definitely solving a system of linear"}, {"start": 267.65999999999997, "end": 268.65999999999997, "text": "equations."}, {"start": 268.65999999999997, "end": 274.2, "text": "It is this repackaging into matrix form that gives us access to a lot of mathematical tools"}, {"start": 274.2, "end": 276.5, "text": "that we didn't have before."}, {"start": 276.5, "end": 281.71999999999997, "text": "The matrix form of the state equation has two matrices, A and B."}, {"start": 281.71999999999997, "end": 286.65999999999997, "text": "The A matrix describes how the internal states are all connected to each other, the underlying"}, {"start": 286.66, "end": 288.5, "text": "dynamics of the system."}, {"start": 288.5, "end": 295.56, "text": "And the B matrix describes how the inputs enter into the system, which states are they affecting."}, {"start": 295.56, "end": 298.08000000000004, "text": "Now let's look at the output equation."}, {"start": 298.08000000000004, "end": 303.04, "text": "Y is a vector of the outputs of the system, or the part that you're interested in knowing."}, {"start": 303.04, "end": 308.16, "text": "The important thing to realize is that the outputs are not necessarily the state variables."}, {"start": 308.16, "end": 312.70000000000005, "text": "The C matrix describes how the states are combined to get the outputs."}, {"start": 312.70000000000005, "end": 317.98, "text": "And the D matrix is used to allow the inputs to bypass the system altogether and feed forward"}, {"start": 317.98, "end": 319.44, "text": "to the output."}, {"start": 319.44, "end": 324.40000000000003, "text": "A real simple example of the D matrix in action would be the state space representation of a"}, {"start": 324.40000000000003, "end": 327.74, "text": "simple multiplier, a gain block."}, {"start": 327.74, "end": 330.74, "text": "The output equals the input times the gain."}, {"start": 330.74, "end": 335.54, "text": "So in this way the A, B, and C matrices are all zero, since there are no derivatives and"}, {"start": 335.54, "end": 336.7, "text": "no states."}, {"start": 336.7, "end": 340.04, "text": "And the D matrix is the value of the gain."}, {"start": 340.04, "end": 343.62, "text": "Now the importance of the output equation will become obvious when we start feeding back"}, {"start": 343.62, "end": 347.26, "text": "the outputs to develop a closed loop controller for our system."}, {"start": 347.26, "end": 350.3, "text": "But for now it's enough to understand the structure of the equation."}, {"start": 350.3, "end": 353.8, "text": "And in the next video on feedback control we'll go into more depth on the relationship"}, {"start": 353.8, "end": 357.38, "text": "between the output and state equations."}, {"start": 357.38, "end": 361.26, "text": "As you might have noticed, the state variables are the key to the whole thing."}, {"start": 361.26, "end": 365.2, "text": "They show up in three places and are the part of the representation that I think is the hardest"}, {"start": 365.2, "end": 366.98, "text": "to conceptualize."}, {"start": 366.98, "end": 370.46000000000004, "text": "Therefore understanding what they are is really important."}, {"start": 370.46000000000004, "end": 375.96000000000004, "text": "The state variables are the minimum set of variables that fully describe the system."}, {"start": 375.96000000000004, "end": 380.40000000000003, "text": "Fully described means that we have enough information about the changing part of the system, or the"}, {"start": 380.4, "end": 385.14, "text": "variable part, that we can predict the system's future behavior."}, {"start": 385.14, "end": 389.44, "text": "This will make more sense if we go back to the spring mass system and suss out what the"}, {"start": 389.44, "end": 394.15999999999997, "text": "state variables are by starting with no information about the system."}, {"start": 394.15999999999997, "end": 398.5, "text": "If I draw the spring and mass like this and asked you to predict where the system will be"}, {"start": 398.5, "end": 401.58, "text": "in one second, what information would you need?"}, {"start": 401.58, "end": 406.56, "text": "Well, you'd want to know the system constants, like the spring constant and mass, and we'd want"}, {"start": 406.56, "end": 410.56, "text": "to know what the external force is that's acting on the mass, so the inputs."}, {"start": 410.56, "end": 414.62, "text": "But this only tells you part of the story because you don't know what you might call the initial"}, {"start": 414.62, "end": 418.04, "text": "conditions for the variable parts of the system."}, {"start": 418.04, "end": 419.96, "text": "Is the mass currently moving?"}, {"start": 419.96, "end": 422.82, "text": "And how hard is the spring pulling on the mass?"}, {"start": 422.82, "end": 427.5, "text": "Now if we knew these two starting conditions, along with the system constants and inputs,"}, {"start": 427.5, "end": 431.68, "text": "then we would be able to predict where the mass would be after one second."}, {"start": 431.68, "end": 434.36, "text": "So let's consider the first question."}, {"start": 434.36, "end": 436.44, "text": "Is the mass currently moving?"}, {"start": 436.44, "end": 439.0, "text": "We would know this from the velocity of the mass."}, {"start": 439.0, "end": 443.26, "text": "And velocity is variable since the mass would be oscillating back and forth, assuming there"}, {"start": 443.26, "end": 445.38, "text": "was some energy in the system."}, {"start": 445.38, "end": 450.28000000000003, "text": "So we need velocity in order to predict the future position, so we can say that velocity"}, {"start": 450.28000000000003, "end": 451.98, "text": "is a state variable."}, {"start": 451.98, "end": 454.16, "text": "It's necessary."}, {"start": 454.16, "end": 456.96000000000004, "text": "Now let's turn to the initial spring force."}, {"start": 456.96000000000004, "end": 460.68, "text": "Force is also a variable, but let's think about how we would derive it."}, {"start": 460.68, "end": 464.64, "text": "It's the spring constant times the distance that the spring is stretched."}, {"start": 464.64, "end": 468.8, "text": "So if we have that distance, or the position of the mass relative to the unstretched length"}, {"start": 468.8, "end": 472.06, "text": "of spring, then we would be able to get spring force."}, {"start": 472.06, "end": 477.36, "text": "So the minimum number of variables we need to fully describe this system is two, position"}, {"start": 477.36, "end": 478.96000000000004, "text": "and velocity."}, {"start": 478.96000000000004, "end": 482.64, "text": "And since there are two, this is a second order system."}, {"start": 482.64, "end": 486.36, "text": "So a natural question now might be why not more states?"}, {"start": 486.36, "end": 487.91999999999996, "text": "Why not three?"}, {"start": 487.91999999999996, "end": 490.74, "text": "Well to answer that, let's consider acceleration."}, {"start": 490.74, "end": 494.52, "text": "It's a variable since it's changing along with position and velocity."}, {"start": 494.52, "end": 499.82, "text": "However, we don't need to know acceleration to fully describe the system."}, {"start": 499.82, "end": 502.4, "text": "Acceleration is a result of force acting on a mass."}, {"start": 502.4, "end": 506.2, "text": "And force, in this case, is a byproduct of the position of the mass."}, {"start": 506.2, "end": 511.2, "text": "Therefore, we get acceleration through position, and adding acceleration to your list of state"}, {"start": 511.2, "end": 513.86, "text": "variables is just extra information."}, {"start": 513.86, "end": 518.2, "text": "Now something that might seem strange at first is that if we add a damper into the system,"}, {"start": 518.2, "end": 522.28, "text": "we're not increasing the order of the system, because we don't need any additional state"}, {"start": 522.28, "end": 525.38, "text": "variables to account for this additional element."}, {"start": 525.38, "end": 529.98, "text": "The force from the damper is determined by the velocity of the mass, which, again, we already"}, {"start": 529.98, "end": 532.14, "text": "have in our state variable list."}, {"start": 532.14, "end": 537.8, "text": "So both of these systems have the same number of state variables, too."}, {"start": 537.8, "end": 541.66, "text": "Now a way you can verify that you have the right number of states needed to describe a"}, {"start": 541.66, "end": 545.14, "text": "system is to count the energy storage devices that your system has."}, {"start": 545.14, "end": 549.48, "text": "Now I'm not going to go into too much detail here, because I think Dr. Rick Hill has done"}, {"start": 549.48, "end": 554.74, "text": "a great job of explaining it in his YouTube video that I've linked in the description below."}, {"start": 554.74, "end": 557.04, "text": "But the general idea is this."}, {"start": 557.04, "end": 560.64, "text": "A dynamic system stores energy in various ways."}, {"start": 560.64, "end": 564.28, "text": "In our spring mass system, there's two energy storage elements."}, {"start": 564.28, "end": 570.6, "text": "The spring, which stores potential energy, and the mass, which stores kinetic energy."}, {"start": 570.6, "end": 575.16, "text": "The dynamic system moves and changes on its own simply because the energy that exists within"}, {"start": 575.16, "end": 579.9399999999999, "text": "the system transfers back and forth between storage elements and eventually dissipates through"}, {"start": 579.9399999999999, "end": 583.08, "text": "heat, which is ultimately lost to the environment."}, {"start": 583.08, "end": 587.96, "text": "At any given time, if we know how much energy is stored in each element, then we know its state,"}, {"start": 587.96, "end": 591.6, "text": "and have the information needed to fully understand the state of the system."}, {"start": 591.6, "end": 595.6, "text": "Now, the states don't represent the energy directly."}, {"start": 595.6, "end": 598.4000000000001, "text": "They're just needed to determine the energy."}, {"start": 598.4000000000001, "end": 602.6, "text": "For the spring mass system, we know the energy in the mass from the velocity of the mass."}, {"start": 602.6, "end": 607.6, "text": "And we know the energy in the spring from the position, or how far the spring is stretched."}, {"start": 607.6, "end": 612.24, "text": "And if we know how those energies are connected within the system, or another way of putting"}, {"start": 612.24, "end": 617.94, "text": "it, how each state absorbs and loses energy based on the current state of the system, then"}, {"start": 617.94, "end": 620.84, "text": "we fully understand the system itself."}, {"start": 620.84, "end": 624.24, "text": "And this is essentially what state space representation is doing for us."}, {"start": 624.24, "end": 628.76, "text": "It's looking at the state variables, how the energy is stored, and combining them according"}, {"start": 628.76, "end": 633.76, "text": "to how energy is transferred between states, and adding in any additional energy from the"}, {"start": 633.76, "end": 635.34, "text": "external sources."}, {"start": 635.34, "end": 640.38, "text": "And with a few special caveats that Professor Hill describes, that is why the number of energy"}, {"start": 640.38, "end": 643.82, "text": "storage elements in your system equals the number of states."}, {"start": 643.82, "end": 649.34, "text": "So our spring mass damper is still a second order system, since a damper doesn't store energy,"}, {"start": 649.34, "end": 651.24, "text": "it just dissipates it."}, {"start": 651.24, "end": 655.88, "text": "So, we know the order has to be 2, but why not 2 different states?"}, {"start": 655.88, "end": 657.5600000000001, "text": "Why position and velocity?"}, {"start": 657.5600000000001, "end": 662.42, "text": "Well, they don't have to be, and here's where things can get a little confusing."}, {"start": 662.42, "end": 667.1800000000001, "text": "The state variables, position and velocity, can be thought of as coordinate systems within"}, {"start": 667.1800000000001, "end": 669.0600000000001, "text": "a state space."}, {"start": 669.0600000000001, "end": 673.12, "text": "Go over 5 position units, and up 3 velocity units."}, {"start": 673.12, "end": 678.1800000000001, "text": "This point in the state space is the current state of the system, and the state vector describes"}, {"start": 678.1800000000001, "end": 679.88, "text": "that location."}, {"start": 679.88, "end": 685.52, "text": "So we can describe this location in the state space with any two linearly independent variables,"}, {"start": 685.52, "end": 688.52, "text": "some arbitrary state 1 and state 2."}, {"start": 688.52, "end": 692.76, "text": "We're going to end up with the same system state in the end, it's the same energy, just"}, {"start": 692.76, "end": 696.2, "text": "with different coordinates."}, {"start": 696.2, "end": 700.52, "text": "And we do this redefining of state variables all the time with state space representation."}, {"start": 700.52, "end": 705.56, "text": "That's what we're doing, for example, when we diagonalize the A matrix to get it into so-called"}, {"start": 705.56, "end": 706.16, "text": "modal form."}, {"start": 706.16, "end": 714.8, "text": "We've just chosen a different set of coordinates, a different basis for our state vector."}, {"start": 714.8, "end": 720.24, "text": "So, state vector x is made up of position and velocity, and state vector z is made up"}, {"start": 720.24, "end": 726.8399999999999, "text": "of two modal states, and these particular states change as a function of just themselves."}, {"start": 726.8399999999999, "end": 731.92, "text": "That is, state 1 does not rely on the current value of state 2, and vice versa."}, {"start": 731.92, "end": 735.9799999999999, "text": "And if we were able to write out the state's base representation directly in modal form,"}, {"start": 735.9799999999999, "end": 737.56, "text": "then maybe we would."}, {"start": 737.56, "end": 741.42, "text": "There's nothing really special about position and velocity for state variables, other than"}, {"start": 741.42, "end": 745.14, "text": "they are quantities that make intuitive sense to us."}, {"start": 745.14, "end": 750.18, "text": "However, since the states are no longer defined as position and velocity, the C matrix needs"}, {"start": 750.18, "end": 754.88, "text": "to change if we want to keep the outputs position and velocity."}, {"start": 754.88, "end": 757.54, "text": "In this way we can see the benefit of the output equation."}, {"start": 757.54, "end": 762.06, "text": "We're not forced to output the states exactly as we define them, but rather have the ability"}, {"start": 762.06, "end": 766.02, "text": "to linearly combine them into variables that we're interested in."}, {"start": 766.02, "end": 770.0999999999999, "text": "Okay, that's where I'm going to leave this video for now."}, {"start": 770.1, "end": 773.7, "text": "I hope this has helped you think about the state's base equations in a slightly different"}, {"start": 773.7, "end": 774.7, "text": "way."}, {"start": 774.7, "end": 779.52, "text": "Rather than thinking of them as a set of matrices that repackage the model into arbitrary first"}, {"start": 779.52, "end": 783.78, "text": "order differential equations, we can think about them as writing out the dynamics for"}, {"start": 783.78, "end": 786.14, "text": "each state variable separately."}, {"start": 786.14, "end": 791.08, "text": "And the dynamics are tied to how energy is stored and transferred within the system."}, {"start": 791.08, "end": 794.7, "text": "By doing this we get the benefit of being able to understand how these internal states"}, {"start": 794.7, "end": 796.78, "text": "change and relate to each other."}, {"start": 796.78, "end": 801.06, "text": "How the energy is moving around and we get to use the powerful tools in linear algebra"}, {"start": 801.06, "end": 803.92, "text": "to analyze and solve the equations."}, {"start": 803.92, "end": 808.36, "text": "Now MATLAB and Simulink are great environments to work with states-based systems."}, {"start": 808.36, "end": 813.4, "text": "You can convert to states-based from a transfer function, manipulate the matrices, simulate them,"}, {"start": 813.4, "end": 817.36, "text": "and design and analyze control systems using a number of built-in tools."}, {"start": 817.36, "end": 821.62, "text": "And I'm going to be using MATLAB to demonstrate control techniques with states-based equations for"}, {"start": 821.62, "end": 822.78, "text": "the rest of this series."}, {"start": 822.78, "end": 827.42, "text": "So if you're not familiar with using states-based in MATLAB, or if you're looking for a quick"}, {"start": 827.42, "end": 832.42, "text": "refresher, I've linked a few videos in the description that are worth checking out."}, {"start": 832.42, "end": 836.5, "text": "In the next video in this series, I'll go through the design of a simple feedback control"}, {"start": 836.5, "end": 839.76, "text": "system using states-based representation."}, {"start": 839.76, "end": 843.02, "text": "If you don't want to miss the next Tech Talk video, don't forget to subscribe to this"}, {"start": 843.02, "end": 844.02, "text": "channel."}, {"start": 844.02, "end": 847.46, "text": "Also, if you want to check out my channel, Control System Lectures, I cover more control"}, {"start": 847.46, "end": 849.66, "text": "theory topics there as well."}, {"start": 849.66, "end": 851.16, "text": "Thanks for watching, and I'll see you next time."}]}