{"video_id": "jhvXWpRmhvM", "url": "https://www.youtube.com/watch?v=jhvXWpRmhvM", "title": "jhvXWpRmhvM", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 8.4, "text": "Oh, hi there! I was just testing out my new speaker setup complete with tweeters, woofers, and subwoofers."}, {"start": 8.4, "end": 12.24, "text": "What's that? You want to know what those things are? Well then I guess you came to the right place."}, {"start": 12.24, "end": 18.42, "text": "Speakers of all kinds convert an electrical signal into sound waves, allowing us to listen to music and other sounds"}, {"start": 18.42, "end": 25.32, "text": "from a recording or a live broadcast. Now, sound has an extremely wide frequency range overall,"}, {"start": 25.32, "end": 30.72, "text": "much of which is actually inaudible to humans. So it's not really fair to expect that one type of speaker"}, {"start": 30.72, "end": 36.24, "text": "should be able to produce sounds at reasonable listening volumes over the entirety of that range."}, {"start": 36.24, "end": 41.94, "text": "That is where tweeters, woofers, and subwoofers come in. And yes, before you comment down below about how"}, {"start": 41.94, "end": 47.82, "text": "those aren't the only three types of speakers you completely missed with rotary subwoofers and speaker type XYZ,"}, {"start": 47.82, "end": 53.44, "text": "I know that they're not the only three types of speakers available, but they are three of the most common types,"}, {"start": 53.44, "end": 58.78, "text": "and they are what we'll be focusing on today, smarty pants. So let's start with the highs, tweeters."}, {"start": 58.78, "end": 66.82, "text": "Typically tweeters cover the 2,000 to 20,000 Hertz frequency range, with 20,000 being the top of the audible range for humans."}, {"start": 66.82, "end": 72.64, "text": "Most tweeters use dynamic drivers, which we actually covered a bit in our video about headphone driver types right here,"}, {"start": 72.64, "end": 79.06, "text": "which utilize a voice coil suspended in a magnetic field which is attached to a cone or diaphragm, a thin membrane,"}, {"start": 79.06, "end": 86.4, "text": "which actuates and moves air to produce the sound that you hear. But how do we determine what is and isn't a tweeter then?"}, {"start": 86.4, "end": 93.4, "text": "The answer is actually pretty simple. Size. To produce a high frequency noise, the speaker must move extremely quickly,"}, {"start": 93.4, "end": 99.98, "text": "and a small speaker is much easier to vibrate fast enough to produce those higher frequencies than a large speaker."}, {"start": 99.98, "end": 110.32000000000001, "text": "And though there isn't a specific size that quantifies a speaker as a tweeter, tweeters are usually going to be the smallest speaker on a particular audio setup."}, {"start": 110.32000000000001, "end": 114.98, "text": "But luckily for all you bass heads out there, not every speaker is a tiny little tweeter."}, {"start": 114.98, "end": 122.04, "text": "Woofers are broad-spectrum, low-ish frequency speakers with a typical range of 20 to 2,000 Hertz."}, {"start": 122.04, "end": 129.14000000000001, "text": "Interestingly enough, they were actually named woofers because their deep, heavy sounds can be reminiscent of the woof of a barking dog."}, {"start": 129.14, "end": 137.48, "text": "Like tweeters, most woofers use a dynamic driver, but unlike tweeters, woofers are almost always enclosed in an external housing."}, {"start": 137.48, "end": 144.98, "text": "Enclosures increase sound clarity and reduce distortion by preventing sound waves created at different locations from crossing"}, {"start": 144.98, "end": 150.14, "text": "and ensuring that the woofers can always receive the right amount of air for all the movement they need to do,"}, {"start": 150.14, "end": 152.7, "text": "usually a couple of strategically placed holes."}, {"start": 152.7, "end": 161.04, "text": "While woofers can produce sound at a fairly wide range of frequencies, they are a bit of a jack-of-all frequencies master of none, so to speak,"}, {"start": 161.04, "end": 164.04, "text": "especially at the maximum and minimum of their range."}, {"start": 164.04, "end": 172.54, "text": "So anything at or above 2,000 Hertz is best left to the tweeters, and the really low stuff is best left to our last speaker type, the subwoofer."}, {"start": 172.54, "end": 181.88, "text": "The name is pretty self-explanatory. They are sub or below a woofer, and the typical frequency range of a subwoofer is 20 to 200 Hertz,"}, {"start": 181.88, "end": 190.88, "text": "making it a perfect organ shaker for a variety of purposes, from raging parties to casual drives to work in your Alpine-sponsored 98 Civic."}, {"start": 190.88, "end": 197.22, "text": "Of course, not every application of subwoofers is ridiculous. When they're not configured to overpower everything else,"}, {"start": 197.22, "end": 205.22, "text": "they are an essential component of a well-balanced speaker system that adds impact and depth to the explosions in your movies and the bass in your music."}, {"start": 205.22, "end": 215.88, "text": "In a home theater, the subwoofer is usually situated in its own separate enclosure, and because it's designed to move large amounts of air with strong, slow, accurate vibrations,"}, {"start": 215.88, "end": 221.22, "text": "it usually uses its own power source to maintain a reasonable listening volume while doing so."}, {"start": 221.22, "end": 230.22, "text": "So there you have it. Why do we need different types of speakers? Well, because with only one type, we would be limiting our ability to represent the full range of human hearing accurately,"}, {"start": 230.22, "end": 234.72, "text": "making for a much less satisfying experience for audio enthusiasts everywhere."}, {"start": 234.72, "end": 241.32, "text": "And speaking of cruel sponsors, today's episode sponsors Fractal Design, and instead of having me talk about their, you know,"}, {"start": 241.32, "end": 248.28, "text": "classy, Scandinavian-designed computer cases, their efficient power supplies, their excellent cooling products,"}, {"start": 248.28, "end": 254.16, "text": "Fractal Design has instead opted to have me eat a ghost pepper on camera."}, {"start": 254.16, "end": 263.46, "text": "So, this is the package. These were ordered from Alamo Peppers, Alamo City Pepper Products, something along those lines."}, {"start": 263.46, "end": 266.46, "text": "These are dried peppers, net weight of half an ounce."}, {"start": 266.46, "end": 273.41999999999996, "text": "And I'm going to go ahead and assume that I'm not supposed to eat all of them in one go, so we're going to do just, just one."}, {"start": 273.41999999999996, "end": 280.29999999999995, "text": "Crack and open the seal. Really not looking forward to this. I probably shouldn't have done this to-"}, {"start": 280.29999999999995, "end": 282.7, "text": "Whoa, even the smell is strong."}, {"start": 282.7, "end": 290.29999999999995, "text": "Ooh, I probably shouldn't have watched someone else's pepper challenge before starting, but I did."}, {"start": 290.3, "end": 292.3, "text": "I don't know if I'm going to get this down."}, {"start": 292.3, "end": 293.3, "text": "Okay."}, {"start": 301.3, "end": 302.3, "text": "Whoa."}, {"start": 302.3, "end": 312.3, "text": "I get hiccups when I'm-"}, {"start": 312.3, "end": 314.3, "text": "Ooh, something's really spicy."}, {"start": 314.3, "end": 318.3, "text": "I don't know if I'm going to get this down."}, {"start": 326.3, "end": 327.3, "text": "Uh-oh."}, {"start": 327.3, "end": 329.3, "text": "I'm sorry, there's no way."}, {"start": 329.3, "end": 334.3, "text": "So, thanks for-"}, {"start": 334.3, "end": 340.3, "text": "Wow, I don't know how other people are doing this."}, {"start": 340.3, "end": 344.3, "text": "Oh."}, {"start": 344.3, "end": 345.3, "text": "Thanks for watching."}, {"start": 345.3, "end": 346.3, "text": "Like if you liked."}, {"start": 346.3, "end": 348.3, "text": "Dislike if you disliked."}, {"start": 348.3, "end": 352.3, "text": "I only swallowed a small amount of juice and I'm-"}, {"start": 352.3, "end": 353.3, "text": "Oh!"}, {"start": 353.3, "end": 354.3, "text": "I'm fire."}, {"start": 354.3, "end": 357.3, "text": "Don't forget to subscribe, comment, suggesting future episodes."}, {"start": 357.3, "end": 358.3, "text": "Bye!"}, {"start": 358.3, "end": 359.3, "text": "Bye!"}, {"start": 359.3, "end": 360.3, "text": "Bye!"}, {"start": 360.3, "end": 361.3, "text": "Bye!"}, {"start": 361.3, "end": 375.3, "text": "Bye!"}, {"start": 375.3, "end": 376.3, "text": "Cool!"}]}