{"video_id": "lAVYDUeqdW4", "url": "https://www.youtube.com/watch?v=lAVYDUeqdW4", "title": "lAVYDUeqdW4", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 7.0, "text": "Now back to the quadrotor dynamics. The equations at the bottom tell us the net force and the"}, {"start": 8.0, "end": 15.0, "text": "net moment. If we combine the net force and the net moment with the Newton-Euler equations,"}, {"start": 16.0, "end": 23.0, "text": "we get these two sets of equations. On the right side, you see the total thrust, which"}, {"start": 23.0, "end": 32.0, "text": "is U1, and remember this thrust vector is known in the body fixed frame. The matrix R is rotating"}, {"start": 33.0, "end": 41.0, "text": "this thrust vector to an inertial frame. At the bottom, you see the net moment, also known"}, {"start": 42.0, "end": 49.0, "text": "in the body fixed frame. But the equations, as they've been written, have components in the"}, {"start": 49.0, "end": 56.0, "text": "inertial frame on the top and in a body fixed frame at the bottom. These are the Newton-Euler"}, {"start": 57.0, "end": 64.0, "text": "equations, and these are the equations we'll use to develop controllers and planners for our vehicles."}, {"start": 67.0, "end": 74.0, "text": "One question you can ask is how we actually calculate these parameters? Or in an online setting,"}, {"start": 74.0, "end": 84.0, "text": "how do we estimate these parameters? If you think carefully, the parameters you really need to know are those"}, {"start": 85.0, "end": 93.0, "text": "corresponding to the geometry, the length L, for example, and those corresponding to the physical properties,"}, {"start": 93.0, "end": 104.0, "text": "the mass M and the inertia I. You can also see that these parameters appear linearly in these equations."}, {"start": 107.0, "end": 112.0, "text": "So if you had a system that allowed you to measure positions, velocities, and accelerations,"}, {"start": 113.0, "end": 118.0, "text": "it's actually not too hard to estimate the lengths, the masses, and the inertias."}, {"start": 118.0, "end": 125.0, "text": "You should also verify that it's quite easy to calculate the angular velocity in the body fixed frame."}, {"start": 126.0, "end": 133.0, "text": "If you know the pitch, roll, and yaw angles, and you know the rate of change of the pitch, roll, and yaw angles on the right side,"}, {"start": 134.0, "end": 141.0, "text": "a simple transformation yields the angular velocity components p, q, and r along b1, b2, and b3."}, {"start": 141.0, "end": 150.0, "text": "So this model is quite complicated. It involves three components of position, velocity, and acceleration,"}, {"start": 151.0, "end": 156.0, "text": "three components of rotations, angular velocities, and angular accelerations."}, {"start": 157.0, "end": 165.0, "text": "To get a feel for the control problem, I'd like to first look at the planar version of this model."}, {"start": 165.0, "end": 176.0, "text": "So we'll look at the equations of motion in the yz plane. We will assume that the robot cannot move out of this plane."}, {"start": 177.0, "end": 186.0, "text": "In other words, there's no motion in the x direction. And we'll also assume there is no yaw or pitch motions."}, {"start": 186.0, "end": 200.0, "text": "As a result, we come up with the three equations that you see here. Equations that describe the rates of change of velocity in the y and the z direction,"}, {"start": 201.0, "end": 206.0, "text": "and the rate of change of the angular velocity in the roll direction."}, {"start": 206.0, "end": 215.0, "text": "So we'll look at the same equation. To describe these kinds of systems, it is useful to define a state vector."}, {"start": 216.0, "end": 221.0, "text": "In the three-dimensional case, we have six variables that describe the configuration of a robot,"}, {"start": 222.0, "end": 226.0, "text": "and a state vector includes the configuration and its derivative."}, {"start": 226.0, "end": 231.0, "text": "the configuration vector is a state vector. So if q is the six-dimensional configuration vector,"}, {"start": 232.0, "end": 236.0, "text": "q and q dot constitute a 12-dimensional description of the state."}, {"start": 237.0, "end": 242.0, "text": "The space of all such state vectors is called a state space."}, {"start": 243.0, "end": 247.0, "text": "If you look at the equilibrium configuration,"}, {"start": 247.0, "end": 256.0, "text": "and that configuration is defined by the position x0, y0, and z0,"}, {"start": 257.0, "end": 264.0, "text": "the configuration by definition also has a zero roll angle and a zero pitch angle."}, {"start": 265.0, "end": 268.0, "text": "It could, of course, have any yaw angle."}, {"start": 269.0, "end": 275.0, "text": "The equilibrium configuration must also correspond to zero velocity."}, {"start": 275.0, "end": 279.0, "text": "If I write it down in terms of a state space vector,"}, {"start": 280.0, "end": 284.0, "text": "you have the equilibrium configuration q sub e,"}, {"start": 285.0, "end": 287.0, "text": "and you have a zero velocity vector,"}, {"start": 288.0, "end": 293.0, "text": "and that gives you a 12-dimensional vector where the bottom six elements are all zero."}, {"start": 294.0, "end": 297.0, "text": "Similarly, for planar quadrotors,"}, {"start": 298.0, "end": 300.0, "text": "you have a three-dimensional configuration space,"}, {"start": 301.0, "end": 302.0, "text": "a six-dimensional state space,"}, {"start": 302.0, "end": 309.0, "text": "and an equilibrium configuration and an equilibrium state that can be similarly defined."}, {"start": 309.0, "end": 315.0, "text": "thaticionад quadrotors,"}, {"start": 316.0, "end": 328.0, "text": "you have one city called the tests and the president's"}, {"start": 329.0, "end": 330.0, "text": "as federally defined."}]}