{"video_id": "nxKkM4bXPFI", "url": "https://www.youtube.com/watch?v=nxKkM4bXPFI", "title": "nxKkM4bXPFI", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.64, "end": 4.48, "text": "What is up everybody, Dac here, and today I'm going to be talking about how to choose the"}, {"start": 4.48, "end": 9.44, "text": "right port size for a speaker enclosure and problems associated with ports which are either"}, {"start": 9.44, "end": 14.08, "text": "too small or too big. So first off, if you've ever tried to design a sub box you may have"}, {"start": 14.08, "end": 19.76, "text": "used WinISD. You can see here that even though the port sizes are vastly different, they seem"}, {"start": 19.76, "end": 23.84, "text": "to have the same response curve, but of course one port's got to be better than the other."}, {"start": 24.4, "end": 31.759999999999998, "text": "So which is the best? Something you may have used is an online calculator. You can see here that I've"}, {"start": 31.759999999999998, "end": 38.24, "text": "put in parameters for a 15 inch driver with 60 mils of excursion which is pretty reasonable these days"}, {"start": 38.24, "end": 44.64, "text": "for a high excursion, low frequency sub, tuned to about 30 hertz and you can see that the minimum"}, {"start": 44.64, "end": 51.2, "text": "diameter of the port quoted here is bigger than the driver itself. So of course that just can't be"}, {"start": 51.2, "end": 57.52, "text": "right. You can see boxes everywhere in home theater with ports which are way small than that"}, {"start": 57.52, "end": 63.120000000000005, "text": "with subs which are comparable to this one here. So first off I'm going to be looking at problems"}, {"start": 63.120000000000005, "end": 68.80000000000001, "text": "with ports which are too small. Now in order for two things to be just as loud they need to move"}, {"start": 68.80000000000001, "end": 76.64, "text": "the same amount of air. So for a 5 centimeter port and a 20 centimeter wide port, air needs to be moving"}, {"start": 76.64, "end": 84.0, "text": "16 times faster through the 5 centimeter port than the 20 centimeter port. That's why this one here is"}, {"start": 84.0, "end": 90.16, "text": "so large because it's trying to avoid air rushing through the port so quickly and creating turbulence."}, {"start": 90.16, "end": 96.48, "text": "So turbulence is created when air is moving out of the port very quickly and it meets this kind of"}, {"start": 97.12, "end": 105.2, "text": "barrier where it goes from fast throwing all coherent into just an open space and it all goes to hell."}, {"start": 105.2, "end": 111.92, "text": "There's air moving everywhere, turbulence forms which is the leading cause of chuffing which is a common"}, {"start": 111.92, "end": 117.52000000000001, "text": "thing with ported boxes and here you can see that with the large port because the air is moving more"}, {"start": 117.52000000000001, "end": 123.12, "text": "slowly through it there's a lot less turbulence and thus there's a lot less chuffing. You can of course"}, {"start": 123.12, "end": 128.48000000000002, "text": "flare it and you can see here with the large port that there's no more turbulence at all but with a"}, {"start": 128.48000000000002, "end": 134.8, "text": "small port there's still a bit of turbulence. Now you can if you make the port super big you can get away"}, {"start": 134.8, "end": 140.4, "text": "with getting no turbulence through a small port but then you may as well go with a large port in the"}, {"start": 140.4, "end": 147.76000000000002, "text": "first case. Although you do get a bit more box space efficient if you do a small port with huge"}, {"start": 147.76000000000002, "end": 154.8, "text": "flares on either end. I see it in some compact bookshelf speakers such as KEF has a silicone port,"}, {"start": 154.8, "end": 162.4, "text": "like a flexible port which has a big flare on the front and the rear. As for the characteristics of a"}, {"start": 162.4, "end": 172.16, "text": "small port dynamics can suffer meaning that kicks aren't quite as tight and it leads to a muddy sound."}, {"start": 172.16, "end": 178.88, "text": "So that's often why a small port or a port which is too small is actually good for home theater sub."}, {"start": 179.76, "end": 187.36, "text": "Rumbles don't need to be particularly accurate they're more or less just noise so any infrasonics you can"}, {"start": 187.36, "end": 194.0, "text": "actually use a small port and flare it at either end just to save a bit of box volume because by the"}, {"start": 194.0, "end": 200.08, "text": "time you try to make a relatively small unit try to tune it to 20 hertz the port would need to be so"}, {"start": 200.08, "end": 207.92000000000002, "text": "wide it's absolutely enormous its length is two meters plus in some cases. So if you make it smaller"}, {"start": 207.92000000000002, "end": 214.88000000000002, "text": "you can fit it all within the box nicely without having to sacrifice any sound quality due to it being"}, {"start": 214.88, "end": 220.72, "text": "tuned low. And now I'm going to talk about problems with ports which are too big. With a correct size"}, {"start": 220.72, "end": 226.96, "text": "port when you stop setting power to the voice coil it should stop making sound. This is a common reason"}, {"start": 226.96, "end": 233.76, "text": "why people prefer sealed to ported because ported can lose definition the port can be wanting to do its"}, {"start": 233.76, "end": 241.2, "text": "own thing and this is a bit of an example of that. So when you stop sending power to the voice coil sound"}, {"start": 241.2, "end": 247.6, "text": "should stop immediately and with with properly damped ports you'll see that as soon as the signal"}, {"start": 247.6, "end": 254.72, "text": "stops the wave should stop. But a problem with large ports is that the damping is less so even after the"}, {"start": 254.72, "end": 261.12, "text": "signal stops going to the driver a bit of air can keep moving in and out of the port like when you blow"}, {"start": 261.12, "end": 268.96, "text": "over a bottle and you hear a go hmmm. So what this leads to is the sound coming from the speaker is less"}, {"start": 268.96, "end": 275.52, "text": "tight less accurate and has a bit of a kind of boomy nature to it. It wants to peak more around the port"}, {"start": 275.52, "end": 281.76, "text": "and yeah that's not very good for sound quality but it is good for SPL because you want a big"}, {"start": 281.76, "end": 288.71999999999997, "text": "high resonance so going with a big port for SPL is often a good thing. So what is the best size for a"}, {"start": 288.71999999999997, "end": 294.47999999999996, "text": "port? If I've talked about what's bad about small what's bad about large what's the best compromise?"}, {"start": 294.48, "end": 300.16, "text": "And I do actually have an answer. I've seen this in many different places and it all seems to line"}, {"start": 300.16, "end": 308.16, "text": "up the same thing. The best way to design a ported box is to go with 16 square inches per cubic foot"}, {"start": 308.16, "end": 316.0, "text": "which ends up being 100 square centimeters per 28 liters or 3.6 square centimeters per liter of box"}, {"start": 316.0, "end": 325.04, "text": "volume. So these are all port surface area to box volume ratios. For a 10 cubic foot box you want 160"}, {"start": 325.04, "end": 333.84, "text": "square inches which is like a big 16 by 10 inch port or maybe a 32 by 5 inch port something like that"}, {"start": 333.84, "end": 339.68, "text": "and of course you can do the calculations for the metric yourself if you want to do them. These are all"}, {"start": 339.68, "end": 347.76, "text": "for square or rectangular ports. If you're doing a round port you can actually make the box bigger than"}, {"start": 347.76, "end": 354.96000000000004, "text": "one cubic foot per 16 square inches. You can make ports smaller if they're more aerodynamic. So if you've"}, {"start": 354.96000000000004, "end": 360.88, "text": "got a flared port you can make the port slightly smaller. If you've got an aero port you can make it smaller."}, {"start": 361.6, "end": 368.71999999999997, "text": "Also if you do have a round port compared to a rectangular or square port you can make it smaller."}, {"start": 368.71999999999997, "end": 375.6, "text": "And if you have an un-aerodynamic port such as a rectangular port that has a corner in it which"}, {"start": 375.6, "end": 381.92, "text": "doesn't have any sort of curving in the corner then you can make it slightly bigger than 16 square"}, {"start": 381.92, "end": 388.32, "text": "inches per cubic foot maybe 20 square inches per cubic foot as the restriction of airflow damps it"}, {"start": 388.32, "end": 395.36, "text": "just a bit more so it doesn't ring. A couple of examples of where I found this ratio before I"}, {"start": 395.36, "end": 401.12, "text": "tested it in a box myself and found out that it does work pretty damn well is here on digital design"}, {"start": 401.12, "end": 408.32, "text": "site. You can see their one cubic foot box has more 15 square inches of vent but two is 32, three is 48"}, {"start": 408.32, "end": 414.71999999999997, "text": "and they all divide to go to 16 square inches of port area per cubic foot. This is quoted on the website."}, {"start": 414.72, "end": 421.36, "text": "Another example I'd look at is on Sundown's website where I found the NSV4 10 inch driver."}, {"start": 421.36, "end": 429.84000000000003, "text": "They suggest a one and a half cubic foot box with a 24 square inch port surface area. So you can see right here"}, {"start": 430.40000000000003, "end": 436.16, "text": "that that is 16 square inches per cubic foot of box volume just like digital designs."}, {"start": 436.16, "end": 439.6, "text": "So yeah thanks for watching. If you enjoyed this video and learned anything from it"}, {"start": 439.6, "end": 446.40000000000003, "text": "uh feel free to like and subscribe and also just wondering what's your opinion. Now I've seen other"}, {"start": 446.40000000000003, "end": 453.20000000000005, "text": "sizes in other videos for example comparing port surface area with driver surface area for example"}, {"start": 453.20000000000005, "end": 461.12, "text": "Showtime SPL Ed Leicester. He mentions that he tunes his ports per driver surface area for SPL. So yeah that's"}, {"start": 461.12, "end": 469.84000000000003, "text": "an example where in SPL it's often a good idea to tune the port surface area to the driver surface area"}, {"start": 469.84000000000003, "end": 476.16, "text": "rather than the box volume. But once again feel free to leave your own opinion in the comments below."}, {"start": 476.16, "end": 481.28000000000003, "text": "I look forward to seeing how other people do it and I might even test some of them if they sound good."}, {"start": 481.28, "end": 491.44, "text": "Yep, thanks for watching and see ya!"}]}