{"video_id": "URj7TorDHmQ", "url": "https://www.youtube.com/watch?v=URj7TorDHmQ", "title": "URj7TorDHmQ", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.0, "end": 3.48, "text": "How's it going everybody this is Nick from Part-Time Pilot. Today's video is"}, {"start": 3.48, "end": 7.68, "text": "going to be on lift. A very important video for pilots to understand. You got to"}, {"start": 7.68, "end": 11.200000000000001, "text": "know how your aircraft creates lift so that you can maintain it in all"}, {"start": 11.200000000000001, "end": 15.16, "text": "situations. I just want to mention that I'm giving out a free study guide for"}, {"start": 15.16, "end": 19.92, "text": "the FAA Private Pilot Written. It's over 170 slides long. It's really great. A lot"}, {"start": 19.92, "end": 24.32, "text": "of good information. Just look at the link in my description. Go to that link"}, {"start": 24.32, "end": 28.5, "text": "and download the study guide for free. All you need to do is put in your email."}, {"start": 28.5, "end": 32.54, "text": "Alright, let's get started. Okay, so lift. Lift. There's a lot of different"}, {"start": 32.54, "end": 36.44, "text": "explanations out there for lift. The truth is it's a little complicated and"}, {"start": 36.44, "end": 41.92, "text": "there's multiple contributions to lift. So there's multiple explanations that"}, {"start": 41.92, "end": 45.84, "text": "combine to create the force of lift. Let's get to them. The first one is"}, {"start": 45.84, "end": 49.82, "text": "Newton's Third Law. I'm sure you've heard of it, but if not, for every action there's"}, {"start": 49.82, "end": 54.519999999999996, "text": "an equal and opposite reaction. Okay, a classic example of this is let's say"}, {"start": 54.52, "end": 59.6, "text": "you're standing on a little boat by a dock and you're jumping out of the boat."}, {"start": 59.68000000000001, "end": 64.26, "text": "You're pushing off the boat to get onto the dock. As you step off and push"}, {"start": 64.26, "end": 69.26, "text": "yourself off to get onto the dock, the boat moves away from you. So your action is"}, {"start": 69.26, "end": 73.26, "text": "pushing off to get onto the dock. The reaction is the boat moving away from you."}, {"start": 73.56, "end": 76.22, "text": "That's why you see a lot of people fall into the water when they're trying to get"}, {"start": 76.22, "end": 80.92, "text": "on a dock. Okay, for aircraft, the perfect example is thrust and forward"}, {"start": 80.92, "end": 84.92, "text": "movement of the aircraft. The propeller spins through the air and essentially"}, {"start": 84.92, "end": 88.92, "text": "pushes the air backward with the resulting motion of the aircraft moving"}, {"start": 88.92, "end": 94.0, "text": "forward. Okay, also another good example is a rocket engine. This is actually a very"}, {"start": 94.0, "end": 100.06, "text": "clear example. That's why I chose it for the visualization. So in our rocket nozzle,"}, {"start": 100.22, "end": 108.0, "text": "so here's our rocket, we have a bunch of fuel in here. Okay, the fuel is mixed and it's"}, {"start": 108.0, "end": 114.0, "text": "burned and it's thrown out of the rocket at very high speeds. All right. Now what"}, {"start": 114.0, "end": 122.32, "text": "that does, so you have an action throwing out masses of burnt fuel propellant and you"}, {"start": 122.32, "end": 129.0, "text": "have a reaction of the engine that's attached to the rocket propelling forward."}, {"start": 130.0, "end": 136.84, "text": "That's Newton's third law as it pertains to aerospace vehicles and even airplanes"}, {"start": 136.84, "end": 142.08, "text": "with a common propeller. The second contribution to lift I want to talk about is described"}, {"start": 142.08, "end": 147.94, "text": "by Bernoulli's principle. So Bernoulli's principle is a mathematical principle that relates the"}, {"start": 147.94, "end": 154.44, "text": "pressure of a moving fluid with its velocity. What it says is that as the velocity of a fluid"}, {"start": 154.44, "end": 160.54, "text": "increases, the pressure of that fluid decreases and vice versa. So if the velocity decreases,"}, {"start": 160.54, "end": 167.54, "text": "the pressure would increase. For airplanes, this fluid is air. A fluid is a gas or liquid."}, {"start": 168.14, "end": 174.29999999999998, "text": "So for airplanes, this is air. So what does this equation look like? So essentially,"}, {"start": 174.51999999999998, "end": 179.38, "text": "it's a combination of the static pressure plus the dynamic pressure equaling the total pressure,"}, {"start": 179.78, "end": 185.32, "text": "which remains constant. So imagine the total pressure remaining constant. So you have the"}, {"start": 185.32, "end": 191.0, "text": "static pressure plus the dynamic pressure, which is a constant. Now, if you want to know the"}, {"start": 191.0, "end": 195.66, "text": "differences between static pressure and dynamic pressure, click on the video that's popping up"}, {"start": 195.66, "end": 200.6, "text": "in the top right. I go over the differences between that and how your aircraft instruments"}, {"start": 200.6, "end": 207.32, "text": "use those values. So you have the static pressure plus the dynamic pressure, which is a function of"}, {"start": 207.32, "end": 214.35999999999999, "text": "the velocity. So it's the density of the air times the velocity squared of the air divided by two. But for"}, {"start": 214.35999999999999, "end": 222.45999999999998, "text": "now, just know static pressure plus dynamic pressure equals total pressure, which is a constant."}, {"start": 224.07999999999998, "end": 229.18, "text": "Okay, so if this is constant all the time, that means it's always the same. Let's say it's 10."}, {"start": 229.18, "end": 239.56, "text": "And the static pressure, let's say is, we'll say the static pressure is five. Okay, that makes the"}, {"start": 239.56, "end": 246.10000000000002, "text": "dynamic pressure five, five plus five equals 10. Now if this, because this is constant, it can't change"}, {"start": 246.10000000000002, "end": 253.70000000000002, "text": "from 10. And let's say the static pressure were to change or to go up to eight. What does that mean"}, {"start": 253.7, "end": 260.4, "text": "that this term, the dynamic pressure has to do? It has to go down for this to equal 10. It can't be"}, {"start": 260.4, "end": 266.09999999999997, "text": "five anymore. It can't go up. That would be more than 10. It has to be two. Okay, so it went down."}, {"start": 266.88, "end": 271.12, "text": "What's happening here is the velocity is going down. The density of the air is not changing,"}, {"start": 271.38, "end": 278.78, "text": "mostly. It's usually staying the same. So the velocity is going down. So how does this look? Let's"}, {"start": 278.78, "end": 287.14, "text": "look at this more visually. So here we have a hypothetical nozzle where we have an area of A1 here"}, {"start": 287.14, "end": 297.7, "text": "with air entering at velocity V1 and pressure P1. Okay, so this is station one."}, {"start": 297.7, "end": 310.34, "text": "As the air flows through here, it gets constricted by the area of the nozzle at station two. So"}, {"start": 310.34, "end": 319.38, "text": "the area cross-sectional area at station two is smaller than area one. This causes the velocity"}, {"start": 319.38, "end": 327.88, "text": "to increase. So V2 is higher than V1. Now, according to Bernoulli, what happens when the velocity"}, {"start": 327.88, "end": 337.26, "text": "increases? The pressure decreases. So P2 is smaller than P1. Okay, so how does all this, how does Newton"}, {"start": 337.26, "end": 344.38, "text": "and Bernoulli, how does this explain a propeller aircraft creating lift? Let's get into that. So here"}, {"start": 344.38, "end": 350.38, "text": "we have a picture of an airfoil. So this is the brown shape here in our picture. The airfoil is a"}, {"start": 350.38, "end": 358.24, "text": "cross-sectional shape of our wing. We have this airfoil at an angle of attack between the free"}, {"start": 358.24, "end": 367.1, "text": "streamline here and the cord line here. So angle of attack. Now as the air approaches this wing,"}, {"start": 368.5, "end": 373.56, "text": "it splits. Some of the air goes below the wing and some of the air travels above the wing."}, {"start": 374.38, "end": 380.65999999999997, "text": "The first contribution to lift, the air below the wing, so we're talking about this blue line here,"}, {"start": 381.44, "end": 386.65999999999997, "text": "changes direction due to the positive angle of attack of the wing. So it comes in,"}, {"start": 387.34, "end": 393.14, "text": "it hits the wing, but because the wing's at a positive angle of attack, it bounces off the wing"}, {"start": 393.14, "end": 399.28, "text": "and travels along the bottom of the wing. This change in direction, according to Newton,"}, {"start": 399.28, "end": 407.78, "text": "has an opposite reaction on the wing itself. So it pushes the wing this way. So the resulting motion"}, {"start": 407.78, "end": 415.53999999999996, "text": "is this way, but this has a vertical component as well as a horizontal component. But this vertical"}, {"start": 415.53999999999996, "end": 424.23999999999995, "text": "component, we relate to lift. The second contribution to lift, the air traveling above the wing,"}, {"start": 424.24, "end": 429.66, "text": "so now we're talking about this green line here, the air traveling above the wing is also turned"}, {"start": 429.66, "end": 438.0, "text": "and follows the curve shape of the airfoil. So it turns and follows this shape, finally traveling"}, {"start": 438.0, "end": 444.68, "text": "down by the end of the wing. So at the trailing edge of the wing, it's now pointing downwards."}, {"start": 444.68, "end": 451.92, "text": "This change of direction downwards has an opposite reaction according to Newton's third law. So the"}, {"start": 451.92, "end": 461.3, "text": "opposite reaction of the wing would be this way, which again has a vertical component as well as a"}, {"start": 461.3, "end": 469.72, "text": "horizontal component, but this vertical component relates to lift. Again, described by Newton's third"}, {"start": 469.72, "end": 477.52000000000004, "text": "law. The third and final contribution to lift can be described by Bernoulli's principle. It gets a"}, {"start": 477.52000000000004, "end": 485.56, "text": "little tough, so hang with me. So the air above and below the wing are at different pressures. To explain"}, {"start": 485.56, "end": 491.02000000000004, "text": "how they got to different pressures, we have, let's think about them individually. The air above the wing,"}, {"start": 491.14000000000004, "end": 497.66, "text": "it has a lower pressure because the front of the wing is blocking it from oncoming air. So we're talking"}, {"start": 497.66, "end": 506.16, "text": "about the air right back here. The oncoming air is coming in and it's getting blocked by the front"}, {"start": 506.16, "end": 513.7, "text": "of the wing such that the air back here does not feel that dynamic pressure of the air. Think about"}, {"start": 513.7, "end": 520.96, "text": "you're riding on a motorcycle behind a very big guy, you're hanging onto his stomach and you don't feel"}, {"start": 520.96, "end": 526.6, "text": "it's nice back there because you don't feel any of that dynamic pressure of the air coming and hitting"}, {"start": 526.6, "end": 532.82, "text": "you in the face. Okay, so this is what's happening at the top of the wing. So the pressure is lower than"}, {"start": 532.82, "end": 538.22, "text": "the bottom of the wing that doesn't have that protection of the wing. So it's getting the full"}, {"start": 538.22, "end": 544.84, "text": "force of air hitting it on the bottom of the wing. So now we have the pressure below"}, {"start": 544.84, "end": 557.9200000000001, "text": "the wing is greater than the pressure above the wing. Now Bernoulli also told us that the pressure,"}, {"start": 558.0400000000001, "end": 562.46, "text": "when the pressure goes down, the velocity goes up. So the air above is also traveling faster now"}, {"start": 562.46, "end": 568.34, "text": "because the pressure is going down. But what we really care about is this pressure differential."}, {"start": 568.34, "end": 580.5, "text": "So P above, okay, and P below, we know that P above is lower. We also know that a fluid wants to,"}, {"start": 580.5, "end": 589.08, "text": "it wants to find equilibrium in a volume. Okay, so if you put a bunch of fluid out of a balloon,"}, {"start": 589.08, "end": 598.2, "text": "it's going to disperse itself into, into the room evenly. So you have high pressure below the wing,"}, {"start": 598.2, "end": 605.96, "text": "but you have low pressure above the wing. The air wants to get to that low pressure and find"}, {"start": 605.96, "end": 614.76, "text": "equilibrium. So what happens is there's almost a vacuum effect around the leading edge of the wing"}, {"start": 614.76, "end": 623.56, "text": "of air trying to get to that low pressure area. This has the effect, overall effect of the higher"}, {"start": 623.56, "end": 631.7, "text": "pressure from the bottom of the wing, pushing up on the wing and creating a vertical component of lift."}, {"start": 631.76, "end": 637.64, "text": "So that is how Newton and Bernoulli help us explain lift on an aircraft. It's all about the shape of the"}, {"start": 637.64, "end": 643.34, "text": "wing, the airfoil and the angle of attack, splitting the air, causing that differential in pressure,"}, {"start": 643.34, "end": 649.5, "text": "creating both forces from Newton and Bernoulli and that net force upwards of lift."}, {"start": 649.84, "end": 655.1600000000001, "text": "Hope you guys understood this all. If you have any questions, please comment below. If you haven't"}, {"start": 655.1600000000001, "end": 659.24, "text": "subscribed, please do. And as always, follow me on Instagram at part period time period pilot."}, {"start": 659.5, "end": 665.0, "text": "And remember, get your free study guide. There's a link in the description below. Follow that."}, {"start": 665.08, "end": 668.9000000000001, "text": "All you got to do is in your email. It's completely free and I'll help you prepare for the FAA written."}]}