{"video_id": "wEevt2a4SKI", "url": "https://www.youtube.com/watch?v=wEevt2a4SKI", "title": "wEevt2a4SKI", "category": "Unknown Category", "fps": null, "segments": [{"start": 0.44, "end": 5.44, "text": "Hello everyone and welcome to another video. Today I'd like to talk about one"}, {"start": 5.44, "end": 9.44, "text": "of the most popular and powerful control design techniques around the linear"}, {"start": 9.44, "end": 14.32, "text": "quadratic regulator or LQR controller. We're gonna see that an LQR controller"}, {"start": 14.32, "end": 17.84, "text": "is effectively a full state feedback controller where the gain matrix K is"}, {"start": 17.84, "end": 21.240000000000002, "text": "computed in a very particular fashion. I'm gonna assume that you're a little"}, {"start": 21.240000000000002, "end": 23.96, "text": "bit familiar with full state feedback control but if you'd like a quick"}, {"start": 23.96, "end": 27.96, "text": "refresher please check out this previous video where we introduced full state"}, {"start": 27.96, "end": 32.96, "text": "feedback controllers. We're also going to see today that LQR controllers address"}, {"start": 32.96, "end": 36.660000000000004, "text": "some of the practical implementation issues we encountered when designing"}, {"start": 36.660000000000004, "end": 40.78, "text": "full state feedback controllers. So to get the most out of the discussion today I"}, {"start": 40.78, "end": 44.519999999999996, "text": "recommend that you also check out this other previous video where we discuss"}, {"start": 44.519999999999996, "end": 48.900000000000006, "text": "some of these implementation problems. Links to both of those videos are in the"}, {"start": 48.900000000000006, "end": 53.1, "text": "description below. So if all of this sounds like more fun than a clown on fire"}, {"start": 53.1, "end": 55.56, "text": "let's jump over to the whiteboard and get started."}, {"start": 55.56, "end": 67.26, "text": "Alright so let's talk a little bit about the linear quadratic regulator or LQR"}, {"start": 67.26, "end": 73.66, "text": "controller. Right so like we said earlier the deal with an LQR controller is that"}, {"start": 73.66, "end": 78.18, "text": "let's assume that we've got a plant here it's a linear plant of our standard form"}, {"start": 78.18, "end": 83.24000000000001, "text": "here but the output like we said earlier is the entire state of the system. So if"}, {"start": 83.24, "end": 86.83999999999999, "text": "you have this scenario we said last time that pretty much the most powerful"}, {"start": 86.83999999999999, "end": 91.58, "text": "controller you can use here is a full state feedback controller like this."}, {"start": 91.58, "end": 98.53999999999999, "text": "Right so here's your full state feedback controller. Right and the whole game plan"}, {"start": 98.53999999999999, "end": 103.47999999999999, "text": "at this point was to just to choose K. So last time I think we showed here that you"}, {"start": 103.48, "end": 112.36, "text": "can basically try to tailor how the full state feedback controller behaves by"}, {"start": 112.36, "end": 117.30000000000001, "text": "choosing desired closed-loop poles of that entire system. Right I think last time we"}, {"start": 117.30000000000001, "end": 122.26, "text": "said that you know if you had some some plant here with with certain open loop"}, {"start": 122.26, "end": 126.30000000000001, "text": "poles here right by the represented by these blue X's here right so these blue"}, {"start": 126.3, "end": 134.18, "text": "ones are open loop poles. In other words it was basically eigenvalues of just the A matrix."}, {"start": 134.18, "end": 139.18, "text": "Right and what we said later was that okay I can just go over to MATLAB and I can say"}, {"start": 139.18, "end": 148.35999999999999, "text": "place A, B and some P desired. Right and this would give me a matrix K or it would give me the"}, {"start": 148.35999999999999, "end": 154.3, "text": "controller that would move the open loop eigenvalues in other words these blue X's to wherever I desire"}, {"start": 154.3, "end": 161.32000000000002, "text": "it to go here. Right where is this P desired. So we saw that by choosing locations of say"}, {"start": 161.32000000000002, "end": 165.58, "text": "say I want to move them you know something like this here right where these green"}, {"start": 165.58, "end": 176.8, "text": "ones are now my desired poles. These are my P desired. We saw that by changing these"}, {"start": 176.8, "end": 183.22000000000003, "text": "locations moving them further or closer or moving only certain poles right we could"}, {"start": 183.22, "end": 188.74, "text": "somehow mess with what value K was. But this was a little bit unsatisfying in the"}, {"start": 188.74, "end": 194.44, "text": "sense that there wasn't a real knob or a way to twist and and physically understand"}, {"start": 194.44, "end": 200.5, "text": "how the changes of these green X's affect the controller or affect the behavior of"}, {"start": 200.5, "end": 205.24, "text": "this overall system here. Right so that was the problem with full state feedback"}, {"start": 205.24, "end": 208.3, "text": "controller it was it was a little bit difficult to understand the relationship"}, {"start": 208.3, "end": 213.82000000000002, "text": "between P desired and the resulting K. Well this is exactly the problem that LQR is going"}, {"start": 213.82000000000002, "end": 219.52, "text": "to allow us to address here. What we're going to do here is try to pose this entire"}, {"start": 219.52, "end": 225.82000000000002, "text": "problem here in an optimization framework. So optimization is is one of the most powerful"}, {"start": 225.82000000000002, "end": 229.9, "text": "branches of mathematics. In fact I've heard a couple people say that you know it's"}, {"start": 229.9, "end": 233.74, "text": "it's it's probably the most important engineering topic here that that almost any"}, {"start": 233.74, "end": 237.82000000000002, "text": "problem in engineering can be posed as an optimization problem if you think about it"}, {"start": 237.82000000000002, "end": 241.9, "text": "long enough here. So what we should maybe do here is let's take a brief"}, {"start": 241.9, "end": 246.5, "text": "sidestep and talk a little bit about what is optimization and how can we maybe"}, {"start": 246.5, "end": 250.60000000000002, "text": "apply it to this scenario. So to set the stage for the concept of optimization"}, {"start": 250.60000000000002, "end": 253.98000000000002, "text": "let's talk about my daily commute. For those who don't know me I live in the"}, {"start": 253.98000000000002, "end": 257.98, "text": "Pacific Northwest specifically I live on Bainbridge Island which is about 10 miles"}, {"start": 257.98, "end": 261.82, "text": "west of Seattle Washington and I work at the University of Washington which is"}, {"start": 261.82, "end": 265.98, "text": "actually on the other side of this large body of water called Puget Sound. So the"}, {"start": 265.98, "end": 269.82, "text": "problem I'd like to consider now is how can I commute from my house to my work"}, {"start": 269.82, "end": 274.21999999999997, "text": "every single day. Why don't we brainstorm some possible solutions to this problem."}, {"start": 274.21999999999997, "end": 278.86, "text": "Now luckily for me the state of Washington operates the largest ferry system in the"}, {"start": 278.86, "end": 283.26, "text": "United States so one option is I can just drive from my house down to the ferry"}, {"start": 283.26, "end": 288.7, "text": "terminal put my car on a ferry boat go across the Sound and when I get to Seattle"}, {"start": 288.7, "end": 293.42, "text": "just drive the rest of the way up to the University of Washington. So let's call"}, {"start": 293.42, "end": 298.06, "text": "this solution maybe Z1 where I drive from my house to the ferry catch the ferry"}, {"start": 298.06, "end": 303.09999999999997, "text": "and then drive to campus. What else could we do? Well if I don't want to drive maybe"}, {"start": 303.09999999999997, "end": 307.9, "text": "I'll catch a bus from my house to the ferry terminal walk onto the ferry boat and"}, {"start": 307.9, "end": 311.82, "text": "then when I get to Seattle just find some bus that happens to be going to the UW."}, {"start": 311.82, "end": 319.74, "text": "So here that's Z2 here bus ferry bus. What about a third solution? Well if I want to get some"}, {"start": 319.74, "end": 324.3, "text": "exercise why don't I ride my bicycle to the ferry terminal and I can actually put my bike on the"}, {"start": 324.3, "end": 329.9, "text": "boat take it across the water and then when I get to Seattle ride the west of the way up to the"}, {"start": 329.9, "end": 337.65999999999997, "text": "University of Washington. Great so Z3 bike ferry bike. Why don't we think outside the box a little bit."}, {"start": 337.66, "end": 344.46000000000004, "text": "I could maybe now run from my house to the nearest shoreline of Bainbridge Island hop in the water"}, {"start": 344.46000000000004, "end": 350.62, "text": "and swim five miles across the Sound here and then force Gump it to campus and arrive more tired"}, {"start": 350.62, "end": 358.86, "text": "than that creepy dwarf in Snow White. But you know what? Z4 where I run swim run is is actually a feasible solution."}, {"start": 360.46000000000004, "end": 366.06, "text": "Alright let's just skip all of this hoo-ha and I'm just going to charter a helicopter to take me directly"}, {"start": 366.06, "end": 373.5, "text": "from my house and draw me off at my desk at the University of Washington every day. So Z5 is just charter a helicopter."}, {"start": 374.14, "end": 382.54, "text": "You know what? This sounds good. So why don't we stop here? Let's call this entire set of all possible solutions the feasible set."}, {"start": 382.86, "end": 389.1, "text": "The feasible set is basically every solution you would like to consider when solving an optimization problem."}, {"start": 389.90000000000003, "end": 396.46000000000004, "text": "Okay so we saw that we had all of these potential solutions and we said we're going to call a"}, {"start": 396.46000000000004, "end": 402.46000000000004, "text": "collection or a set of all of these maybe big Z and we'll just put all of these solutions in here"}, {"start": 404.14000000000004, "end": 406.62, "text": "and this is what's referred to as the feasible set."}, {"start": 406.62, "end": 414.94, "text": "So now that we have the feasible set put together the next thing we need is we need some way to measure"}, {"start": 414.94, "end": 421.26, "text": "the goodness of each one of these items in the feasible set. This is what's known as the concept of a cost function."}, {"start": 423.26, "end": 427.82, "text": "So the idea with the cost function is that it is literally a function"}, {"start": 427.82, "end": 436.54, "text": "where you pass it in an element of the feasible set so it's one of these Z's here and all this"}, {"start": 436.54, "end": 443.42, "text": "thing's job is it's got one job right is it needs to evaluate how much does that item cost here okay."}, {"start": 443.42, "end": 449.74, "text": "So what will come out of this is let's call this cost J of Z here right. So again this is typically"}, {"start": 449.74, "end": 458.62, "text": "we're going to use a notation J here so J of Z is going to be the cost function that measures"}, {"start": 460.62, "end": 471.82, "text": "how much solution Z costs right. So this could be in terms of dollars or any other abstract metric"}, {"start": 471.82, "end": 476.86, "text": "as long as it's a scalar value here right where you pass it in an action and an action you know it"}, {"start": 476.86, "end": 480.54, "text": "could be something complicated like all of these or it could be a vector it could be some item right"}, {"start": 480.54, "end": 485.1, "text": "it's some solution this thing gives you the number of dollars here right it gives you a single value"}, {"start": 485.1, "end": 491.90000000000003, "text": "which measures that right. So what we're going to see here is that the optimization problem involves"}, {"start": 491.90000000000003, "end": 499.18, "text": "finding a feasible solution here that will minimize the cost of a given problem here right. So tell you"}, {"start": 499.18, "end": 503.74, "text": "what let's consider a bunch of different cases here so let me erase some of this we can get a little bit"}, {"start": 503.74, "end": 509.58, "text": "of space so I'd like to consider a few different scenarios here so let's look at maybe case or"}, {"start": 509.58, "end": 516.54, "text": "scenario one here where I want to minimize time okay. So in this case what I'd like to do is I'm going to"}, {"start": 516.54, "end": 521.98, "text": "develop a cost function let's call it J1 of Z here right where what this cost function does is it just"}, {"start": 521.98, "end": 534.78, "text": "measures the time required for action Z right. So in this context the problem here or the optimization"}, {"start": 534.78, "end": 543.82, "text": "problem let's write it here as maybe P1 here right is I want to minimize J1 subject to the constraint"}, {"start": 543.82, "end": 548.62, "text": "here that I'm not going to consider all possible solutions I only want to consider solutions here"}, {"start": 548.62, "end": 554.78, "text": "that are in my feasible set here right only these five that we laid out here right. So if you look"}, {"start": 554.78, "end": 560.94, "text": "at this what the optimization problem says is I need to find the element in the feasible set which"}, {"start": 560.94, "end": 567.1, "text": "basically will yield the minimum time for my commute here right. So if you look at this here right we can"}, {"start": 567.1, "end": 571.58, "text": "we can iteratively by brute force just go through every single one of these and evaluate how long they"}, {"start": 571.58, "end": 577.34, "text": "each take um and and the winner is going to be Z5 here right you can pretty much see that out right off the bat"}, {"start": 577.34, "end": 582.0600000000001, "text": "that this is going to get me from my house to campus in the minimal amount of time here. So in this"}, {"start": 582.0600000000001, "end": 593.26, "text": "scenario here right the thing that is optimal here is Z5 is optimal right. Okay well um how about let's"}, {"start": 593.26, "end": 598.7, "text": "consider another case how about case two maybe let's underline these so we can keep them uh apart case two"}, {"start": 598.7, "end": 605.1800000000001, "text": "here how about how about let's minimize money right so instead of time being important let's say I'm super"}, {"start": 605.18, "end": 611.3399999999999, "text": "cheap and frugal and I care about money so I need to develop a second cost function J2 of Z. This cost"}, {"start": 611.3399999999999, "end": 622.62, "text": "function's only job in life here is to measure literally the cost of action Z right. So how many"}, {"start": 622.62, "end": 627.8199999999999, "text": "dollars does each one of these things cost? So I can form an entirely new optimization problem let's call"}, {"start": 627.82, "end": 637.0200000000001, "text": "it P2 right where I now same thing I want to minimize uh this other cost function J2 here again I'm only"}, {"start": 637.0200000000001, "end": 642.22, "text": "going to look at solutions in my feasible set here right. So I go through each one of these and I ask how"}, {"start": 642.22, "end": 647.74, "text": "much does this cost here well it cost me some gas and then to catch the ferry I actually have to pay to take"}, {"start": 647.74, "end": 655.6600000000001, "text": "my car across then it costs me some gas again. Oh here Z2 this is actually a little cheaper here because I don't have to pay to take my car"}, {"start": 655.66, "end": 661.8199999999999, "text": "across the ferry I can just walk on which is actually um much cheaper uh oh this is this is also kind of"}, {"start": 661.8199999999999, "end": 668.86, "text": "cheap here but oh hey check this out Z4 this doesn't cost me a dime here right nobody's I can run for free"}, {"start": 668.86, "end": 673.5799999999999, "text": "to the shoreline it doesn't cost me anything to swim across well it doesn't cost me any money maybe let's"}, {"start": 673.5799999999999, "end": 677.8199999999999, "text": "put it that way it might cost me other things but it doesn't cost me any money to get across Puget Sound"}, {"start": 677.8199999999999, "end": 683.98, "text": "and I can run and oh crud Z4 the helicopter is definitely going to cost me a boatload of cash here so"}, {"start": 683.98, "end": 690.14, "text": "you know what in this scenario here with this cost function the optimal thing to do is actually Z4"}, {"start": 690.14, "end": 696.78, "text": "right huh so this is really interesting here in the sense that this same optimization problem we can"}, {"start": 696.78, "end": 702.3000000000001, "text": "change the solution by picking the cost function appropriately so tell you what let's go ahead and"}, {"start": 702.3000000000001, "end": 708.78, "text": "look let's make another variation on this how about case three here let's try to look at a minimizing a"}, {"start": 708.78, "end": 720.86, "text": "time and money trade-off okay so in this case why don't I make a cost function let's call it j3"}, {"start": 720.86, "end": 728.86, "text": "which is actually a combination of these two here so let's have j1 here remember j1 returned the time"}, {"start": 728.86, "end": 735.8199999999999, "text": "required and I'm going to add that to j2 which measured the cost here and what I could do here is"}, {"start": 735.82, "end": 742.46, "text": "I could put some scalar weights in front of these here which would allow me to sort of trade off"}, {"start": 742.46, "end": 748.7800000000001, "text": "between how much do I value time versus how much do I value money here right so in this case q and r"}, {"start": 749.4200000000001, "end": 757.98, "text": "are scalar let's call them weights right that we can use to tune the optimization problem here right"}, {"start": 757.98, "end": 764.5400000000001, "text": "so you know if you if you look at this you can basically see here that depending on on q or r you"}, {"start": 764.54, "end": 769.9, "text": "can say do I care more about time or do I care more about money so just to kind of write this"}, {"start": 769.9, "end": 773.0999999999999, "text": "down right if you look at this here well again maybe we should write down the problem here right"}, {"start": 773.0999999999999, "end": 780.14, "text": "so the problem is the same thing so p3 is now I just want to minimize this new cost function j3 of z"}, {"start": 780.6999999999999, "end": 789.02, "text": "such that subject to z is in our feasible set big z okay so depending on what values of q and r we choose"}, {"start": 789.02, "end": 794.38, "text": "you probably get different values here right so in general right you can see here that a large q"}, {"start": 795.02, "end": 802.3, "text": "relative to r right what is that going to do here right that's basically saying that you're reverting"}, {"start": 802.3, "end": 811.02, "text": "to a a minimum time problem right because if q is big then if the time is big this b the the whole entire"}, {"start": 811.02, "end": 818.38, "text": "cost function becomes big here so you really want to um uh choose solutions that minimize time here so"}, {"start": 818.38, "end": 824.3, "text": "if you do this here this is basically saying you uh whoops i should be relative to r right you're"}, {"start": 824.3, "end": 830.06, "text": "you're super rich and your time is more important than your money here right so if you do this um you"}, {"start": 830.06, "end": 838.54, "text": "say what we're basically doing here is this this this kind of reverts uh to a min time problem"}, {"start": 839.66, "end": 844.7, "text": "right basically reverts to this case here right so we see that all right in this case you end up again"}, {"start": 844.7, "end": 851.34, "text": "back with with our z5 um solution of just getting the helicopter right alternatively if you have a"}, {"start": 851.34, "end": 861.98, "text": "small q relative to r right this is now saying that uh no actually uh you're super frugal right you don't"}, {"start": 861.98, "end": 870.86, "text": "have any money so any expenditure of cash is is very very bad here right so that means that r is sorry"}, {"start": 870.86, "end": 876.7, "text": "where was i put yeah r is larger than q here right so what this does is what this reverts to a minimum"}, {"start": 878.0600000000001, "end": 885.74, "text": "money problem here right so here the solution comes back to being z4 here right which makes sense"}, {"start": 885.74, "end": 889.42, "text": "now where it gets really interesting here is what if you have a trade-off"}, {"start": 891.34, "end": 900.22, "text": "between q and r right in this case this is a new scenario right where now it depends it depends how"}, {"start": 900.22, "end": 906.5400000000001, "text": "much do you value time versus how much do you value money so in this case we have we have potential"}, {"start": 906.5400000000001, "end": 910.3000000000001, "text": "solutions i don't know which one is going to be optimal again it depends on what values of r"}, {"start": 910.3000000000001, "end": 918.94, "text": "but now you've got a z1 z2 or maybe z3 as being reasonable solutions here all right let's explore"}, {"start": 918.94, "end": 925.4200000000001, "text": "this a little bit further here let's think of maybe um a case four so let's do this right here unfortunately"}, {"start": 925.42, "end": 931.9, "text": "i didn't manage the board space extremely well here but let's look at case four case four is basically"}, {"start": 931.9, "end": 935.9, "text": "i'd like to look at case three again right this interesting situation where we're trading off time"}, {"start": 935.9, "end": 944.6999999999999, "text": "and money but i'd like to add what are called constraints okay so what constraints allow us to do"}, {"start": 944.6999999999999, "end": 951.98, "text": "here is further tailor the solution to this problem here by eliminating values in the feasible set so"}, {"start": 951.98, "end": 957.34, "text": "what this does here is again let's restate our problem here so i'm gonna i'm gonna call this p4"}, {"start": 957.34, "end": 963.1, "text": "now here but again it's it's the same cost function as case three right so i want to minimize uh"}, {"start": 965.1, "end": 972.7, "text": "j3 right this was our trade-off cost function here subject to elements in the feasible set here"}, {"start": 972.7, "end": 979.1800000000001, "text": "and i'm going to tack on some additional constraints here as something like what if i say i want to make"}, {"start": 979.18, "end": 985.8199999999999, "text": "some kind of requirement here that i need to get 30 minutes of exercise during my commute or more here"}, {"start": 985.8199999999999, "end": 992.62, "text": "so what i'm going to do is i'm going to make up a function let's call it f1 here right where f1's job"}, {"start": 992.62, "end": 998.06, "text": "here is that you put in one an element out of your out of your feasible set here and what this measures"}, {"start": 998.06, "end": 1010.9399999999999, "text": "here is it measures the exercise time uh associated with action z right so the optimization problem"}, {"start": 1010.9399999999999, "end": 1017.3399999999999, "text": "becomes what we saw earlier but as well i'm going to specify a constraint like i need f1 of z to be"}, {"start": 1017.3399999999999, "end": 1022.4599999999999, "text": "greater than or equal to 30 minutes here so this is basically saying that on my commute i also want to"}, {"start": 1022.46, "end": 1029.18, "text": "make sure that i get 30 minutes of uh exercise what this does by specifying this additional constraint"}, {"start": 1029.18, "end": 1036.22, "text": "here is we see that it starts making some of these elements um in this original feasible set infeasible"}, {"start": 1036.22, "end": 1040.8600000000001, "text": "so for example if we look at all of these here let's let's just walk down these one at a time right"}, {"start": 1040.8600000000001, "end": 1048.22, "text": "how much exercise am i going to get out of uh each one of these so z1 here right z1 if i pass this"}, {"start": 1048.22, "end": 1053.74, "text": "through my f function it's going to look and say hey you spent zero minutes exercising because you're"}, {"start": 1053.74, "end": 1058.54, "text": "just walking in the uh driving in the car then you sit on your bum on the ferry doing nothing and then"}, {"start": 1058.54, "end": 1064.22, "text": "you drive some more so this actually does like nothing so this is now not going to be allowed any"}, {"start": 1064.22, "end": 1070.7, "text": "longer here so z1 is no longer a feasible solution same thing with z2 you're just sitting on the bus and"}, {"start": 1070.7, "end": 1075.98, "text": "sitting on the ferry so f1 this function here or this constraint that we cooked up is going to say no"}, {"start": 1075.98, "end": 1082.38, "text": "that's not allowed any longer okay z3 this is uh yeah actually this is still allowed because you're"}, {"start": 1082.38, "end": 1088.14, "text": "going to get a lot of exercise biking here on either end so this is allowed oh man z4 is definitely"}, {"start": 1088.14, "end": 1092.7, "text": "allowed right you're probably going to get more exercise than you want here and then the helicopter"}, {"start": 1092.7, "end": 1098.94, "text": "becomes infeasible because you don't get any exercise on this helicopter here right so suddenly"}, {"start": 1098.94, "end": 1104.38, "text": "this problem here now gets a little bit simpler because the feasible set shrunk so there's only two"}, {"start": 1104.38, "end": 1112.22, "text": "solutions here you can either bike or uh or or run and swim here right and usually for most values of"}, {"start": 1112.22, "end": 1117.5800000000002, "text": "r and q uh q and r right you're going to see that that z4 solution that's going to take that's going to"}, {"start": 1117.5800000000002, "end": 1124.38, "text": "take hours and hours and hours and hours so usually this this term here the the the the cost function"}, {"start": 1124.38, "end": 1130.94, "text": "that's measuring time is going to make that uh z4 solution really unattractive so in this case here"}, {"start": 1130.94, "end": 1138.46, "text": "what's probably going to happen here is we're going to end up with z3 is optimal right so this is"}, {"start": 1138.46, "end": 1144.22, "text": "really fascinating in the sense that depending on how you tailor your optimization problem right the"}, {"start": 1144.22, "end": 1150.06, "text": "solutions change here what is considered optimal changes here right so this is actually really"}, {"start": 1150.06, "end": 1156.6200000000001, "text": "interesting and now the question would be how can we apply this optimization framework to designing a"}, {"start": 1156.62, "end": 1163.34, "text": "control system for a linear dynamic system so um let me erase the board and we'll we'll jump into that"}, {"start": 1163.34, "end": 1169.7399999999998, "text": "next okay now that we've got that basic understanding of general optimization let's think about how we can"}, {"start": 1169.7399999999998, "end": 1175.9799999999998, "text": "set up the optimization problem for designing a linear quadratic regulator here so let's talk real quick about"}, {"start": 1175.9799999999998, "end": 1179.4199999999998, "text": "setting up the optimization problem"}, {"start": 1179.42, "end": 1189.42, "text": "so i always think it's easiest to think about a concrete scenario so you know what if we had"}, {"start": 1189.42, "end": 1195.5, "text": "something like like uh like a satellite here so i'm going to try to draw a satellite here i'm obviously"}, {"start": 1195.5, "end": 1200.8600000000001, "text": "not a very good artist i think those of you who have seen some of my other videos understand that"}, {"start": 1200.8600000000001, "end": 1206.6200000000001, "text": "um but i'll just make some little cartoon here for a satellite here and what we'd like to think about"}, {"start": 1206.62, "end": 1212.9399999999998, "text": "here is this satellite might have uh multiple states here right so the state vector for this"}, {"start": 1212.9399999999998, "end": 1221.1799999999998, "text": "satellite might be something like um the orientation right there might be states for the for the oiler"}, {"start": 1221.1799999999998, "end": 1227.1799999999998, "text": "angles there might be states for like the position um all these other things right we will just stack"}, {"start": 1227.1799999999998, "end": 1233.34, "text": "all these up in the state vector and at the same time this aircraft this satellite might have multiple"}, {"start": 1233.34, "end": 1239.02, "text": "different controls right it might have like a primary thruster here it might have smaller positioning"}, {"start": 1239.02, "end": 1245.1799999999998, "text": "thrusters or or momentum wheels or things like that here so we might want to also say that this thing"}, {"start": 1245.1799999999998, "end": 1253.74, "text": "has multiple controls here right so this would be like the like the main thruster um you know electric thrusters"}, {"start": 1256.6999999999998, "end": 1257.82, "text": "momentum wheels"}, {"start": 1257.82, "end": 1259.98, "text": "controls"}, {"start": 1261.02, "end": 1266.22, "text": "etc etc etc etc right all we're getting at is that this here is a dynamic system which has"}, {"start": 1266.22, "end": 1272.86, "text": "multiple states and multiple controls simultaneously let's go ahead and assume that this is a linear system"}, {"start": 1272.86, "end": 1276.86, "text": "governed by dynamics of x dot is equal to ax"}, {"start": 1278.7, "end": 1284.54, "text": "plus bu right our normal state space representation of my dynamic system basically saying that"}, {"start": 1285.1, "end": 1289.42, "text": "the state and the control they're not free to be anything they want right there's a relationship"}, {"start": 1289.42, "end": 1294.3799999999999, "text": "between how the states and the controls interact and they interact through this dynamic equation here"}, {"start": 1294.3799999999999, "end": 1301.58, "text": "right so within this context here what we want to do here is let's set up an optimization problem here so"}, {"start": 1301.58, "end": 1305.1, "text": "the optimization problem here is let's go ahead and consider a cost function"}, {"start": 1307.8999999999999, "end": 1313.5, "text": "let's just call this thing j like we did earlier here and we're going to propose this cost function here"}, {"start": 1313.5, "end": 1319.02, "text": "it's going to be the integral from time zero to infinity of x transpose"}, {"start": 1320.3, "end": 1324.06, "text": "times some matrix qx plus u"}, {"start": 1326.06, "end": 1336.14, "text": "transpose some matrix r u dt okay so here's our cost function here in this case we see that x obviously"}, {"start": 1336.14, "end": 1346.5400000000002, "text": "is your n by one state vector right u is our usual m by one control vector"}, {"start": 1348.94, "end": 1353.66, "text": "and here q is a n by n symmetric"}, {"start": 1356.8600000000001, "end": 1361.42, "text": "positive semi-definite and we'll talk about the"}, {"start": 1361.42, "end": 1367.1000000000001, "text": "uh definition of that here uh matrix here"}, {"start": 1367.1000000000001, "end": 1374.3000000000002, "text": "uh matrix here sometimes you'll see this written as q greater than zero or sometimes you might see q"}, {"start": 1374.3000000000002, "end": 1383.66, "text": "like this kind of scripty greater than zero here um again this is a notation for this matrix is positive"}, {"start": 1383.66, "end": 1395.3400000000001, "text": "uh uh yes positive semi-definite here and finally r is a m by m symmetric positive definite"}, {"start": 1397.66, "end": 1405.18, "text": "matrix so again sometimes written as q oh i'm sorry sorry come back to the sorry come back to the q"}, {"start": 1405.18, "end": 1410.46, "text": "here positive semi-definite means greater than or equal to sometimes it's written like this to contrast it"}, {"start": 1410.46, "end": 1415.42, "text": "with positive definite which means that it well we'll get to that in a second again you might see"}, {"start": 1415.42, "end": 1419.9, "text": "this written as something strictly greater than or again this this scripty"}, {"start": 1421.9, "end": 1428.8600000000001, "text": "greater than symbol here right okay um maybe now might be a good idea to to discuss what is the"}, {"start": 1428.8600000000001, "end": 1434.94, "text": "definition of positive definite and positive semi-definite let's come back to this and uh let's delete our picture"}, {"start": 1434.94, "end": 1439.82, "text": "here i think we understand the scenario that i like to keep in the back of your head so just keep in"}, {"start": 1439.82, "end": 1443.8999999999999, "text": "keep in your head that you know the state vector here let's let's think about this as being a state"}, {"start": 1443.8999999999999, "end": 1448.06, "text": "vector for the satellite and the control vector being as the control vector for this particular"}, {"start": 1448.06, "end": 1454.9399999999998, "text": "satellite here so the the concept here with uh positive semi-definite here so maybe let's write"}, {"start": 1454.9399999999998, "end": 1466.46, "text": "that down so positive semi-definite means that this matrix q if you took it and multiplied it by some vector"}, {"start": 1466.46, "end": 1473.58, "text": "x transpose and then multiplied it again by x this is a skate going to be a scalar number here if you if"}, {"start": 1473.58, "end": 1479.42, "text": "you do the dimensions here right this is n by one by an multiplied by an n by n multiplied by an n by one"}, {"start": 1479.42, "end": 1484.38, "text": "and excuse me when by the time you transpose this thing this becomes one by n right so you can see the"}, {"start": 1484.38, "end": 1493.9, "text": "whole thing ends up as a one by one scalar here right this scalar quantity is always greater than or equal"}, {"start": 1493.9, "end": 1501.1000000000001, "text": "to zero to zero for all possible x values here right so that's the definition of positive semi-definite"}, {"start": 1501.1000000000001, "end": 1507.5, "text": "is that this matrix is positive semi-definite if when you compute this weird quantity x transpose qx"}, {"start": 1507.5, "end": 1514.14, "text": "it is strict it is greater than or equal to zero for any value of x this vector right this this vector"}, {"start": 1514.14, "end": 1519.1000000000001, "text": "could have positive negative zeros whatever it doesn't matter by the time you run it through and compute"}, {"start": 1519.1, "end": 1524.54, "text": "this you get something that is strict is greater than or equal to zero all the time here right"}, {"start": 1525.82, "end": 1538.6999999999998, "text": "similarly the definition of positive definite right is that again you have this this uh this this matrix"}, {"start": 1538.6999999999998, "end": 1544.2199999999998, "text": "r here which we claim is positive definite the definition is that if you take some vector u maybe"}, {"start": 1544.22, "end": 1552.54, "text": "in this case transpose times u this is strictly greater than zero for all u right so again you can"}, {"start": 1552.54, "end": 1557.5, "text": "work out the dimensions and you see that this is a scalar number here so here's the definition of positive"}, {"start": 1557.5, "end": 1563.58, "text": "semi-definite and positive definite and what's interesting about that is that is exactly what are the terms of"}, {"start": 1563.58, "end": 1569.18, "text": "the integrand of the cost function here right so you see that the re the way that this cost function is"}, {"start": 1569.18, "end": 1578.46, "text": "set up here is that the integrand is always positive or uh or well actually yeah it's it's positive right"}, {"start": 1578.46, "end": 1584.7, "text": "uh for any x u combinations here right so you can never get a negative integrand the integrand is"}, {"start": 1584.7, "end": 1589.74, "text": "always positive so let's let's keep that in the back of our head as we uh continue discussing this okay"}, {"start": 1590.3, "end": 1595.42, "text": "all right so now that we understand positive definite and positive semi definite we have a we have a rough"}, {"start": 1595.42, "end": 1601.98, "text": "kind of um feeling for what this this cost function does right you can kind of see here that again the"}, {"start": 1601.98, "end": 1608.8600000000001, "text": "integrand is always positive and this q and this r those are sort of these weighting matrices or weighting"}, {"start": 1608.8600000000001, "end": 1613.26, "text": "values that we saw earlier when we were looking at our brief introduction to optimization right"}, {"start": 1613.26, "end": 1619.8200000000002, "text": "we earlier the q and the r were somehow to trade off between time versus money here right in this case"}, {"start": 1619.82, "end": 1626.9399999999998, "text": "we see that q and r trade off between states here non-zero states or non-zero controls we're going to"}, {"start": 1626.9399999999998, "end": 1631.34, "text": "take a closer look at that in a second but i wanted to plant that seed in your head right now let's start"}, {"start": 1631.34, "end": 1639.34, "text": "thinking about q and r as weights uh to to determine how much we value states versus how much we value"}, {"start": 1639.34, "end": 1647.58, "text": "controls here right okay so now that we have the the the cost function down the overall problem now in this"}, {"start": 1647.58, "end": 1651.26, "text": "scenario here is actually tell you maybe let's let's do it over here so we can keep talking about the"}, {"start": 1651.26, "end": 1656.54, "text": "the problem here so here's the cost function so the optimization problem let's write this again as our"}, {"start": 1656.54, "end": 1665.98, "text": "script dp symbol here right is all i want to do now here is i want to minimize this cost function j here right"}, {"start": 1668.1399999999999, "end": 1677.26, "text": "but um uh the controls i want to use here right there's m controls here so u is"}, {"start": 1677.26, "end": 1686.54, "text": "is a real valued uh m valued uh vector here right but we're not this is not unconstrained here there's"}, {"start": 1686.54, "end": 1693.58, "text": "a certain constraint right such that the single constraint that we want to consider here is that"}, {"start": 1693.58, "end": 1704.14, "text": "again x and u are not free to be anything you want here right it's x dot is equal to ax plus bu"}, {"start": 1704.14, "end": 1711.66, "text": "right so here is my optimization problem that i would like to solve here right and if we think"}, {"start": 1711.66, "end": 1716.7800000000002, "text": "about this long enough what it's basically saying here is that you want to take this cost function"}, {"start": 1716.7800000000002, "end": 1723.98, "text": "here and i want to find some control signal or some control law that is going to make this cost function"}, {"start": 1723.98, "end": 1729.98, "text": "minimal so so first of all let's stop let's think about that first ignore the constraint maybe for now"}, {"start": 1729.98, "end": 1736.46, "text": "right how would you make this minimal here so for example assume that your satellite had some non-zero"}, {"start": 1736.46, "end": 1742.14, "text": "initial condition like x of zero was not equal to zero in other words your satellite was cocked over"}, {"start": 1742.14, "end": 1748.46, "text": "at some weird orientation and some weird position not zero right something that you that you didn't want"}, {"start": 1748.46, "end": 1758.14, "text": "here right so this term is non-zero at time zero right now if the satellite stayed there right if you"}, {"start": 1758.14, "end": 1763.98, "text": "left it here like let's draw a quick picture maybe of just one of the states like x1 right"}, {"start": 1764.6200000000001, "end": 1771.0200000000002, "text": "if it's here's our our initial condition right so so maybe it is banked over at 45 degrees away from"}, {"start": 1771.0200000000002, "end": 1778.0600000000002, "text": "where you wanted to right if you left it here right and did nothing right what does this cost function"}, {"start": 1778.0600000000002, "end": 1784.6200000000001, "text": "look like here you can kind of see it already it's there's gonna be a square there's gonna be an x1 squared term here"}, {"start": 1784.62, "end": 1789.9799999999998, "text": "multiply by this q let's assume that q is like all ones or something like that effectively what"}, {"start": 1789.9799999999998, "end": 1795.34, "text": "the cost function there is measuring is it's sort of measuring the integral of this right of course"}, {"start": 1795.34, "end": 1800.06, "text": "it's going to be squared it might be skewed or weighted by that q value we're going to see that in"}, {"start": 1800.06, "end": 1805.7399999999998, "text": "a second but long story short here if this stayed here at a constant value this cost function is going"}, {"start": 1805.7399999999998, "end": 1811.4199999999998, "text": "to blow up to to infinity here right because it's it's the integral from time zero to infinity here right"}, {"start": 1811.42, "end": 1818.0600000000002, "text": "um so you can't have this here right this is obviously not the optimal thing to do here you"}, {"start": 1818.0600000000002, "end": 1824.94, "text": "can't leave the satellite cocked over at 45 degrees because that yields a cost function value of infinity"}, {"start": 1824.94, "end": 1831.98, "text": "here right so that's obviously not a good thing to do so instead what is better here right is we should"}, {"start": 1831.98, "end": 1839.26, "text": "try to bring the system back to the origin here right and now the cost here is finite right it's just"}, {"start": 1839.26, "end": 1844.7, "text": "sort of this area under the curve is is the the cost value so this is a better solution than letting"}, {"start": 1844.7, "end": 1850.46, "text": "it stay at 45 degrees so what that means is your satellite is cocked over 45 degrees what we're gonna"}, {"start": 1850.46, "end": 1858.94, "text": "do here is is maybe bring it back to zero that yields a better result here right however the the other flip"}, {"start": 1858.94, "end": 1864.3799999999999, "text": "side of that story here is how are you gonna bring the satellite back to zero here well you're probably"}, {"start": 1864.3799999999999, "end": 1869.02, "text": "gonna have to fire some thrusters right some positioning thrusters you're gonna have to expend"}, {"start": 1869.02, "end": 1875.42, "text": "some amount of control in order to do that here right so if we plot again i'm this is a real rough"}, {"start": 1875.42, "end": 1879.42, "text": "shooting from the hip description of this we're gonna look at it in a more formal fashion in a second"}, {"start": 1879.42, "end": 1884.7, "text": "here but let's just plot one of these controls like maybe u of t this is like one of the positioning"}, {"start": 1884.7, "end": 1890.46, "text": "thrusters or something like that right well what you're gonna probably have to do is is if you want to"}, {"start": 1890.46, "end": 1895.5, "text": "bring the satellite back to zero you're probably gonna have to spend some control authority to do that"}, {"start": 1895.5, "end": 1900.22, "text": "and then again you're probably gonna have to let this come back to zero here right so you're gonna"}, {"start": 1900.22, "end": 1904.78, "text": "actuate the controller and like you're gonna bring it back to zero then you're gonna stop actuating the"}, {"start": 1904.78, "end": 1912.78, "text": "controller right so the overall cost function you can kind of see it's sort of a combination of both"}, {"start": 1912.78, "end": 1919.5, "text": "how long are you away from zero in the states and how much non-zero control authority did you actually"}, {"start": 1919.5, "end": 1926.54, "text": "have to expend in order to get that here right so what you can see from this discussion here is what"}, {"start": 1926.54, "end": 1933.5, "text": "q and r do or q and r are these knobs that allow you to determine how much do you care about the state"}, {"start": 1933.5, "end": 1939.58, "text": "being zero versus how much do you care about the control not being zero here so let's talk about that"}, {"start": 1939.58, "end": 1950.46, "text": "real quick in general right what you end up seeing here is that um you know roughly speaking if q is is"}, {"start": 1950.46, "end": 1960.3, "text": "big compared to r so maybe we should write that down here right so if q is bigger let's put this in quotes"}, {"start": 1960.3, "end": 1968.06, "text": "here than r the reason it's in quotes here is because if you can you can see q and r they're two matrices"}, {"start": 1968.06, "end": 1972.94, "text": "they're square and they're symmetric but they're not even like the same size so how do you really"}, {"start": 1972.94, "end": 1976.62, "text": "say one is bigger than the other here well we're going to get to that in a little bit but you can"}, {"start": 1976.62, "end": 1982.62, "text": "kind of you can see the gist here right if q is bigger than r here what are you basically saying"}, {"start": 1983.26, "end": 1991.5, "text": "you're basically saying here that i really care that x is not equal to zero because if so this this"}, {"start": 1991.5, "end": 1997.82, "text": "term dominates here right so in this situation let me do this in another color here right this term dominates"}, {"start": 1998.06, "end": 2005.6599999999999, "text": "so really all you're saying here is the important thing in this case here is that if the states are"}, {"start": 2005.6599999999999, "end": 2012.1399999999999, "text": "not equal to zero you end up with a huge cost here right who cares about what the control is it's really"}, {"start": 2012.1399999999999, "end": 2018.22, "text": "the states that matter and drive this cost function here so in this scenario what do we end up with"}, {"start": 2018.22, "end": 2024.94, "text": "this is basically saying here the optimal thing to do here is do what you have to but make sure those"}, {"start": 2024.94, "end": 2031.42, "text": "states go back to zero as soon as possible here right so this is typically going to yield something"}, {"start": 2031.42, "end": 2043.18, "text": "like um you would have a fast regulation of x to zero right and in order to do that you're going to end"}, {"start": 2043.18, "end": 2052.46, "text": "up with u is large right so this is sort of the scenario where you're saying control is cheap i don't care"}, {"start": 2052.46, "end": 2057.58, "text": "what you do just make sure the state goes back to zero really really quickly here right let's flip that"}, {"start": 2057.58, "end": 2065.7400000000002, "text": "and and and and and compare with you know what happens if um r uh is bigger"}, {"start": 2068.3, "end": 2078.7, "text": "than q right so in that case we have the exact opposite scenario here right where now it's this term"}, {"start": 2078.7, "end": 2085.8999999999996, "text": "that dominates in the cost function right so the optimal thing to do here is make sure that you"}, {"start": 2085.8999999999996, "end": 2092.62, "text": "stays as small as possible here because if if you even flinches up for or flares up if you actuate one"}, {"start": 2092.62, "end": 2097.4199999999996, "text": "control just a teeny little bit this term in your cost function is going to blow up and you're going to"}, {"start": 2097.4199999999996, "end": 2103.66, "text": "end up with a huge cost here right so the intent under this situation the right thing to do here is"}, {"start": 2103.66, "end": 2111.02, "text": "use control very very very sparingly here right and who cares what the state ends up doing in this"}, {"start": 2111.02, "end": 2117.18, "text": "scenario if it stays if the satellite stays cocked over and just takes you know hundreds of seconds to"}, {"start": 2117.18, "end": 2123.8999999999996, "text": "come back to to the origin that's fine as long as you don't fire those thrusters because the propellant"}, {"start": 2123.8999999999996, "end": 2129.5, "text": "you're expending is is extremely valuable here right so the behavior that typically ends up happening here"}, {"start": 2129.5, "end": 2137.82, "text": "is you know if you have r bigger than q here you have very slow uh regulation of x to the origin here"}, {"start": 2137.82, "end": 2147.5, "text": "right and u is small right so this is really interesting here so you end up with this the the"}, {"start": 2147.5, "end": 2153.18, "text": "the first case here this is like an aggressive controller right and down here you have a conservative"}, {"start": 2153.18, "end": 2160.2999999999997, "text": "controller so we see that q and r are these knobs that are going to allow us to to to tweak the"}, {"start": 2160.2999999999997, "end": 2165.74, "text": "states and the controls or or or excuse me tweak the controller depending on how much we care about"}, {"start": 2165.74, "end": 2170.54, "text": "the states and controls let's look at a very concrete example the cost function and i think we'll be able"}, {"start": 2170.54, "end": 2178.06, "text": "to see that here so for example here right let's look at a a two state two control system"}, {"start": 2178.06, "end": 2185.66, "text": "right so what if your satellite here that we're looking at it only had two states like uh like we"}, {"start": 2185.66, "end": 2192.22, "text": "were looking uh at just the um sorry let me just write this down so i can i can talk at the same time"}, {"start": 2192.22, "end": 2198.22, "text": "here right there's only two states like maybe i only care about the pitch angle and the pitch rate or"}, {"start": 2198.22, "end": 2204.7799999999997, "text": "something like that of it and then i only have two controls here like i have a electric thruster and a"}, {"start": 2204.78, "end": 2213.1800000000003, "text": "single momentum wheel or something like that right okay and now let's let's pick values of this q and"}, {"start": 2213.1800000000003, "end": 2218.1400000000003, "text": "these r matrices here so in other words let's first start with something really really simple let's make"}, {"start": 2218.1400000000003, "end": 2224.94, "text": "the q matrix just diagonal and we'll have a q11 and a q1 uh sorry q22 let's make zeros over here"}, {"start": 2224.94, "end": 2234.3, "text": "similarly for the r matrix right r is just going to be an r1100 r22 right okay so these are these are"}, {"start": 2234.3, "end": 2239.7400000000002, "text": "these are symmetric and as long as all of these these entries are positive we'll see that these"}, {"start": 2239.7400000000002, "end": 2246.1400000000003, "text": "yield a positive semi-definite and a positive uh definite matrix here right so if this is the case"}, {"start": 2246.1400000000003, "end": 2250.3, "text": "let's compute this cost function here or more importantly maybe let's just compute the integrand"}, {"start": 2250.3, "end": 2256.0600000000004, "text": "of the cost function here um maybe let's see what can we do yeah yeah let's let's erase this i think we"}, {"start": 2256.0600000000004, "end": 2262.86, "text": "got the got the picture here okay so now what i want to do here is our is compute the integrand here"}, {"start": 2262.86, "end": 2274.2200000000003, "text": "right of x transpose q x plus u transpose ru right so run to mathematica and plug all this in here and"}, {"start": 2274.2200000000003, "end": 2279.98, "text": "what you'll end up seeing here is that this integrand looks like it's it's pretty simple it's a q11x1"}, {"start": 2280.54, "end": 2291.1800000000003, "text": "squared plus a q22x2 squared maybe let's put the squared like this sorry um plus an r11u1"}, {"start": 2291.8199999999997, "end": 2301.74, "text": "squared plus an r22u2 squared here right so here i think you can very clearly explicitly see"}, {"start": 2301.74, "end": 2310.62, "text": "what do these q11q2 and 22 and r11 and r22 entries uh physically mean right if you look at this right"}, {"start": 2310.62, "end": 2324.54, "text": "we see that q11q1 is sort of the uh the weight or the the penalty effectively on a non-zero x1 right"}, {"start": 2324.54, "end": 2332.94, "text": "because it shows up right here right so if x1 is not zero right um if it's positive or negative by the"}, {"start": 2332.94, "end": 2338.8599999999997, "text": "time you square it this term is going to be positive here right so as long as the magnitude is not zero this"}, {"start": 2338.86, "end": 2345.98, "text": "square term is something uh positive and q11 is now this this multiplicative factor here showing you"}, {"start": 2345.98, "end": 2352.3, "text": "how much does it matter that x1 is not zero here right it will either exacerbate that in terms of"}, {"start": 2352.3, "end": 2357.26, "text": "the cost or it would attenuate it depending on on this value here right and similarly let's just go"}, {"start": 2357.26, "end": 2362.6200000000003, "text": "through all of these just to be very very explicit so q22 right this is the weight or the penalty on a"}, {"start": 2362.62, "end": 2371.3399999999997, "text": "non-zero x2 right so we very clearly see that the q matrix by choosing the entries appropriately you can"}, {"start": 2371.3399999999997, "end": 2376.54, "text": "now say which state do i really care about being non-zero right i can either say that i really care"}, {"start": 2376.54, "end": 2384.7, "text": "about x1 being non-zero or i care about x2 being not zero similarly the r11 term right you see it right"}, {"start": 2384.7, "end": 2393.74, "text": "here right this is the weight or the penalty on a non-zero u1 of t right and similarly r22 is just the"}, {"start": 2393.74, "end": 2401.8999999999996, "text": "weight or the penalty on a non-zero u2 of t right so r11 is basically it's it's actually telling you"}, {"start": 2401.8999999999996, "end": 2410.54, "text": "pretty much exactly how expensive is it to fire or to to utilize control number one right yeah this was"}, {"start": 2410.54, "end": 2413.9, "text": "like maybe your your electric thruster maybe it doesn't cost you anything at all right because"}, {"start": 2413.9, "end": 2419.1, "text": "that's the whole deal with electric thrusters is that electric thrusters are are are cheap um they"}, {"start": 2419.1, "end": 2423.98, "text": "are long lasting they're reliable here so so if you want to model that fact here in your control design"}, {"start": 2423.98, "end": 2430.7799999999997, "text": "you can maybe pick a pick a small r11 right because if r11 is small it's basically saying i don't care"}, {"start": 2430.7799999999997, "end": 2435.2599999999998, "text": "what you're doing with this controller this controller is super duper cheap because even though if this"}, {"start": 2435.26, "end": 2442.38, "text": "control is is is large by the time i multiply by a small r11 this doesn't contribute to the overall"}, {"start": 2442.38, "end": 2449.6600000000003, "text": "cost function much right and in the same fashion you see that r22 is is the is the cost of actuating"}, {"start": 2449.6600000000003, "end": 2456.94, "text": "controller number two here right so that's pretty awesome this i think allows us to set up the entire"}, {"start": 2456.94, "end": 2463.5, "text": "optimization problem here right now the thing that's interesting here is now if we start coming back and"}, {"start": 2463.5, "end": 2468.94, "text": "thinking about um the the constraint here right this is the interesting part we i think we understand"}, {"start": 2468.94, "end": 2474.62, "text": "the cost function at this point right we understand how to tailor or to to tune this cost function using"}, {"start": 2474.62, "end": 2480.7, "text": "this q and this r matrix here right but the thing that we have to do now is we have to solve this overall"}, {"start": 2480.7, "end": 2487.42, "text": "problem now here subject to the linear dynamics of this system here right so that's where it gets"}, {"start": 2487.42, "end": 2492.94, "text": "interesting so why don't i pause the video i'll erase the board and now let's talk about after we set up the"}, {"start": 2492.94, "end": 2499.34, "text": "optimization problem how can we solve this optimization problem okay so now what we'd like to do here is"}, {"start": 2499.34, "end": 2510.78, "text": "look at solving the optimization problem so graphically what this means here is again here we've got our"}, {"start": 2510.78, "end": 2516.46, "text": "linear plant right which is governed by x dot is equal to ax plus bu"}, {"start": 2516.46, "end": 2524.54, "text": "right and now what i want to do is i want to find a control law u here"}, {"start": 2530.38, "end": 2538.78, "text": "which is going to make this whole system here um optimal here right so i'm going to choose a u here"}, {"start": 2538.78, "end": 2544.86, "text": "so that the x uh by the time i look at the combination of u and x in that cost function it stays small"}, {"start": 2544.86, "end": 2551.58, "text": "according to the cost function that we set up here right so um it turns out that the solution to our"}, {"start": 2551.58, "end": 2559.34, "text": "problem here so i'll just write this down here so the solution to our optimization problem here right"}, {"start": 2559.34, "end": 2567.02, "text": "which was we said earlier minimize this cost function of integral zero to infinity of x transpose qx"}, {"start": 2567.02, "end": 2576.86, "text": "plus u transpose r u dt uh subject to these dynamics here right"}, {"start": 2579.9, "end": 2585.1, "text": "this was the optimization problem here well some really smart people figured it out it's beyond the"}, {"start": 2585.1, "end": 2590.62, "text": "scope of this lecture today to derive it here but i think we can use their results here the solution here"}, {"start": 2590.62, "end": 2602.7799999999997, "text": "is that you better choose a control here that looks like this minus k x of t where this gain k here is given by"}, {"start": 2603.42, "end": 2607.66, "text": "r inverse b transpose s here and s"}, {"start": 2609.98, "end": 2611.8199999999997, "text": "is the solution"}, {"start": 2613.66, "end": 2617.98, "text": "to what's called the algebraic ricotti"}, {"start": 2617.98, "end": 2623.02, "text": "equation of this so a"}, {"start": 2624.54, "end": 2636.86, "text": "transpose s plus s a minus s b r inverse or r inverse b transpose s plus q equals zero here right"}, {"start": 2637.5, "end": 2643.42, "text": "okay great um and here yeah s is the solution algebraic ricotti equation and also it is"}, {"start": 2643.42, "end": 2646.3, "text": "it's size n by n and square and symmetric"}, {"start": 2649.34, "end": 2655.1, "text": "okay so this is the solution here right so tell you what if we first if we first ignore everything"}, {"start": 2655.1, "end": 2661.1, "text": "below here just look at look at the solution here right the solution is minus kx we've seen that before"}, {"start": 2661.1, "end": 2665.5, "text": "this is just a full state feedback"}, {"start": 2667.34, "end": 2667.98, "text": "controller"}, {"start": 2667.98, "end": 2674.62, "text": "right so in other words the architecture that goes along with this is that this thing just looks"}, {"start": 2674.62, "end": 2674.94, "text": "like"}, {"start": 2675.02, "end": 2676.86, "text": "minus k"}, {"start": 2678.22, "end": 2685.9, "text": "right so the optimal thing to do the absolute best thing you can do to solve this problem is to use a"}, {"start": 2685.9, "end": 2692.94, "text": "full state feedback controller here now what gets interesting here is that the way you get this k here"}, {"start": 2692.94, "end": 2698.2200000000003, "text": "you have to go through a couple of steps here right if you look at this so step one here is we got to"}, {"start": 2698.2200000000003, "end": 2703.82, "text": "solve the algebraic ricotti equation for s here so let's talk about this the so the procedure"}, {"start": 2707.26, "end": 2713.18, "text": "for lqr right so step one here right we are going to be given"}, {"start": 2713.18, "end": 2724.22, "text": "our a and b matrix right those come from the plan right those are known right okay they're known and"}, {"start": 2724.22, "end": 2728.62, "text": "immutable you can't really change them the next thing we have to do here is you you are going to"}, {"start": 2728.62, "end": 2733.8199999999997, "text": "pick the q and the r right because you as a control designer you get to choose how much do i care about"}, {"start": 2733.8199999999997, "end": 2740.14, "text": "states versus how much do i care about control um actuation here right so you choose the the cost"}, {"start": 2740.14, "end": 2747.58, "text": "function effectively here right so um let's say step two is choose q and r right you're basically"}, {"start": 2747.58, "end": 2753.5, "text": "designing the cost function now according to this step three here is once i have q and r i need to"}, {"start": 2753.5, "end": 2760.2999999999997, "text": "solve the algebraic ricotti equation for s here right so solve i'm just going to abbreviate this as a"}, {"start": 2760.2999999999997, "end": 2767.2599999999998, "text": "r e here right so this down here is the algebraic ricotti equation here right okay so you solve the"}, {"start": 2767.26, "end": 2773.9, "text": "algebraic ricotti equation for s all right what you're going to end up seeing here is that once"}, {"start": 2773.9, "end": 2777.9, "text": "you solve for s there's actually going to be multiple solutions to s we'll take a look at this"}, {"start": 2777.9, "end": 2782.3, "text": "in a second here but if you follow a couple of steps you'll be able to find out which is the one"}, {"start": 2782.3, "end": 2787.42, "text": "you want here once you know that here um well actually no i take that back let's just say solve"}, {"start": 2787.42, "end": 2791.98, "text": "this thing for s you're going to get multiple solutions therefore you can then compute k you're"}, {"start": 2791.98, "end": 2797.98, "text": "going to get multiple solutions for k here right so you can go ahead and compute your optimal gain k"}, {"start": 2799.66, "end": 2805.7400000000002, "text": "using our expression over there right r inverse b transfer transfer transpose s here right and again"}, {"start": 2805.7400000000002, "end": 2810.78, "text": "since there are multiple solutions of s you'll get multiple solutions for k here the last thing that"}, {"start": 2810.78, "end": 2817.42, "text": "you have to do then is typically there's only going to be one solution here that yields a stable situation"}, {"start": 2817.42, "end": 2824.38, "text": "here so um if you remember earlier with this control of a full state feedback here right this"}, {"start": 2824.38, "end": 2832.94, "text": "thing is basically going to behave at the end of the day like x dot is equal to a minus bk x right and"}, {"start": 2832.94, "end": 2840.46, "text": "this here is like maybe you're you're a closed loop um uh a matrix here right again if if this is if this"}, {"start": 2840.46, "end": 2845.5, "text": "is brand new to you here maybe take a quick refresher here to our video where we discuss full state feedback"}, {"start": 2845.5, "end": 2851.18, "text": "controllers but we show that under this control law the dynamics reduced to this here right now what"}, {"start": 2851.18, "end": 2857.1, "text": "you can do here is you've got multiple k's here right so that means you have multiple a closed loops"}, {"start": 2857.1, "end": 2861.98, "text": "you can evaluate each of these eight closed loops and find its eigenvalues and usually there's only one"}, {"start": 2861.98, "end": 2867.02, "text": "of them that are going to have all poles in the uh or eigenvalues in the left half plane here so"}, {"start": 2867.02, "end": 2876.7, "text": "let me let's say step five here is choose um the case solution that yields"}, {"start": 2879.34, "end": 2880.38, "text": "a stable system"}, {"start": 2884.86, "end": 2890.94, "text": "yeah so that's the workflow that we need to go through so uh again i love concrete examples let's"}, {"start": 2890.94, "end": 2895.82, "text": "look at a concrete example right now to try to implement all this so the example i'd like to use"}, {"start": 2895.82, "end": 2904.78, "text": "here is a really simplified scenario it's a um a mass and a damper that's it okay so let's look at an"}, {"start": 2904.78, "end": 2915.34, "text": "example here of a mass uh slash damper system so you got some smooth surface like i don't know like"}, {"start": 2915.34, "end": 2920.38, "text": "some ice or something like that you got a mass sitting on this thing and all we're going to be doing"}, {"start": 2920.38, "end": 2927.1, "text": "here is let's consider the position and the velocity here like such positive position and positive"}, {"start": 2927.1, "end": 2933.26, "text": "velocity is to the right here and let's say that you have um a single control of this you're able to"}, {"start": 2933.26, "end": 2937.82, "text": "exert some kind of force on this block so you maybe have one rocket engine or one thruster that pushes"}, {"start": 2937.82, "end": 2946.78, "text": "this block along this ice here and here there's some viscous uh damping between the block and the the"}, {"start": 2946.78, "end": 2951.5, "text": "surface here all right so i think you can get without too much of a stretch of an imagination"}, {"start": 2951.5, "end": 2955.9, "text": "here that newton's second law equations of motions are going to basically give you mass times of a law"}, {"start": 2955.9, "end": 2963.26, "text": "uh mass times acceleration right is equal to the sum of all of the forces here right so you got the force"}, {"start": 2963.26, "end": 2972.6200000000003, "text": "here minus the retarding force of the um ice here right p times c or sorry c times p dot here"}, {"start": 2972.62, "end": 2980.38, "text": "right okay so without too much um sorry i guess we should say viscous damping with coefficient"}, {"start": 2982.38, "end": 2989.02, "text": "c right that's what this c is here it's just how much friction you got okay so um without too much of"}, {"start": 2989.02, "end": 2994.7, "text": "a of of a stretch i think you can turn this thing into a state space representation here by choosing a"}, {"start": 2994.7, "end": 3002.54, "text": "state vector x of t as let's make it the position and the velocity of the block that's our state vector"}, {"start": 3002.54, "end": 3006.54, "text": "and the control vector in this case is actually really really simple there's only one control"}, {"start": 3006.54, "end": 3016.14, "text": "it's this force right okay if you do this here you can basically get yourself a uh a state space"}, {"start": 3016.14, "end": 3031.18, "text": "representation of x dot of t is equal to uh zero one zero minus c over m x plus zero one over m u"}, {"start": 3032.94, "end": 3037.18, "text": "great that's our state space representation here's our a matrix here's our b matrix here"}, {"start": 3037.18, "end": 3041.74, "text": "let's go ahead and choose some numeric values so we can actually try to compute some of these here so"}, {"start": 3041.74, "end": 3049.34, "text": "let's go ahead and how about consider a mass of one and a coefficient of damp uh damping here of 0.2"}, {"start": 3049.34, "end": 3057.02, "text": "so numerically we end up with an a matrix that looks like 0 1 0 minus 1 5th here and a b matrix that"}, {"start": 3057.02, "end": 3064.46, "text": "looks like uh 0 1 okay something pretty simple now that is uh that's step one here right we got a and b"}, {"start": 3064.46, "end": 3072.3, "text": "okay step two here is let's choose q and r okay so i don't know let's pick like a q of just uh something"}, {"start": 3072.3, "end": 3076.62, "text": "really simple how about an identity matrix here later on we're going to look at some examples where"}, {"start": 3076.62, "end": 3083.74, "text": "they're not identities but uh okay q is identity matrix r i don't know let's choose something like"}, {"start": 3083.74, "end": 3091.9, "text": "0.01 something like that okay great so we got step one and step two now done now we got to go ahead and"}, {"start": 3091.9, "end": 3097.98, "text": "solve ourselves the algebraic ricotti equation here so um that's a little bit of a pain in the neck here"}, {"start": 3097.98, "end": 3103.02, "text": "right because if you remember that's this long matrix equation we got to set it equal to zero and solve for"}, {"start": 3103.02, "end": 3109.58, "text": "s here so i don't want to do that on the board let's do actually steps three through five here"}, {"start": 3109.58, "end": 3114.54, "text": "let's just run over to mathematica and have it do this for us so we can um see how can we compute"}, {"start": 3114.54, "end": 3118.62, "text": "this gain k all right so i'm going to pause the video and i'll meet you over on mathematica all right"}, {"start": 3118.62, "end": 3123.82, "text": "so here we are in mathematica so why don't we go ahead and uh make a couple of notes here so what we"}, {"start": 3123.82, "end": 3130.3, "text": "would like to do now is demonstrate solving the ar the algebraic ricotti equation and computing"}, {"start": 3130.3, "end": 3139.1000000000004, "text": "uh and lqr controller k right that's our game plan here so we said uh let's first do step one right"}, {"start": 3139.1000000000004, "end": 3145.7400000000002, "text": "step one was define the a and b matrix right so i think what we said was a was just a very simple"}, {"start": 3146.7000000000003, "end": 3153.34, "text": "uh what was it zero one zero minus one fifth i think and then b was uh pretty simple zero and one"}, {"start": 3153.34, "end": 3161.5, "text": "okay there we go shift enter that guy and here's step one uh what was step two step two was go ahead"}, {"start": 3161.5, "end": 3169.5, "text": "and choose q and r right so i think in our situation we said that the q was just going to be a very simple"}, {"start": 3169.5, "end": 3177.9, "text": "identity matrix here and the r matrix is actually going to be a one by one um of one over 100 here so"}, {"start": 3177.9, "end": 3183.9, "text": "let me just define it here as a list of lists here it's just that mathematics has a little bit of"}, {"start": 3183.9, "end": 3190.2200000000003, "text": "trouble using uh the parentheses notation to make a one by one matrix here so i'm going to just"}, {"start": 3190.2200000000003, "end": 3197.6600000000003, "text": "explicitly make a one by one matrix here um okay shift enter both those um okay now we're on to step"}, {"start": 3197.6600000000003, "end": 3205.1, "text": "three we said which was solve the are right so just to refresh your memory here right um the the algebraic"}, {"start": 3205.1, "end": 3212.7799999999997, "text": "ricotti equation is given by what do we say was i think it was a transpose s plus sa minus s b"}, {"start": 3213.5, "end": 3225.5, "text": "whoops r inverse b transpose s plus q equals zero right so we want to solve this for s here right"}, {"start": 3225.5, "end": 3230.22, "text": "okay so let's just go ahead and compute the left hand side of that expression first so the left hand"}, {"start": 3230.22, "end": 3240.3799999999997, "text": "side here is what it's just transpose a times s plus s times a minus s times b times inverse of r"}, {"start": 3241.18, "end": 3250.06, "text": "uh times transpose of b times s plus q right so that's the left hand side here and maybe let's just"}, {"start": 3250.06, "end": 3258.06, "text": "simplify maybe let's put the simplify up here whoops did i spell that wrong simplify here right and let's"}, {"start": 3258.06, "end": 3265.58, "text": "just look at this thing in matrix form just to get an idea of this so uh wait a second oh i'm sorry"}, {"start": 3265.58, "end": 3274.54, "text": "here we should have defined s here right so um we we uh should know here that s is what it's a symmetric"}, {"start": 3274.54, "end": 3280.54, "text": "matrix here so there's gonna be an s11 and s12 and this is also going to be an s12 because it's symmetric"}, {"start": 3280.54, "end": 3285.5, "text": "and then we'll have an s22 so this is what s looks like here so maybe let's make a quick note of that here"}, {"start": 3285.5, "end": 3299.34, "text": "in the mathematical notebook here so uh define s as a symmetric matrix of size n by n right okay now"}, {"start": 3299.34, "end": 3308.78, "text": "this second step here is go ahead and solve the are okay so let's see uh shift enter this value of s here"}, {"start": 3308.78, "end": 3313.98, "text": "shift enter the right hand side here we go so here's what it looks like right so we see now we basically"}, {"start": 3313.98, "end": 3319.58, "text": "have um again this is actually a symmetric equation here right or symmetric matrix if you look this"}, {"start": 3319.58, "end": 3325.1, "text": "off diagonal entry is the exact same as this off diagonal entry here so really we have three"}, {"start": 3325.1, "end": 3332.7, "text": "equations and three unknowns right i need to find s11 s12 and s22 here right so what i need to really do"}, {"start": 3332.7, "end": 3339.7400000000002, "text": "now is i need to say solve basically the uh a bunch of equations right it's the left hand side the 11"}, {"start": 3339.74, "end": 3345.5, "text": "element right this has got to equal zero actually all of these entries have to equal zero so this has"}, {"start": 3345.5, "end": 3352.2999999999997, "text": "equal zero the left hand side of one two has got to also equal zero and the left hand side uh 22 has"}, {"start": 3352.2999999999997, "end": 3358.22, "text": "got to equal zero right so those are the this equation has got equal zero this has to equal zero and this"}, {"start": 3358.22, "end": 3366.22, "text": "has to equal zero here right those all solve them simultaneously for what s11 s12 and s22 right that's what i'm"}, {"start": 3366.22, "end": 3371.74, "text": "looking for here right so if i shift enter this you see that we actually have four solutions like we"}, {"start": 3371.74, "end": 3376.22, "text": "said earlier right that was to be expected we said that when you solve this for a lot of times they're"}, {"start": 3376.22, "end": 3382.4599999999996, "text": "going to be multiple solutions for s so let's just go ahead and um extract those here so maybe let's assign"}, {"start": 3382.4599999999996, "end": 3391.3399999999997, "text": "this to a temporary variable call it temp and um let's see here uh s um let me think about this how do we"}, {"start": 3391.34, "end": 3397.1000000000004, "text": "want to do this here uh you know actually we already defined s up here i i know what we'll do let's just do it"}, {"start": 3397.1000000000004, "end": 3405.42, "text": "like this here so um let's call this thing how about solution one gets a temp one so this is the first"}, {"start": 3405.42, "end": 3410.46, "text": "set of solutions here all right um let's do this for actually all four of them here right so let's get"}, {"start": 3410.46, "end": 3418.94, "text": "all four solutions here so let me see change this to a four three two and then solution two three four"}, {"start": 3418.94, "end": 3425.5, "text": "okay so here's our four solutions and what i want to do now here is make the four matrices here so s1"}, {"start": 3425.5, "end": 3431.26, "text": "is going to get s but i want to make all of these appropriate substitutions so i'll just say slash dot"}, {"start": 3431.26, "end": 3439.26, "text": "with solution one all right so here's s1 and great let's again do this for all four four three whoops four"}, {"start": 3440.7000000000003, "end": 3447.9, "text": "three two and then this should be two three four here and tell you what let's just go ahead and suppress"}, {"start": 3447.9, "end": 3453.82, "text": "the output for all these and then we will just look at these things as numerical values in matrix form"}, {"start": 3453.82, "end": 3463.98, "text": "just we can get a rough idea of what they look like oh sorry that should be s1 s2 s3 and s4 so we"}, {"start": 3463.98, "end": 3471.1800000000003, "text": "shift into those so we see here are the four solutions here to the algebraic ricotti equation so we need to"}, {"start": 3471.1800000000003, "end": 3477.34, "text": "now identify which one of these are the correct ones so let's move on to step four here step four which was"}, {"start": 3477.34, "end": 3487.02, "text": "compute k right and if you remember here we said that the way we compute k here was k um sorry excuse"}, {"start": 3487.02, "end": 3497.98, "text": "me uh k is going to be what it's r inverse b transpose times s here so we end up with four solutions here so"}, {"start": 3497.98, "end": 3507.1000000000004, "text": "let's do this here so k1 is inverse of r times transpose b times s1 here so that's the first"}, {"start": 3507.1, "end": 3511.18, "text": "possible solution and makes me let's do this let's make let's get all four of these guys"}, {"start": 3513.3399999999997, "end": 3522.86, "text": "two three four and then four three two okay great and then let's look at their actual values here for"}, {"start": 3522.86, "end": 3532.2999999999997, "text": "fun k1 slash slash um n slash matrix form and again let's look at all four of the different controllers"}, {"start": 3532.3, "end": 3537.5, "text": "that we've now computed here here we go so you can see they're they're they're very different here"}, {"start": 3537.5, "end": 3541.98, "text": "they have different signs they have different numeric values here so theoretically or at least"}, {"start": 3541.98, "end": 3546.2200000000003, "text": "mathematically all of these solve the problem but we know from an engineering standpoint here that they"}, {"start": 3546.2200000000003, "end": 3553.26, "text": "can't all work only the ones that have stable uh closed loop eigenvalues um actually will give us"}, {"start": 3553.26, "end": 3560.54, "text": "a system which goes back to the origin and therefore has minimum um minimum cost in our cost function so now"}, {"start": 3560.54, "end": 3567.74, "text": "step five here is we need to find solution that yields stable system so in other words what i want"}, {"start": 3567.74, "end": 3576.06, "text": "to do here is i want to look at the eigenvalues of a minus b k right and uh let's call this here here's my"}, {"start": 3576.06, "end": 3582.06, "text": "first set of eigenvalues is is lambda one and again let's just go ahead and do this for all of them"}, {"start": 3582.06, "end": 3594.7799999999997, "text": "all right so here's lambda two three four and this should be four three uh two okay and then let's just"}, {"start": 3594.7799999999997, "end": 3605.2599999999998, "text": "look at them all here so uh lambda one uh slash slash n and let's just do this for all of them we'll look"}, {"start": 3605.26, "end": 3610.94, "text": "at numerical values for all of these guys right so two three four all right shift enter that here we"}, {"start": 3610.94, "end": 3616.1400000000003, "text": "are so if you look at this okay obviously this one's out we got a positive poll we got a positive poll"}, {"start": 3616.1400000000003, "end": 3623.0200000000004, "text": "got two positive polls aha here we are it's actually the fourth solution here right the fourth solution"}, {"start": 3623.0200000000004, "end": 3630.1400000000003, "text": "gets you a controller which will yield negative um polls so we see that the solution here that we're"}, {"start": 3630.14, "end": 3636.14, "text": "looking for it's really k4 here so here's my controller here that should work a positive 10"}, {"start": 3636.14, "end": 3643.98, "text": "and a positive 10.75 okay great so we just did this in mathematica and we saw that basically this a b q"}, {"start": 3643.98, "end": 3649.66, "text": "and r matrix when you run it through the procedure yields a gain matrix k of what do we say this was"}, {"start": 3649.66, "end": 3658.22, "text": "this was 10 and 10.76 here right so perfect we designed our full state feedback controller using this"}, {"start": 3658.22, "end": 3662.22, "text": "technique but as you saw it's a little bit cumbersome right you got to go through all of these five"}, {"start": 3662.7799999999997, "end": 3670.7799999999997, "text": "um operations here luckily for us matlab has taken all of these operations here and packaged up it up"}, {"start": 3670.7799999999997, "end": 3678.8599999999997, "text": "into one function called lqr so if you pass lqr these necessary inputs right in other words you give it the a"}, {"start": 3678.8599999999997, "end": 3685.98, "text": "b the q and the r matrix this lqr function will basically go through this operation and return to you"}, {"start": 3686.7, "end": 3691.98, "text": "the gain matrix k it also i believe will give you the solution s here that we were solving for"}, {"start": 3691.98, "end": 3697.42, "text": "as well as the closed loop eigenvalues of your system here so in other words in matlab all you"}, {"start": 3697.42, "end": 3708.14, "text": "got to do here is call lqr pass it a b q and r and it will return to you k s and e here so again here k is"}, {"start": 3708.14, "end": 3719.8199999999997, "text": "going to be your um full state feedback gain matrix uh s is going to be the solution to the algebraic"}, {"start": 3719.8199999999997, "end": 3728.14, "text": "ricotti equation and e are going to be the eigenvalues of the closed loop system right a minus b k right"}, {"start": 3728.7799999999997, "end": 3734.7, "text": "great so what i'd like to do now here is lqr is as we see it's this it's this powerful tool here that's"}, {"start": 3734.7, "end": 3741.2599999999998, "text": "going to allow us to change the behavior of the controller k here right by specifying the q and"}, {"start": 3741.2599999999998, "end": 3746.06, "text": "the r here so i'd like to investigate now three scenarios so maybe let's make ourselves a little"}, {"start": 3746.06, "end": 3756.7, "text": "table here so scenario maybe with a description um and we'll see what is the resulting k here okay so"}, {"start": 3756.7, "end": 3761.4199999999996, "text": "let's make ourselves a little table here i'd like to investigate three scenarios one two three"}, {"start": 3761.42, "end": 3767.66, "text": "three so in the first scenario what i'd like to look at here is um let's go ahead and investigate"}, {"start": 3767.66, "end": 3784.78, "text": "the situation where control is cheap and a non-zero state is expensive right um and then in scenario two"}, {"start": 3784.78, "end": 3790.94, "text": "maybe let's get ourselves a little bit more room here scenario two let's look at sort of the opposite"}, {"start": 3790.94, "end": 3801.18, "text": "scenario here where control is expensive and a non-zero well maybe i shouldn't i mean let's write this out"}, {"start": 3803.42, "end": 3816.14, "text": "where a control is expensive and a non-zero state is cheap okay and then finally the third scenario here"}, {"start": 3816.14, "end": 3823.9, "text": "is let's let's let's mix this up a little bit let's say how about only a non-zero velocity"}, {"start": 3825.9, "end": 3826.7, "text": "is expensive"}, {"start": 3829.98, "end": 3837.8199999999997, "text": "okay so in this first scenario right you're saying uh that maybe um it i don't i really don't care how"}, {"start": 3837.8199999999997, "end": 3842.8599999999997, "text": "much control authority you have to exert i just really want to make sure that the state goes to zero"}, {"start": 3842.86, "end": 3847.82, "text": "quickly the second scenario is the exact opposite whereas maybe back to our satellite example where"}, {"start": 3847.82, "end": 3853.5, "text": "you're flying to mars here and and and fuel is extremely expensive but you have all the time in"}, {"start": 3853.5, "end": 3859.34, "text": "the world to kind of make sure that the the satellite returns to its appropriate orientation here and"}, {"start": 3859.34, "end": 3864.2200000000003, "text": "fine the third scenario is kind of interesting it's saying i only care about the velocity i want to make"}, {"start": 3864.2200000000003, "end": 3869.58, "text": "sure that the velocity doesn't um stay high i really don't care about the position here so what i'd like to"}, {"start": 3869.58, "end": 3874.46, "text": "do now is and actually maybe instead of k here first let's talk about translating this into an"}, {"start": 3874.46, "end": 3883.8199999999997, "text": "appropriate q and r matrix okay so you can kind of see in this first case where we're saying q uh"}, {"start": 3883.8199999999997, "end": 3890.06, "text": "control is cheap and non-zero state is expensive uh here that's almost like the scenario we just looked"}, {"start": 3890.06, "end": 3898.54, "text": "at here so with a q matrix of an identity matrix one one zero zero and an r matrix of zero point zero one"}, {"start": 3898.54, "end": 3904.7, "text": "right again all we care about is sort of the relative sizes so you can see here that r is much"}, {"start": 3904.7, "end": 3912.3, "text": "much smaller sort of relative to q so that should hopefully translate into a scenario where uh control"}, {"start": 3912.3, "end": 3918.62, "text": "is is cheap you have an aggressive controller here and in fact we saw let's write down exactly what the"}, {"start": 3918.62, "end": 3924.86, "text": "gain matrix k was coming out of this scenario here so we actually just solved this here so the k in this case"}, {"start": 3924.86, "end": 3933.34, "text": "was 10 and 10.76 right okay now let's look at the second scenario here where we would like to flip this"}, {"start": 3933.34, "end": 3939.58, "text": "so all we got to do now in this scenario is effectively sort of change the sizing the relative"}, {"start": 3939.58, "end": 3944.94, "text": "sizing of q and r so maybe let's keep q the same here so let's let's use another identity matrix"}, {"start": 3946.3, "end": 3952.6200000000003, "text": "but let's just jack up r we got to make r much bigger than uh than q effectively so maybe i don't"}, {"start": 3952.62, "end": 3958.46, "text": "let's let's go with a thousand here right and now the question is what is going to be k so we're"}, {"start": 3958.46, "end": 3962.46, "text": "going to run over to matlab and use lqr to do that before we go to matlab just so we don't have to break"}, {"start": 3962.46, "end": 3967.66, "text": "tempo so much let's fill in a q and an r for this third scenario here so in the case where we only want"}, {"start": 3967.66, "end": 3973.18, "text": "to penalize velocity here right we can kind of see that one way to do that here is by choosing your q"}, {"start": 3973.18, "end": 3979.2599999999998, "text": "matrix appropriately so for this q matrix what we would want to do here is if i only care about the the"}, {"start": 3979.26, "end": 3984.2200000000003, "text": "velocity being expensive i just got to make sure that the q entry that is associated with the second"}, {"start": 3984.2200000000003, "end": 3990.0600000000004, "text": "state is big relative to the q entry associated with the first state so maybe let's do something"}, {"start": 3990.0600000000004, "end": 4000.78, "text": "like this 0.001 and then uh 10. so as you can see here they're they are clearly um mismatched so the"}, {"start": 4000.78, "end": 4006.6200000000003, "text": "second state will be penalized orders and orders of magnitude more than the first state here right"}, {"start": 4006.62, "end": 4010.94, "text": "and then finally the r matrix i don't know let's just choose one here right because in this scenario"}, {"start": 4010.94, "end": 4015.66, "text": "all we want to show is the mismatch between the two states all right so now that we've set this up we've"}, {"start": 4015.66, "end": 4020.14, "text": "got all the different cues and the r's let's run over to matlab and have it basically we're just going"}, {"start": 4020.14, "end": 4027.98, "text": "to call lqr three times on each of these scenarios and see what the resulting matrix k is and then why"}, {"start": 4027.98, "end": 4033.1, "text": "don't we simulate that using uh our full state feedback controller right because we said that once you get"}, {"start": 4033.1, "end": 4038.2999999999997, "text": "this this this gain matrix k the optimal thing to do here is to have your plant right your x dot is"}, {"start": 4038.2999999999997, "end": 4046.94, "text": "equal to ax plus bu right and we're just going to wrap this back through a minus k and let's use some"}, {"start": 4046.94, "end": 4052.7, "text": "initial conditions i don't know maybe um in in here let's use initial conditions of uh what did i end up"}, {"start": 4052.7, "end": 4060.7799999999997, "text": "using here uh let me just make sure oh here's something like maybe let's make it pi and uh negative 2 here"}, {"start": 4060.78, "end": 4068.7000000000003, "text": "right so this is the position it's pi units away it's moving at negative 2 meters per second velocity"}, {"start": 4068.7000000000003, "end": 4073.98, "text": "here and let's see how fast this non-zero initial condition will be regulated to zero in these three"}, {"start": 4073.98, "end": 4079.1800000000003, "text": "different scenarios all right so here we are in matlab and i've actually already typed up this script just"}, {"start": 4079.1800000000003, "end": 4083.9, "text": "so you don't have to watch me inputting it in real time here um and we see that this is really simple all"}, {"start": 4083.9, "end": 4089.5800000000004, "text": "we're doing here is defining our a and b matrix as we had on the board and now the q and the r matrix we saw"}, {"start": 4089.58, "end": 4094.2999999999997, "text": "that the only difference between the three scenarios of where we either want cheap control"}, {"start": 4094.2999999999997, "end": 4099.42, "text": "expensive control or the scenario where we ignore the position and only care about velocity the only"}, {"start": 4099.42, "end": 4106.14, "text": "difference is the q and the r matrix right those were our tuning knobs to tailor the optimization problem"}, {"start": 4106.14, "end": 4111.1, "text": "for our specific desired application so i've just got a switch statement here where depending on what"}, {"start": 4111.1, "end": 4116.22, "text": "scenario we're investigating i will just load in and define the q and the r matrix that we discussed on"}, {"start": 4116.22, "end": 4122.9400000000005, "text": "the board once i've got the a b q and r matrix we saw that the entire l qr process is now packaged up"}, {"start": 4122.9400000000005, "end": 4128.860000000001, "text": "into one nice function call in matlab namely l qr so i give it the a b q and r matrix and it will give me"}, {"start": 4128.860000000001, "end": 4135.34, "text": "my full state feedback gain k the solution of the algebraic ricotti equation s as well as the eigenvalues"}, {"start": 4135.34, "end": 4140.7, "text": "of the closed loop system here so i'm just going to print that out to the screen so we can see what the"}, {"start": 4140.7, "end": 4145.820000000001, "text": "the controller looks like and once i've got that defined we can think about running a simulation"}, {"start": 4146.22, "end": 4151.820000000001, "text": "to examine how does the system respond under this controller so i've got um just a couple of"}, {"start": 4151.820000000001, "end": 4155.34, "text": "parameters here like i'm going to change the final simulation time and then we're going to define"}, {"start": 4155.34, "end": 4160.54, "text": "the initial condition of this of the state space model as we discussed on the board here so let's"}, {"start": 4160.54, "end": 4166.46, "text": "build a simulink model now that will simulate this system i've got myself a blank uh simulink model here"}, {"start": 4166.46, "end": 4171.740000000001, "text": "saved and ready to go so it's really simple the only thing i need to do here is first let's grab"}, {"start": 4171.74, "end": 4177.26, "text": "ourselves a state space block here and open it up and change the parameters to be a b and now the c"}, {"start": 4177.26, "end": 4183.82, "text": "matrix right this needs to be a uh identity matrix of size two and the zero uh the d matrix is what"}, {"start": 4183.82, "end": 4189.58, "text": "it's basically zeros of size two by one right all right so this here now is a state space system that"}, {"start": 4189.58, "end": 4194.46, "text": "we defined here where the output is just the state okay and we'll put in the initial conditions like"}, {"start": 4194.46, "end": 4200.62, "text": "we discussed earlier hit okay and now the controller in this case it's just a full state feedback"}, {"start": 4200.62, "end": 4206.62, "text": "controller so it's just really a simple gain here of magnitude minus k and i just need to change the"}, {"start": 4206.62, "end": 4212.14, "text": "multiplication from being element wise to being a matrix multiply and we basically have now maybe a"}, {"start": 4212.14, "end": 4217.34, "text": "better name for this instead of just gain here is this is our full state feedback controller computed"}, {"start": 4218.0599999999995, "end": 4226.54, "text": "via lqr right so this is my lqr controller effectively right so let's just hook everything up oh come on"}, {"start": 4226.54, "end": 4234.78, "text": "connect there we go connect this up together and we basically have our simulation ready to go um oh"}, {"start": 4234.78, "end": 4239.5, "text": "wait we should maybe change this for a simulation time let's make a t final like we discussed and"}, {"start": 4239.5, "end": 4247.1, "text": "also what we probably want to do is send this results back to matlab so we can analyze it so let's grab a"}, {"start": 4247.1, "end": 4254.54, "text": "two workspace block and i will change this to be sim x here and let's change the save format i just like"}, {"start": 4254.54, "end": 4263.18, "text": "structure with time better than time series and let's go ahead and save both the um the uh output"}, {"start": 4263.18, "end": 4269.34, "text": "state here and then you know we should also do is let's copy and paste this and we'll get another one"}, {"start": 4269.34, "end": 4277.0199999999995, "text": "which is going to be sim u and i think we should be good there and let's hook this up uh whoops sorry"}, {"start": 4277.0199999999995, "end": 4283.66, "text": "branch off and hold there we go save this guy we should be able to now close this model here it"}, {"start": 4283.66, "end": 4289.0199999999995, "text": "should be ready to go and now what i'm going to do here is let's just go ahead and simulate the system"}, {"start": 4289.0199999999995, "end": 4295.0199999999995, "text": "now all right so now let's just go ahead and run that simulation here so i'm going to call sim intro"}, {"start": 4295.0199999999995, "end": 4300.46, "text": "to lqr and once that simulation has finished let's go ahead and extract the data here right so time is"}, {"start": 4300.46, "end": 4309.0199999999995, "text": "going to be uh sim x dot time and then x1 is going to be sim x dot signals dot values all rows column 1"}, {"start": 4309.02, "end": 4317.18, "text": "here and let's do the same thing for x2 and u1 at the same time here so extract the second state and"}, {"start": 4317.18, "end": 4323.02, "text": "the first control here and now we've got those extracted we can go ahead and plot these right"}, {"start": 4323.02, "end": 4330.540000000001, "text": "so let's go figure subplot 3 1 1 and let's plot time and x1 and let's make this a little bit thicker"}, {"start": 4331.660000000001, "end": 4337.18, "text": "so we can see it a little bit more easily and we'll maybe add a legend as well just so we can"}, {"start": 4337.18, "end": 4343.740000000001, "text": "discern which one is which and let's do the same thing for x2 and u1 while we're at it here"}, {"start": 4346.22, "end": 4353.42, "text": "and maybe what we should also do here is um let's add a title to this first subplot here"}, {"start": 4353.42, "end": 4355.58, "text": "so we can denote what the scenario is"}, {"start": 4359.1, "end": 4366.860000000001, "text": "okay scenario there we go okay great so this looks pretty reasonable so let's go ahead and run this"}, {"start": 4366.86, "end": 4372.7, "text": "script here and first off we see yep this is the gain matrix k that we computed it's the same thing"}, {"start": 4373.5, "end": 4377.5, "text": "um that we computed manually let's go ahead and look at this solution of the algebraic ricotti equation"}, {"start": 4377.5, "end": 4381.5, "text": "and again this should be the exact same values that we got with our manual calculation in"}, {"start": 4381.5, "end": 4386.7, "text": "mathematica so this all looks pretty reasonable now let's look at the results here so remember this is"}, {"start": 4386.7, "end": 4393.42, "text": "the scenario here of cheap control so we see that what cheap control means here is that the system or"}, {"start": 4393.42, "end": 4399.02, "text": "the controller decides that i better make sure that the states go to zero fairly quickly so you see"}, {"start": 4399.02, "end": 4405.1, "text": "that in just five seconds both the position and the velocity of the system have gone to zero here"}, {"start": 4405.1, "end": 4411.34, "text": "and we spent around i don't know what is that minus nine minus 10 units of force in order to do that here"}, {"start": 4411.9800000000005, "end": 4417.66, "text": "so let's compare this now with maybe scenario two and maybe what we should do is let's keep this plot"}, {"start": 4417.66, "end": 4422.22, "text": "up so we can compare so maybe let's come to the top of our script here and temporarily comment out"}, {"start": 4422.22, "end": 4428.22, "text": "this close all command and let's just change our scenario now to scenario two here so scenario two"}, {"start": 4428.22, "end": 4434.860000000001, "text": "is now let's tell the control system or tell the lqr procedure that control is really expensive now so"}, {"start": 4434.860000000001, "end": 4443.02, "text": "if i run this again you see the k matrix now is smaller so we have a less aggressive controller here so"}, {"start": 4443.02, "end": 4449.18, "text": "if we look at this now here's scenario number two and if we compare that with scenario one maybe let's"}, {"start": 4449.18, "end": 4455.1, "text": "put scenario one on the left here and let's put scenario two on the right you can see the"}, {"start": 4455.1, "end": 4460.62, "text": "differences in control right so now the control system or the lqr procedure realizes that you know"}, {"start": 4460.62, "end": 4468.3, "text": "what um control is very expensive this is now like rocket fuel that is very uh costly so what i'm going"}, {"start": 4468.3, "end": 4473.740000000001, "text": "to do is the controller is going to allow the state to be non-zero for a longer amount of time right so"}, {"start": 4473.740000000001, "end": 4478.860000000001, "text": "you see over here it takes almost 30 seconds for the position and the velocity of the block to come"}, {"start": 4478.86, "end": 4485.099999999999, "text": "regulated back to zero but the benefit is if we compare the control that was expended here"}, {"start": 4485.099999999999, "end": 4490.78, "text": "you can see the magnitude is much less right instead of having minus 10 units of force we're now we're"}, {"start": 4490.78, "end": 4497.98, "text": "now you know two orders of magnitude less here right and great now finally let's look at our third"}, {"start": 4497.98, "end": 4501.98, "text": "scenario here so i'll come back to the script here and change it to scenario three where we're going to"}, {"start": 4501.98, "end": 4508.219999999999, "text": "now ignore position and if i rerun this thing again again you see that the controller changes and more"}, {"start": 4508.219999999999, "end": 4514.54, "text": "importantly the behavior of that controller changes so now take a look at this this is pretty awesome"}, {"start": 4514.54, "end": 4520.0599999999995, "text": "the control system realizes that you know what i better make sure that the velocity goes to zero so"}, {"start": 4520.0599999999995, "end": 4525.259999999999, "text": "it does that quickly but it doesn't give a hoot what the position is doing look at this the position"}, {"start": 4525.26, "end": 4531.42, "text": "is sitting here and still after 30 seconds it's nowhere near back to the origin but who cares right"}, {"start": 4531.42, "end": 4537.02, "text": "the controller realizes that the position does not factor into the cost function much at all so it's"}, {"start": 4537.02, "end": 4543.820000000001, "text": "going to choose a control strategy that only pays attention to what matters namely the velocity and the"}, {"start": 4543.820000000001, "end": 4549.5, "text": "control signal here so this is pretty awesome if you think about it we've now got a tool that's going to"}, {"start": 4549.5, "end": 4555.82, "text": "allow us to translate between physical requirements like which states and which controls do you care about"}, {"start": 4555.82, "end": 4561.58, "text": "and then synthesize a controller that will respond and respect those uh engineering requirements"}, {"start": 4561.58, "end": 4566.54, "text": "okay so that was pretty interesting exciting results so i think we can come here we can fill out our"}, {"start": 4566.54, "end": 4572.94, "text": "table here and finish this section here so again we saw the situation where control was cheap and a non-zero"}, {"start": 4572.94, "end": 4578.7, "text": "state was expensive we had this type of a controller come out of the lqr process but now when we"}, {"start": 4578.7, "end": 4587.179999999999, "text": "change that r matrix we saw that the control was much less aggressive i think what 0.03 and 0.12 so"}, {"start": 4587.179999999999, "end": 4592.38, "text": "yeah you can just look by the magnitude of these two you see that the second controller is is much"}, {"start": 4592.38, "end": 4597.42, "text": "more conservative right and then finally the third situation where we only cared about the velocity you"}, {"start": 4597.42, "end": 4601.099999999999, "text": "know it's a little harder to interpret this controller here but i think we ended up with something like"}, {"start": 4601.099999999999, "end": 4608.62, "text": "0.03 and 2.98 here but again we might not be able to interpret directly what these numbers"}, {"start": 4608.62, "end": 4614.3, "text": "mean here but we saw the behavior was exactly what we wanted here right in the sense that the uh"}, {"start": 4614.3, "end": 4619.82, "text": "controller drives the velocity to zero fairly quickly but doesn't care so much about the position"}, {"start": 4619.82, "end": 4626.46, "text": "here right okay well this is uh we're really cooking with gas now so give me a chance to erase the board"}, {"start": 4626.46, "end": 4632.46, "text": "here and we'll come back and apply lqr in another way okay so now that we've got a rough handle on what"}, {"start": 4632.46, "end": 4643.1, "text": "lqr is and what it can do let's talk about how about using lqr to address some of these practical"}, {"start": 4644.86, "end": 4647.66, "text": "full state feedback control issues"}, {"start": 4650.06, "end": 4655.5, "text": "so if you remember this is actually what we discussed in uh our previous lecture here so again"}, {"start": 4655.5, "end": 4660.46, "text": "i i would encourage you to check out that video if you haven't done so here because i think it will set"}, {"start": 4660.46, "end": 4666.22, "text": "the stage for this discussion now and you'll have a better understanding of the context but um if you"}, {"start": 4666.22, "end": 4670.62, "text": "don't want to maybe just a real quick recap what we looked at last time where we were talking about"}, {"start": 4670.62, "end": 4675.9, "text": "full state feedback issues is we looked at a plant model here which was a uh a dc motor"}, {"start": 4677.18, "end": 4682.14, "text": "right and the idea with this plant model here was there were two control inputs there was a voltage on"}, {"start": 4682.14, "end": 4687.58, "text": "the armature of the motor as well as an external disturbance torque you could apply to the motor and what"}, {"start": 4687.58, "end": 4693.18, "text": "this thing did here is the full state of this system here was the position of the motor the velocity"}, {"start": 4693.18, "end": 4701.42, "text": "of the motor and the current of the motor here so um using this state vector x of just uh theta omega"}, {"start": 4701.42, "end": 4708.46, "text": "and i and a control vector u of just va and this tl which was the armature voltage and the torque here"}, {"start": 4708.46, "end": 4714.7, "text": "we saw that numerically you got an a matrix um that we were playing with it was a three by three here"}, {"start": 4714.7, "end": 4723.34, "text": "it looked like zero one zero zero minus zero point two nine and seventy one point nine three and then"}, {"start": 4723.34, "end": 4730.46, "text": "finally zero minus sixty three point two four and minus ten twenty point three five here and then your"}, {"start": 4730.46, "end": 4736.94, "text": "b matrix we actually we're just looking at the b1 here right the first column so what we did here in"}, {"start": 4736.94, "end": 4742.7, "text": "the example last time is forget about this external torque here pretend that this system only has one input"}, {"start": 4742.7, "end": 4748.0599999999995, "text": "which is the armature voltage therefore the b matrix only has one column and this is going to be zero zero"}, {"start": 4748.62, "end": 4755.66, "text": "uh 641.81 something like that right just to give you some numerical values that we can play with now"}, {"start": 4755.66, "end": 4763.42, "text": "right so this here is our model of this motor here right and what we said last time here right was that"}, {"start": 4763.42, "end": 4767.5, "text": "you could design a full state feedback controller for this system but we saw that we ended up with some"}, {"start": 4767.5, "end": 4773.02, "text": "issues right some of the issues we we encountered when designing a full state feedback control system"}, {"start": 4773.02, "end": 4785.74, "text": "was control saturation right and two was the inability to measure all states right you couldn't measure the"}, {"start": 4785.74, "end": 4790.78, "text": "full state uh every we didn't have a sensor for every single one of these i think we only had a sensor"}, {"start": 4790.78, "end": 4796.86, "text": "for for one of them right so last time we looked at some uh i don't know if i want to call them hacks"}, {"start": 4796.86, "end": 4802.219999999999, "text": "here but they were they were ways that you could try to address these right we said that full state"}, {"start": 4802.219999999999, "end": 4807.099999999999, "text": "feedback controllers were incredibly powerful right but but as spider-man's uncle said right with great"}, {"start": 4807.099999999999, "end": 4811.34, "text": "power comes great responsibility we have to deal with both of these issues here if we're trying to"}, {"start": 4811.34, "end": 4817.34, "text": "actually implement them right well lqr is going to give us a technique to directly address this so let's talk"}, {"start": 4817.34, "end": 4826.38, "text": "about how can i use lqr to address these two issues here right lqr is going to give us a perfect way to"}, {"start": 4826.38, "end": 4835.02, "text": "do this so let's look at first how about control saturation right i think the example we showed last"}, {"start": 4835.02, "end": 4839.58, "text": "time was that if you were if you naively went about trying to place the poles of your closed loop system"}, {"start": 4839.58, "end": 4847.26, "text": "right you could get controls which was in this case vas in terms of volts right this could spike"}, {"start": 4847.26, "end": 4851.74, "text": "and this could go down i think the situation we saw was this went down to like something like minus"}, {"start": 4851.74, "end": 4859.1, "text": "90 volts right so you had this huge power requirement so so actually in this case it's"}, {"start": 4859.1, "end": 4865.42, "text": "it's with great power comes great electricity bills here right so what you know if ben parker was like"}, {"start": 4865.42, "end": 4870.38, "text": "peter uh you can't be doing this right our electricity is going through the roof peter parker should have"}, {"start": 4870.38, "end": 4876.62, "text": "just said oh geez sorry uncle ben next time why don't i i'll use an lqr controller to design my full state"}, {"start": 4876.62, "end": 4882.46, "text": "feedback system so it doesn't have this this problem right and we saw the way that that manifests itself"}, {"start": 4882.46, "end": 4889.74, "text": "here is that peter could just go ahead and vary the r matrix to make this thing um as aggressive or as"}, {"start": 4889.74, "end": 4897.98, "text": "conservative as he wants here right so what we can do here is the solution is just use the r matrix"}, {"start": 4897.98, "end": 4905.099999999999, "text": "to uh tune quote unquote the aggressiveness"}, {"start": 4908.78, "end": 4915.66, "text": "of the controller so just as an example here i'm going to run some numbers here let's use a q matrix"}, {"start": 4915.66, "end": 4917.74, "text": "of just an identity matrix"}, {"start": 4920.86, "end": 4926.94, "text": "right and then the r matrix is just going to be a single value right let's call it an r11 here right"}, {"start": 4926.94, "end": 4933.259999999999, "text": "and we see that all this is doing now is r11 or this r matrix we can tune how much do we care about"}, {"start": 4933.259999999999, "end": 4938.46, "text": "this va measurement here right so let's just make a quick table to show what this ends up being here"}, {"start": 4938.46, "end": 4946.86, "text": "so let me r11 let's just make a couple of tables and then we'll look at the resulting uh k1 k2 and k3"}, {"start": 4946.86, "end": 4951.66, "text": "values that are going to come out of lqr so what we're going to do right now here is you could run over"}, {"start": 4951.66, "end": 4960.3, "text": "to matlab and you can say matlab hey lqr of a b q and r right and this is going to spit out the gain"}, {"start": 4960.3, "end": 4966.94, "text": "matrix k here right so i would just like to do a quick little study to see the how how sensitive is"}, {"start": 4966.94, "end": 4972.46, "text": "k2 r right if i change r how does this change the result in controller here right so i just ran a couple"}, {"start": 4972.46, "end": 4979.66, "text": "of numbers here so if you just turn 0.01 here you would get a k of 10 about also again around 10 and"}, {"start": 4979.66, "end": 4984.7, "text": "about 8.7 something like that so here's one controller and this might yield something like"}, {"start": 4984.7, "end": 4988.94, "text": "this right where you have huge power requirements well all you need to start doing then right is"}, {"start": 4988.94, "end": 4993.58, "text": "peter should have just sat here and cranked this number up and see what happens so if you crank up"}, {"start": 4993.58, "end": 4998.86, "text": "r you're basically saying control gets more expensive so what happens to the controller well"}, {"start": 4998.86, "end": 5005.5, "text": "it goes down right it starts getting smaller here right so you can see it's getting less aggressive and"}, {"start": 5005.5, "end": 5009.58, "text": "if and if and if and if uncle ben is still yelling at him for eat it for for costing him too much"}, {"start": 5009.58, "end": 5014.62, "text": "electricity he just cranks this thing up again right here so one you would get something like 1.0"}, {"start": 5015.26, "end": 5026.06, "text": "0.93 and 0.34 right and then again you just for giggles let's crank it up even more so 0.32 0.25"}, {"start": 5026.06, "end": 5037.740000000001, "text": "and 0.05 here right so you basically see we get this trend here as r increases right the aggressiveness"}, {"start": 5037.740000000001, "end": 5050.22, "text": "of the controller decreases right decreases so we see r is this knob it's literally the knob of depending"}, {"start": 5050.22, "end": 5056.62, "text": "you can tell the system how much do you care about each different control um when trying to drive the"}, {"start": 5056.62, "end": 5061.900000000001, "text": "state to zero great okay so that's one issue what about what about the second issue this inability to"}, {"start": 5061.900000000001, "end": 5066.860000000001, "text": "measure the full state of the system um maybe let's leave this up here let's just tell you what let's"}, {"start": 5066.860000000001, "end": 5073.58, "text": "just erase this and we'll go back do the same thing here uh we'll start from this location and you can see"}, {"start": 5073.58, "end": 5081.66, "text": "that it's it's it's a very similar story here right so problem number two here right was the uh inability"}, {"start": 5083.34, "end": 5085.82, "text": "to measure full state"}, {"start": 5091.82, "end": 5098.54, "text": "so um unfortunately this is still a little bit nebulous even with lqr right so if you remember"}, {"start": 5098.54, "end": 5102.86, "text": "previously in our earlier discussion right what we attempted to do was we attempted to"}, {"start": 5102.86, "end": 5108.299999999999, "text": "identify which eigenvalues were associated with which states here so let me write this down here"}, {"start": 5108.299999999999, "end": 5116.46, "text": "maybe so previously right this is without lqr knowledge what we tried to do was tried to identify"}, {"start": 5116.46, "end": 5132.78, "text": "or id which eigenvalues uh were associated with which states and again let's put this word"}, {"start": 5132.78, "end": 5137.58, "text": "associated in quotes because we saw that you needed some eigenvector analysis to actually do this and"}, {"start": 5138.219999999999, "end": 5144.62, "text": "for most systems the eigenvalues are coupled to multiple states so they're kind of tangled and you"}, {"start": 5144.62, "end": 5150.3, "text": "usually can't directly do this here right but we tried to do this here because what we wanted to do"}, {"start": 5150.3, "end": 5156.0599999999995, "text": "is once we identified which eigenvalues were roughly associated with which states we only tried to move"}, {"start": 5156.0599999999995, "end": 5162.0599999999995, "text": "those poles or those eigenvalues in the hopes that it would yield the control system which had which"}, {"start": 5162.06, "end": 5167.660000000001, "text": "didn't require you to measure all of the states only to to uh measure the states or only to use the"}, {"start": 5167.660000000001, "end": 5173.9800000000005, "text": "states which you could directly measure here right well luckily for us we can lqr is going to give us"}, {"start": 5173.9800000000005, "end": 5181.740000000001, "text": "a tool to skip this here right because if you think about this now right with lqr right i don't care about"}, {"start": 5181.740000000001, "end": 5188.3, "text": "the relationship between eigenvalues and states because i have a tool or a tuning button that will directly"}, {"start": 5188.3, "end": 5194.54, "text": "allow me to penalize states directly here so with lqr what i can do is i can use q right that q matrix"}, {"start": 5195.18, "end": 5208.38, "text": "to directly um specify which states are important"}, {"start": 5208.38, "end": 5218.14, "text": "or measurable in the sense that i have a sensor to measure certain states here right so now i don't"}, {"start": 5218.14, "end": 5225.18, "text": "need to do this eigenvalue to state mapping i can just use q to directly ask what states do i care"}, {"start": 5225.18, "end": 5230.22, "text": "about here right unfortunately this is still not a perfect solution here because there still is this"}, {"start": 5230.22, "end": 5236.06, "text": "coupling right so again let's go to an example here so for example what we might want to try now is"}, {"start": 5236.06, "end": 5242.14, "text": "this q matrix right let's just make this like a q 1 1 and then zeros everywhere else"}, {"start": 5244.3, "end": 5250.14, "text": "right because what we're saying here in this case is i only care about the first state which was"}, {"start": 5250.14, "end": 5256.38, "text": "the position of the motor which happened to be the only thing we directly measure here right so the hope"}, {"start": 5256.38, "end": 5263.900000000001, "text": "here is that by just changing this value here or by only penalizing the state uh theta we're going to"}, {"start": 5263.9, "end": 5268.54, "text": "cross our fingers and hope that the lqr procedure is going to kick out a controller which doesn't"}, {"start": 5268.54, "end": 5275.66, "text": "really require me to use omega or i much here right again this is a little bit shooting from the hip"}, {"start": 5275.66, "end": 5279.98, "text": "here because it's not entirely true we're going to see that this this is a case here so tell you what"}, {"start": 5279.98, "end": 5286.54, "text": "let's use this q and an r of just one here right so in this case we can do our same thing let's make"}, {"start": 5286.54, "end": 5295.82, "text": "ourselves a little table here of what q 1 1 is right and then let's look at the resulting uh k1 k2 k3"}, {"start": 5298.22, "end": 5303.42, "text": "again by using our little our lqr technique right so shoot i didn't leave a lot of space here but you"}, {"start": 5303.42, "end": 5310.3, "text": "guys get what i'm saying right we're basically going to go here and say lqr of a b q and r and this is"}, {"start": 5310.3, "end": 5315.74, "text": "going to give me the k matrix here right but now this q is i'm only penalizing this first state here right"}, {"start": 5315.74, "end": 5321.42, "text": "so again you start here as a small q 0.01 or something like that you'd end up with this of"}, {"start": 5321.98, "end": 5331.9, "text": "0.1 0.02 0.0014 here right and actually another quantity that might be useful in this discussion"}, {"start": 5331.9, "end": 5337.58, "text": "right remember what we're trying to do here is we're we're crossing our fingers and hoping that this k"}, {"start": 5337.58, "end": 5343.74, "text": "matrix you know we're trying to implement sorry we're trying to implement the control law the control"}, {"start": 5344.3, "end": 5350.46, "text": "which was va right is minus kx right what we would really like is if you write this thing out this"}, {"start": 5350.46, "end": 5360.0599999999995, "text": "is a minus k1 times theta minus k2 times omega minus k3 times i we're hoping that these k1 k2 and k3 are"}, {"start": 5360.0599999999995, "end": 5366.38, "text": "small with respect to k1 so that we can safely neglect them and we end up with a control law that is"}, {"start": 5366.38, "end": 5373.5, "text": "realizable in this case in the sense that it is gains multiplied by states that you actually measure"}, {"start": 5373.5, "end": 5377.900000000001, "text": "here right so in other words we're hoping we can neglect these two so what might be useful here is"}, {"start": 5377.900000000001, "end": 5385.66, "text": "we actually should maybe let's look at the ratio of of k2 over k1 and k3 over k1 so let's write that"}, {"start": 5385.66, "end": 5395.26, "text": "down so k2 over k1 uh 1 in this column and k2 over i'm sorry k3 this should be k3 over k1 right"}, {"start": 5395.26, "end": 5402.0599999999995, "text": "because this gives us an idea of how big are k2 and k3 relative to k1 here right so in this case"}, {"start": 5402.06, "end": 5413.5, "text": "i think you end up with this is about being 0.19 or 19 here and 0.014 here okay so in this case i"}, {"start": 5413.5, "end": 5418.22, "text": "don't know if i would say this is is is super great here because you see that the second gain is almost"}, {"start": 5418.22, "end": 5422.700000000001, "text": "20 percent of the first one yeah this third gain is nice i think you could safely neglect it because"}, {"start": 5422.7, "end": 5429.82, "text": "it's only 1.4 percent of it but um yeah tell you what let's start cranking up q1 here to say this is"}, {"start": 5429.82, "end": 5435.099999999999, "text": "that that that that theta is the is really much more important so again we can keep working on this"}, {"start": 5435.099999999999, "end": 5442.22, "text": "table here right so um move this up 0.1 here right so in this case you would get a k1 of 0.32"}, {"start": 5443.34, "end": 5452.3, "text": "0.05 and 0.0037 here so in terms of fractions here this would be 0.17 and 0."}, {"start": 5452.3, "end": 5458.14, "text": "0.012 so it's going in the right direction right the importance is going down now it's only 17"}, {"start": 5458.14, "end": 5464.38, "text": "percent great let's keep cranking this up let's go 1.0 here right so if you go one you would get a"}, {"start": 5464.38, "end": 5472.9400000000005, "text": "k1 of actually one as well and then 0.13 and then 0.0092 so in terms of fractions here this is now"}, {"start": 5472.9400000000005, "end": 5479.42, "text": "only 13 percent here and now we're down to less than one percent so finally let's do one more just for"}, {"start": 5479.42, "end": 5487.34, "text": "giggles here right so crank k11 up to 10 here right so now you get something like 3.16 0.29"}, {"start": 5488.06, "end": 5498.38, "text": "and 0.02 here all right okay great and now we're down to 0.09 and 0.006 so here we are so you can"}, {"start": 5498.38, "end": 5504.38, "text": "kind of see that now in this regime down here i think this is getting safer to neglect k2 and k3"}, {"start": 5504.38, "end": 5509.82, "text": "because it's only 10 percent and less than one percent of the overall controller here so again"}, {"start": 5509.82, "end": 5516.3, "text": "we see that lqr gives us another tool to try to address this inability to measure full state but"}, {"start": 5516.3, "end": 5525.02, "text": "it's still not a uh a panacea here right we still get um some issues and there will be some error when"}, {"start": 5525.02, "end": 5530.22, "text": "you make this this this this this neglect here right when we neglect these other two terms"}, {"start": 5530.22, "end": 5536.62, "text": "you're basically knocking off 10 and 1 percent of of the controller kind of here right again you got"}, {"start": 5536.62, "end": 5540.7, "text": "to worry about what are they being multiplied by it's being multiplied by omega and i so"}, {"start": 5541.740000000001, "end": 5550.38, "text": "this is again a little bit uh off the cuff here right okay so um this is pretty awesome i think i think"}, {"start": 5550.38, "end": 5555.02, "text": "we had a good discussion and maybe this is a good spot to leave it let's just quickly summarize what"}, {"start": 5555.02, "end": 5563.660000000001, "text": "we ended up discussing today with our introduction to lqr so in terms of a summary all right"}, {"start": 5567.34, "end": 5574.3, "text": "what did we say we said um all right lqr we see it's a great way to generate generate a controller"}, {"start": 5574.3, "end": 5580.46, "text": "that's optimal here in the sense that it solves this optimization problem right we said that the whole deal"}, {"start": 5580.46, "end": 5586.3, "text": "with where lqr came from is we wanted to minimize this cost function j which was integral from zero to"}, {"start": 5586.3, "end": 5601.02, "text": "infinity of x transpose qx plus u transpose ru dt all right let me get rid of some of this other stuff"}, {"start": 5602.94, "end": 5608.78, "text": "so we can have a nice summary slide okay okay so we were minimizing this and we were picking"}, {"start": 5608.78, "end": 5616.86, "text": "um at first we were thinking about any control law or right your control can be anything but then we"}, {"start": 5616.86, "end": 5623.66, "text": "had to impose a constraint here that really your x's and your user not completely free they're"}, {"start": 5623.66, "end": 5629.74, "text": "coupled together and the way they're coupled together is just our our linear state transition equation"}, {"start": 5632.54, "end": 5638.219999999999, "text": "right so you're basically saying you as a control engineer give me the q and the r here and this"}, {"start": 5638.22, "end": 5643.66, "text": "optimization problem needs to solve a controller that will respect the dynamics of the system here"}, {"start": 5643.66, "end": 5648.9400000000005, "text": "right and it turns out here that the optimal control for this situation that solves this problem here"}, {"start": 5648.9400000000005, "end": 5662.22, "text": "right so we'll write the optimal solution is this controller u of minus kx where k"}, {"start": 5662.22, "end": 5672.62, "text": "right is um r inverse b transpose s here and s is the solution to the algebraic ricotti equation that we talked"}, {"start": 5672.62, "end": 5679.1, "text": "about earlier right so we saw that the actual solution here is nothing more than a full state feedback"}, {"start": 5679.1, "end": 5686.3, "text": "controller where k is computed in a very particular fashion here right so what's so awesome about this"}, {"start": 5686.3, "end": 5700.860000000001, "text": "uh lqr technique here is that as a control engineer right right lqr gives us two knobs to directly penalize"}, {"start": 5700.860000000001, "end": 5709.34, "text": "states or controls right so as a control engineer you choose the q and the r matrix here right and then you"}, {"start": 5709.34, "end": 5716.22, "text": "run the lqr process here and it will will synthesize a controller for you which respects these uh this cost"}, {"start": 5716.22, "end": 5721.900000000001, "text": "function here and tries to find something that is the best here right so q and r are much more helpful"}, {"start": 5721.900000000001, "end": 5727.34, "text": "knobs to twist because they have direct physical interpretation right q will literally tell you which"}, {"start": 5727.34, "end": 5732.54, "text": "states you care about in your system and r is going to tell you which controls are important or cheap or"}, {"start": 5732.54, "end": 5739.9800000000005, "text": "expensive or or whatnot here right so um i think that's a good spot to leave it here uh i hope you enjoyed"}, {"start": 5739.98, "end": 5746.94, "text": "this video on lqr here some of these things set the stage for some of our uh future discussions namely"}, {"start": 5746.94, "end": 5752.54, "text": "linear state estimation um is one of the topics we're going to cover in the future so with that being"}, {"start": 5752.54, "end": 5757.339999999999, "text": "said um if you like the video please subscribe to the channel because like i said we'll have these future"}, {"start": 5757.339999999999, "end": 5763.419999999999, "text": "discussions on other controls topics and other engineering uh issues in the future so i hope to catch"}, {"start": 5763.419999999999, "end": 5769.259999999999, "text": "you at one of these future videos bye"}]}